Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: If set to True, spaces are used around all operators.
sv: Om värdet är True används mellanslag runt alla operatorer.

source: Tab size
sv: Flikstorlek

source: The number of spaces per tab. Minimum 2, maximum 8.
sv: Antal mellanslag per flik. Minst 2, högst 8.

source: Use spaces?
sv: Använda utrymmen?

source: Specifies whether or not to insert spaces instead of tabs when the tab key or auto-indent are used.
sv: Anger om mellanslag ska infogas i stället för tabbar när tabbtangenten eller automatisk indragning används.

source: Auto-indent new line?
sv: Auto-indrag på ny rad?

source: Specifies whether the newly added line using enter key should be auto-indented or not
sv: Anger om en ny rad som läggs till med enter-tangenten ska vara automatiskt indragen eller inte

source: Expression Width
sv: Uttryckets bredd

source: maximum number of characters in parenthesized expressions to be kept on single line.
sv: maximalt antal tecken i parentesuttryck som ska hållas på en rad.

source: Logical operator new line
sv: Logisk operatör ny rad

source: Before
sv: Före

source: After
sv: Efter

source: Decides newline placement before or after logical operators (AND, OR, XOR).
sv: Beslutar om placering av ny rad före eller efter logiska operatorer (AND, OR, XOR).

source: Lines between queries
sv: Linjer mellan frågor

source: Decides how many empty lines to leave between SQL statements. If zero it puts no new line.
sv: Bestämmer hur många tomma rader som ska lämnas mellan SQL-satser. Om noll läggs ingen ny rad in.

source: New line before semicolon?
sv: Ny rad före semikolon?

source: Whether to place query separator (;) on a separate line.
sv: Om frågeavgränsare (;) ska placeras på en separat rad.

source: Row Limit
sv: Radgräns

source: This setting specifies the maximum number of rows that will be plotted on a chart. Increasing this limit may impact performance if charts are plotted with very high numbers of rows.
sv: Den här inställningen anger det maximala antalet rader som ska ritas upp i ett diagram. Om du ökar denna gräns kan det påverka prestandan om diagrammen ritas med ett mycket stort antal rader.

source: Users
sv: Användare

source: Owner changed successfully.
sv: Ägarbytet genomfördes framgångsrikt.

source: {0} Shared servers are associated with this user.
sv: {0} Delade servrar är associerade med den här användaren.

source: No shared servers found
sv: Inga delade servrar hittades

source: Role not found
sv: Rollen hittades inte

source: To proceed, ensure that all users assigned the '{0}' role have been reassigned.
sv: För att fortsätta måste du se till att alla användare som tilldelats rollen '{0}' har omfördelats.

source: Role name must be unique.
sv: Rollnamnet måste vara unikt.

source: User email/username must be unique for an authentication source.
sv: Användarens e-post/användarnamn måste vara unikt för en autentiseringskälla.

source: Invalid email address {0}.
sv: Ogiltig e-postadress {0}.

source: Missing field: '{0}'
sv: Saknar fält: '{0}'

source: Unable to update user '{0}'
sv: Det går inte att uppdatera användaren '{0}'

source: '{0}' is not allowed to modify.
sv: '{0}' är inte tillåtet att modifiera.

source: Deselect All
sv: Avmarkera alla

source: Permissions saved successfully
sv: Behörigheter sparade framgångsrikt

source: Select Role
sv: Välj roll

source: Role Saved Successfully
sv: Roll sparad framgångsrikt

source: Create Role...
sv: Skapa roll...

source: Create Role
sv: Skapa roll

source: Delete Role
sv: Ta bort roll

source: Are you sure you want to delete the role %s?
sv: Är du säker på att du vill ta bort rollen %s?

source: Deleting role...
sv: Radering av roll...

source: Role deleted successfully.
sv: Roll raderad framgångsrikt.

source: Edit Role - %s
sv: Redigera roll - %s

source: Edit Role
sv: Redigera roll

source: Decscription
sv: Avskrift

source: Authentication source
sv: Källa för autentisering

source: Email
sv: E-post

source: New password
sv: Nytt lösenord

source: Locked
sv: Låst

source: Username cannot be empty
sv: Användarnamnet får inte vara tomt

source: Email cannot be empty
sv: E-post kan inte vara tom

source: Invalid email address: %s
sv: Ogiltig e-postadress: %s

source: Password cannot be empty for user %s
sv: Lösenordet kan inte vara tomt för användaren %s

source: Password must be at least %s characters for user %s
sv: Lösenordet måste innehålla minst %s tecken för användaren %s

source: Confirm Password cannot be empty for user %s
sv: Bekräfta lösenord får inte vara tom för användare %s

source: Passwords do not match for user %s
sv: Lösenorden stämmer inte överens för användaren %s

source: Users Saved Successfully
sv: Användare sparade framgångsrikt

source: Create User...
sv: Skapa användare...

source: Create User
sv: Skapa användare

source: Deleting user...
sv: Radering av användare...

source: User deleted successfully.
sv: Användaren raderades framgångsrikt.

source: Delete User?
sv: Ta bort användare?

source: Are you sure you want to delete the user %s?
sv: Är du säker på att du vill ta bort användaren %s?

source: Change ownership
sv: Ändra ägande

source: Object explorer tree refresh required
sv: Uppdatering av trädet i objektutforskaren krävs

source: The ownership of the shared server was changed or the shared server was deleted, so the object explorer tree refresh is required. Do you wish to refresh the tree?
sv: Äganderätten till den delade servern har ändrats eller den delade servern har tagits bort, så det krävs en uppdatering av trädet i objektutforskaren. Vill du uppdatera trädet?

source: Edit User - %s
sv: Redigera användare - %s

source: Delete User
sv: Ta bort användare

source: Edit User
sv: Redigera användare

source: Auth Source
sv: Auth-källa

source: Fetching users...
sv: Hämtar användare...

source: User Management
sv: Användarhantering

source: Configuration for %s servers dumped to %s
sv: Konfiguration för %s servrar dumpad till %s

source: 'Servers' attribute not found in the specified file.
sv: Attributet 'Servers' hittades inte i den angivna filen.

source: '%s' attribute not found for server '%s'
sv: attributet '%s' hittades inte för servern '%s'

source: Port must be integer for server '%s'
sv: Port måste vara ett heltal för server '%s'

source: 'Host' or 'Service' attribute not found for server '%s'
sv: Attributet 'Host' eller 'Service' hittades inte för servern '%s'

source: Error parsing input file %s: %s
sv: Fel vid analys av indatafil %s: %s

source: Error reading input file %s: [%d] %s
sv: Fel vid läsning av indatafil %s: [%d] %s

source: Error creating server group '%s': %s
sv: Fel vid skapande av servergrupp '%s': %s

source: Error creating server '%s': %s
sv: Fel vid skapande av server '%s': %s

source: Error clearing server configuration with error (%s)
sv: Fel vid rensning av serverkonfiguration med fel (%s)

source: Not implemented.
sv: Ej implementerat.

source: Service Unavailable
sv: Tjänsten går inte att nå

source: Keyboard shortcuts
sv: Tangentbordsgenvägar

source: Object Breadcrumbs
sv: Objektets brödsmulor

source: Editor
sv: Redigerare

source: CSV/TXT Output
sv: CSV/TXT-utdata

source: SQL formatting
sv: SQL-formatering

source: Tab settings
sv: Inställningar för flikar

source: Refresh rates
sv: Uppdateringsfrekvenser

source: File Downloads
sv: Filhämtningar

source: Transaction ID not found in the session.
sv: Transaktions-ID hittades inte i sessionen.

source: Error fetching role information from the database server.
sv: Fel vid hämtning av rollinformation från databasservern.

source: Unable to fetch data.
sv: Det går inte att hämta data.

source: The specified user ID (%s) could not be found.
sv: Det angivna användar-ID:t (%s) kunde inte hittas.

source: Access denied: You’re having limited access. You’re not allowed to Rename, Delete or Create any files/folders
sv: Åtkomst nekad: Du har begränsad åtkomst. Du får inte byta namn på, ta bort eller skapa några filer/mappar

source: Could not find the specified server.
sv: Den angivna servern kunde inte hittas.

source: Connection to the SSH Tunnel for host '{0}' has been lost. Reconnect to the database server.
sv: Anslutningen till SSH-tunneln för värd '{0}' har förlorats. Återanslut till databasservern.

source: Manager not found. Stopped Heartbeat logging.
sv: Chefen hittades inte. Stoppad Heartbeat-loggning.

source: Heartbeat logged successfully.
sv: Heartbeat loggas framgångsrikt.

source: Stopped Heartbeat logging.
sv: Stoppad Heartbeat-loggning.

source: Invalid value for {0} option.
sv: Ogiltigt värde för alternativet {0}.

source: Could not find the specified module.
sv: Den angivna modulen kunde inte hittas.

source: Module '{0}' is no longer in use.
sv: Modulen '{0}' används inte längre.

source: Module '{0}' does not have category with id '{1}'
sv: Modul '{0}' har ingen kategori med id '{1}'

source: Could not find the specified preference.
sv: Den angivna inställningen kunde inte hittas.

source: Unauthorized request.
sv: Din förfrågan kunde inte autentiseras.

source: Cursor could not be found for the async connection.
sv: Det gick inte att hitta någon markör för async-anslutningen.

source: Failed to decrypt the saved password. Error: {0}
sv: Misslyckades med att dekryptera det sparade lösenordet. Felmeddelande: {0}

source: Failed to setup the role {0}
sv: Misslyckades med att konfigurera rollen {0}

source: Failed to create cursor for psycopg3 connection with error message for the server#{1}:{2}: {0}
sv: Misslyckades med att skapa markör för psycopg3-anslutning med felmeddelande för server#{1}:{2}: {0}

source: Attempting to reconnect to the database server (#{server_id}) for the connection - '{conn_id}'.
sv: Försöker återansluta till databasservern (#{server_id}) för anslutningen - '{conn_id}'.

source: Asynchronous query execution/operation underway.
sv: Asynkron exekvering/operation av frågor pågår.

source: The query executed did not return any data.
sv: Den utförda förfrågan returnerade inte några data.

source: Failed to reset the connection to the server due to following error: {0}
sv: Det gick inte att återställa anslutningen till servern på grund av följande fel: {0}

source: Not connected to the database server.
sv: Inte ansluten till databasservern.

source: Asynchronous notification "{0}" with payload "{1}" received from server process with PID {2}
sv: Asynkron avisering "{0}" med nyttolast "{1}" mottagen från serverprocess med PID {2}

source: Asynchronous notification "{0}" received from server process with PID {1}
sv: Asynkron avisering "{0}" mottagen från serverprocess med PID {1}

source: SQL state:
sv: SQL-tillstånd:

source: Detail:
sv: Detalj:

source: Hint:
sv: Tips:

source: Character:
sv: Tecken:

source: Context:
sv: Sammanhang:

source: Information is not available.
sv: Informationen är inte tillgänglig.

source: Could not find the specified database.
sv: Den angivna databasen kunde inte hittas.

source: Failed to decrypt the SSH tunnel password. Error: {0}
sv: SSH-tunnelns lösenord kunde inte dekrypteras. Felmeddelande: {0}

source: Failed to create the SSH tunnel. Error: {0}
sv: Misslyckades med att skapa SSH-tunneln. Felmeddelande: {0}
