Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: The master password retrieved from the master password hook utility is different from what was previously retrieved.
sv: Det huvudlösenord som hämtas från verktyget för huvudlösenordskrok skiljer sig från det som tidigare hämtades.

source: Do you want to reset your master password to match?
sv: Vill du återställa ditt huvudlösenord så att det matchar?

source: Note that this will close all open database connections and remove all saved passwords.
sv: Observera att detta kommer att stänga alla öppna databasanslutningar och ta bort alla sparade lösenord.

source: This will remove all the saved passwords. This will also remove established connections to the server and you may need to reconnect again. Do you wish to continue?
sv: Detta tar bort alla sparade lösenord. Detta tar också bort etablerade anslutningar till servern och du kan behöva ansluta på nytt. Vill du fortsätta?

source: Please make sure to disconnect the server and update the new password in the pgpass file before performing any other operation
sv: Se till att koppla bort servern och uppdatera det nya lösenordet i pgpass-filen innan du utför någon annan åtgärd

source: Change pgAdmin User Password
sv: Ändra lösenord för pgAdmin-användare

source: Rename Tab
sv: Byt namn på fliken

source: Timings
sv: Tider

source: Rows
sv: Rader

source: Loops
sv: Slingor

source: Exclusive
sv: Exklusiv

source: Inclusive
sv: Inklusive

source: Rows X
sv: Rader X

source: Actual
sv: ﻿Faktisk

source: Statistics per Node Type
sv: Statistik per nodtyp

source: Node type
sv: Typ av nod

source: Count
sv: Antal

source: Time spent
sv: Tidsåtgång

source: of query
sv: av förfrågan

source: Statistics per Relation
sv: Statistik per relation

source: Relation name
sv: Relationens namn

source: Scan count
sv: Antal skanningar

source: Sum of times
sv: Summan av tider

source: of relation
sv: av relation

source: Zoom in
sv: Zooma in

source: Zoom to original
sv: Zooma till original

source: Zoom out
sv: Zooma ut

source: Join Filter
sv: Anslut filter

source: Filter
sv: Filtrera

source: Rows Removed by Filter
sv: Rader borttagna genom filter

source: Buckets
sv: Skopor

source: Batches
sv: Batchar

source: Memory Usage
sv: Användning av minne

source: Recheck Cond
sv: Kontrollera kond. igen

source: Heap Blocks
sv: Block i heap

source: Use Explain/Explain analyze button to generate the plan for a query. Alternatively, you can also execute "EXPLAIN (FORMAT JSON) [QUERY]".
sv: Använd Explain/Explain analyze-knappen för att generera planen för en fråga. Alternativt kan du också köra "EXPLAIN (FORMAT JSON) [QUERY]".

source: No objects are found to display
sv: Inga objekt hittas för att visa

source: Searching...
sv: Söker…

source: Please enter minimum 3 characters to search
sv: Ange minst 3 tecken för att söka

source: No search results
sv: Inga sökresultat

source: Show all
sv: Visa alla

source: Changes will be lost. Are you sure you want to reset?
sv: Ändringar kommer att gå förlorade. Är du säker på att du vill återställa?

source: Saving...
sv: Sparar...

source: No updates.
sv: Inga uppdateringar.

source: SQL help for this object type.
sv: SQL-hjälp för den här objekttypen.

source: Help for this dialog.
sv: Hjälp för denna dialog.

source: Reset
sv: Återställ

source: Edit object...
sv: Redigera objekt...

source: Add
sv: Lägg till

source: Add row
sv: Lägg till rad

source: Delete row
sv: Radera rad

source: Delete Row
sv: Radera rad

source: Are you sure you wish to delete this row?
sv: Är du säker på att du vill radera den här raden?

source: Edit row
sv: Redigera rad

source: Maximum %s '%s' allowed
sv: Maximalt %s '%s' tillåtet

source: %s must be unique.
sv: %s måste vara unik.

source: %s in %s must be unique.
sv: %s i %s måste vara unika.

source: %s in %s
sv: %s i %s

source: Forget Password
sv: Glömt lösenord

source: Enter the email address for the user account you wish to recover the password for:
sv: Ange e-postadressen för det användarkonto som du vill återställa lösenordet för:

source: Email Address
sv: E-postadress

source: Recover Password
sv: Återställ Lösenord

source: Login
sv: Logga in

source: Email Address / Username
sv: E-postadress / Användarnamn

source: Forgotten your password?
sv: Glömt ditt lösenord?

source: Login with %s
sv: Logga in med %s

source: Authentication Registration
sv: Autentisering Registrering

source: Haven't received an email?
sv: Har du inte fått något e-postmeddelande?

source: Send again
sv: Skicka igen

source: Validate
sv: Bekräfta

source: Logout
sv: Logga ut

source: Reset Password
sv: Återställ lösenord

source: Retype Password
sv: Skriv in lösenord igen

source: No options
sv: Inga alternativ

source: Select a file
sv: Välj en fil

source: <Select All>
sv: <Markera alla>

source: Select an item...
sv: Välj ett objekt...

source: Select the color
sv: Välj färg

source: Close Message
sv: Stäng meddelande

source: Loading
sv: Läser in

source: No rows found.
sv: Inga rader hittades.

source: Select All Rows
sv: Välj alla rader

source: Select Row
sv: Välj rad

source: No rows found
sv: Inga rader hittades

source: Alert
sv: Varning

source: (in minutes)
sv: (i minuter)

source: Preview not available...
sv: Förhandsgranskning ej tillgänglig...

source: Copied!
sv: Kopierad!

source: Copy
sv: Kopiera

source: Previous
sv: Föregående

source: Next
sv: Nästa

source: Replace
sv: Ersätt

source: Replace All
sv: Ersätt alla

source: More
sv: Mer

source: Nothing to open
sv: Inget att öppna

source: Invalid MenuItem instance
sv: Ogiltig MenuItem-instans

source: Maximize
sv: Helskärm

source: Minimize
sv: Sidospalt

source: Connection Lost
sv: Förlust av anslutning

source: All Rows
sv: Alla rader

source: Filtered Rows...
sv: Filtrerade rader...

source: Clear
sv: Rensa

source: Maximise
sv: Maximera

source: Restore
sv: Återställ

source: Close Others
sv: Nära andra

source: Close All
sv: Stäng alla

source: Back
sv: Tillbaka

source: Finish
sv: Slutför

source: Error resetting the tree saved state."
sv: Fel vid återställning av trädets sparade tillstånd."

source: Databases with = symbols in the name cannot be backed up or restored using this utility.
sv: Databaser med =-symboler i namnet kan inte säkerhetskopieras eller återställas med hjälp av detta verktyg.

source: Please select server or child node from the object explorer.
sv: Välj server eller underordnad nod från objektutforskaren.

source: Please select a database or its child node from the browser.
sv: Välj en databas eller dess underordnade nod från webbläsaren.

source: Backup
sv: Säkerhetskopia

source: Backing up an object on the server
sv: Säkerhetskopiera ett objekt på servern

source: Backing up the global objects
sv: Säkerhetskopiering av globala objekt

source: Backing up the server
sv: Säkerhetskopiera servern

source: Unknown Backup
sv: Okänd backup

source: Backing up an object on the server '{0}' from database '{1}'
sv: Säkerhetskopiering av ett objekt på servern '{0}' från databasen '{1}'

source: Backing up the global objects on the server '{0}'
sv: Säkerhetskopiering av de globala objekten på servern '{0}'

source: Backing up the server '{0}'
sv: Säkerhetskopiering av servern '{0}'

source: Backup Object
sv: Objekt för säkerhetskopiering

source: Backup Globals
sv: Globala säkerhetskopior

source: Backup Server
sv: Server för säkerhetskopiering

source: Please select any server from the object explorer to take Backup of global objects.
sv: Välj en server från objektutforskaren för att ta backup av globala objekt.

source: Please select any server from the object explorer to take Server Backup.
sv: Välj en server från objektutforskaren för att ta Server Backup.

source: Please select any database or schema or table from the object explorer to take Backup.
sv: Välj en databas eller ett schema eller en tabell från objektutforskaren för att ta Backup.

source: Backup Error
sv: Fel vid säkerhetskopiering

source: Backup (${pgBrowser.Nodes[data._type].label}: ${data.label})
sv: Säkerhetskopiering (${pgBrowser.Nodes[data._type].label}: ${data.label})

source: Pre-data
sv: Förhandsdata

source: Sections
sv: Sektioner

source: Only data
sv: Endast data

source: Type of objects
sv: Typ av objekt

source: Only schemas
sv: Endast scheman

source: Only tablespaces
sv: Endast bordsytor

source: Only roles
sv: Endast roller

source: Blobs
sv: Klumpar

source: Do not save
sv: Spara inte

source: Role passwords
sv: Lösenord för roll

source: Unlogged table data
sv: Data från odränerad tabell

source: Toast compressions
sv: Kompressioner av rostat bröd

source: Table access methods
sv: Metoder för tabellåtkomst

source: Verbose messages
sv: Fördjupade meddelanden

source: Force double quote on identifiers
sv: Tvinga fram dubbla citattecken på identifierare

source: Use SET SESSION AUTHORIZATION
sv: Använd SET SESSION AUTHORIZATION

source: Exclude schema
sv: Uteslut schema

source: Exclude database
sv: Uteslut databas

source: Extra float digits
sv: Extra float-siffror

source: Lock wait timeout
sv: Tidsgräns för väntan på lås

source: Table(s)
sv: Tabell(er)

source: Table Options
sv: Tabellalternativ

source: Table(s) data
sv: Tabelldata

source: Table(s) and children
sv: Tabell(er) och barn

source: Table(s) data and children
sv: Tabelldata och barn

source: Filename
sv: Filnamn

source: Format
sv: Formatera

source: Custom
sv: Anpassad

source: Plain
sv: Enkel

source: Compression ratio
sv: Kompressionsförhållande

source: Number of jobs
sv: Antal arbetstillfällen

source: Role name
sv: Rollnamn

source: The backup format will be PLAIN
sv: Säkerhetskopieringsformatet kommer att vara PLAIN

source: Data Options
sv: Alternativ för data

source: Use INSERT Commands
sv: Använd INSERT-kommandon

source: Query Options
sv: Alternativ för frågor

source: Maximum rows per INSERT command
sv: Maximalt antal rader per INSERT-kommando

source: On conflict do nothing to INSERT command
sv: Vid konflikt gör ingenting med INSERT-kommandot

source: Include CREATE DATABASE statement
sv: Inkludera CREATE DATABASE-satsen

source: Include DROP DATABASE statement
sv: Inkludera DROP DATABASE-satsen

source: Include IF EXISTS clause
sv: Inkludera IF EXISTS-klausul

source: Use Column INSERTS
sv: Använd kolumn INSERTS

source: Load via partition root
sv: Läs in via partitionsrot

source: Enable row security
sv: Aktivera radsäkerhet

source: This option is enabled only when Use INSERT Commands is enabled.
sv: Detta alternativ är endast aktiverat när Use INSERT Commands är aktiverat.

source: Include table(s) and Children
sv: Inkludera bord och barn

source: Exclude patterns
sv: Uteslut mönster

source: Objects
sv: Objekt

source: objects
sv: objekt

source: If Schema(s) is selected then it will take the backup of that selected schema(s) only
sv: Om Schema(s) väljs kommer det att ta säkerhetskopia av det valda schemat (s) endast

source: Please provide a filename.
sv: Ange ett filnamn.

source: Only objects global to the entire database will be backed up, in PLAIN format
sv: Endast objekt som är globala för hela databasen kommer att säkerhetskopieras, i PLAIN-format

source: Continue/Start
sv: Fortsätt/Starta

source: Stop
sv: Stoppa

source: Step into
sv: Gå in i

source: Step over
sv: Steg över

source: Toggle breakpoint
sv: Växla brytpunkt

source: Clear all breakpoints
sv: Rensa alla brytpunkter

source: Edit grid values
sv: Redigera värden i rutnätet

source: Previous tab
sv: Tidigare flik

source: Next tab
sv: Nästa flik

source: Switch Panel
sv: Brytarpanel

source: The specified %s could not be found.
sv: Den angivna %s kunde inte hittas.

source: is not defined in package body.
sv: är inte definierad i paketet.

source: Functions with a colon in the name cannot be debugged.
sv: Funktioner med ett kolon i namnet kan inte felsökas.

source: EDB Advanced Server wrapped functions cannot be debugged.
sv: EDB Advanced Server inplastade funktioner kan inte felsökas.

source: An 'edbspl' target with a variadic argument is not supported and cannot be debugged.
sv: Ett "edbspl"-mål med ett variadiskt argument stöds inte och kan inte felsökas.

source: Failed to find the pldbgapi extension in this database.
sv: Misslyckades med att hitta pldbgapi-tillägget i den här databasen.

source: The debugger plugin is not enabled. Please create the pldbgapi extension in this database.
sv: Plugin för felsökare är inte aktiverat. Skapa pldbgapi-tillägget i den här databasen.

source: You must be a superuser to set a global breakpoint and perform indirect debugging.
sv: Du måste vara superanvändare för att kunna sätta en global brytpunkt och utföra indirekt felsökning.

source: Could not fetch debugger plugin information.
sv: Det gick inte att hämta information om debugger-plugin.

source: The debugger plugin is not enabled. Please add the plugin to the shared_preload_libraries setting in the postgresql.conf file and restart the database server for indirect debugging.
sv: Insticksprogrammet för felsökning är inte aktiverat. Lägg till insticksprogrammet i inställningen shared_preload_libraries i filen postgresql.conf och starta om databasservern för indirekt felsökning.

source: Please upgrade the pldbgapi extension to 1.1 or above and try again.
sv: Uppgradera pldbgapi-tillägget till 1.1 eller högre och försök igen.

source: Debugging aborted successfully.
sv: Felsökningen avbröts framgångsrikt.

source: Value deposited successfully
sv: Värdet deponerades framgångsrikt

source: Error while setting the value
sv: Fel vid inställning av värdet

source: Execution completed with an error.
sv: Exekveringen avslutades med ett fel.

source: Execution Completed.
sv: Verkställighet avslutad.

source: Debugging
sv: Felsökning

source: Debug
sv: Felsök

source: Set Breakpoint
sv: Ställ in brytpunkt

source: Debugger Target Initialization Error
sv: Initialiseringsfel för felsökningsobjekt

source: Debugger Error
sv: Fel i felsökningsverktyget

source: Current database has been moved or renamed to ${db_label}. Click on the OK button to refresh the database name.
sv: Den aktuella databasen har flyttats eller bytt namn till ${db_label}. Klicka på OK-knappen för att uppdatera databasnamnet.

source: Null?
sv: Noll?

source: Expression?
sv: Uttryck?

source: YYYY-MM-DD
sv: ÅÅÅÅ-MM-DD

source: Use Default?
sv: Använda standard?

source: Unable to fetch the arguments from server
sv: Det går inte att hämta argumenten från servern

source: Clear failed
sv: Rensning misslyckades

source: Error occurred:
sv: Fel inträffade:

source: Debugger Listener Startup Error
sv: Fel vid start av felsökningslyssnare

source: Clear All
sv: Rensa alla

source: Debugger Aborted
sv: Felsökare avbruten

source: Debugger has been aborted. On clicking the ok button, debugger panel will be closed.
sv: Felsökaren har avbrutits. När du klickar på ok-knappen kommer felsökningspanelen att stängas.

source: Error while starting debugging listener.
sv: Fel vid start av debugging listener.

source: Error while polling result.
sv: Fel vid pollning av resultat.

source: Error while clearing all breakpoint.
sv: Fel vid rensning av alla brytpunkter.

source: Error while fetching breakpoint information.
sv: Fel vid hämtning av brytpunktsinformation.

source: Not connected to server or connection with the server has been closed.
sv: Inte ansluten till servern eller anslutningen till servern har stängts.

source: Error while fetching messages information.
sv: Fel vid hämtning av meddelandeinformation.

source: Error while starting debugging session.
sv: Fel vid start av felsökningssession.

source: Error while executing requested debugging information.
sv: Fel under exekvering av begärd felsökningsinformation.

source: Error while selecting frame.
sv: Fel vid val av ram.

source: Error while executing stop in debugging session.
sv: Fel vid körning av stop i felsökningssession.

source: Debugger poll end execution error
sv: Fel i felsökarens poll vid slutet av exekveringen

source: Error while executing continue in debugging session.
sv: Fel vid körning av continue i felsökningssession.

source: Error while executing step over in debugging session.
sv: Fel vid exekvering av step over i felsökningssession.

source: Error while fetching variable information.
sv: Fel vid hämtning av variabelinformation.

source: Error while fetching stack information.
sv: Fel vid hämtning av stackinformation.

source: Error in update
sv: Fel i uppdateringen

source: Waiting for another session to invoke the target...
sv: Väntar på en annan session för att anropa målet...

source: Debugger Error: poll_result
sv: Felsökningsfel: poll_result

source: Error while executing step into in debugging session.
sv: Fel vid exekvering av step into i felsökningssession.

source: Error while depositing variable value.
sv: Fel vid insättning av variabelt värde.

source: Local Variables
sv: Lokala variabler

source: Messages
sv: Meddelanden

source: Stack
sv: Stapel

source: Error while setting debugging breakpoint.
sv: Fel vid inställning av brytpunkt för felsökning.

source: No data found
sv: Inga data hittades

source: Line No.
sv: Radnr.

source: Reset layout
sv: Återställ layout

source: Debugger -
sv: Felsökare -

source: ERD tool
sv: ERD-verktyg

source: Open project
sv: Öppna projekt

source: Save project
sv: Spara projekt

source: Save project as
sv: Spara projektet som

source: Generate SQL
sv: Generera SQL

source: Download image
sv: Hämta ner bild

source: Add table
sv: Lägg till tabell

source: Edit table
sv: Redigera tabell

source: Clone table
sv: Klona tabell

source: Drop table
sv: Nedfällbart bord

source: Add/Edit note
sv: Lägg till/ändra anteckning

source: One to one link
sv: En till en-länk

source: One to many link
sv: Länk från en till många

source: Many to many link
sv: Länk från många till många

source: Auto align
sv: Automatisk justering

source: Show more/fewer details
sv: Visa mer/färre detaljer

source: Zoom to fit
sv: Zooma för att passa

source: SQL With DROP Table
sv: SQL med DROP-tabell

source: If enabled, the SQL generated by the ERD Tool will add DROP table DDL before each CREATE table DDL.
sv: Om den är aktiverad kommer den SQL som genereras av ERD-verktyget att lägga till DROP table DDL före varje CREATE table DDL.

source: Table Relation Depth
sv: Tabellrelationsdjup

source: The maximum depth pgAdmin should traverse to find related tables when generating an ERD for a table. Use -1 for no limit.
sv: Det maximala djup som pgAdmin ska gå igenom för att hitta relaterade tabeller när en ERD genereras för en tabell. Använd -1 för ingen gräns.

source: Cardinality Notation
sv: Notation av kardinalitet

source: Crow's foot
sv: Kråkfot

source: Notation to be used to present cardinality.
sv: Notation som ska användas för att presentera kardinalitet.

source: ERD Error
sv: ERD-fel

source: No object selected.
sv: Inget objekt valt.

source: Please select a database/database object.
sv: Välj en databas/ett databasobjekt.

source: Connected
sv: Ansluten

source: Connecting
sv: Ansluter

source: Disconnected
sv: Frånkopplad

source: (Obtaining connection...)
sv: (Upprättande av anslutning...)

source: (Connection failed)
sv: (Anslutningen misslyckades)

source: Preparing...
sv: Förbereder...

source: Save changes?
sv: Spara ändringarna?

source: The diagram has changed. Do you want to save changes?
sv: Diagrammet har ändrats. Vill du spara ändringarna?

source: Table: %s (%s)
sv: Tabell: %s (%s)

source: Table name already exists
sv: Tabellnamnet finns redan

source: Cannot drop table from outside of the current database.
sv: Det går inte att ta bort en tabell från en annan databas än den aktuella.

source: Delete ?
sv: Ta bort?

source: You have selected %s tables and %s links.
sv: Du har valt %s tabeller och %s länkar.

source: Are you sure you want to delete ?
sv: Är du säker på att du vill radera?

source: Loading project...
sv: Läser in projekt...

source: Project saved successfully.
sv: Projektet har sparats framgångsrikt.

source: -- This script was generated by the ERD tool in pgAdmin 4.
sv: -- Detta skript skapades av ERD-verktyget i pgAdmin 4.

source: -- Please log an issue at https://github.com/pgadmin-org/pgadmin4/issues/new/choose if you find any bugs, including reproduction steps.
sv: -- Logga ett problem på https://github.com/pgadmin-org/pgadmin4/issues/new/choose om du hittar några buggar, inklusive reproduktionssteg.

source: Preparing the SQL...
sv: Förberedelse av SQL...

source: Preparing the image...
sv: Förberedelse av bilden...

source: Unknown error. Check console logs
sv: Okänt fel. Kontrollera konsolloggar

source: Maximum image size limit
sv: Begränsning av maximal bildstorlek

source: The downloaded image has exceeded the maximum size of 32767 x 32767 pixels, and has been cropped to that size.
sv: Den hämtade bilden har överskridit den maximala storleken på 32767 x 32767 pixlar och har beskurits till den storleken.

source: One to one relation
sv: En till en relation

source: One to many relation
sv: Relation mellan en och många

source: Many to many relation
sv: Relation många till många

source: Initializing connection...
sv: Initialisering av anslutning...

source: Fetching required data...
sv: Hämtar erforderliga data...

source: Fetching schema data...
sv: Hämtar schemadata...

source: Unsaved changes
sv: Ändringar som inte sparats

source: Are you sure you wish to discard the current changes?
sv: Är du säker på att du vill förkasta de aktuella ändringarna?

source: Load Project
sv: Läs in projekt

source: Save Project
sv: Spara projekt

source: SQL Options
sv: SQL-alternativ

source: Add Table
sv: Lägg till bord

source: Edit Table
sv: Redigera tabell

source: Clone Table
sv: Klonbord

source: Drop Table/Relation
sv: Drop Tabell/Relation

source: One-to-One Relation
sv: En-till-en-relation

source: One-to-Many Relation
sv: En-till-många-relation

source: Many-to-Many Relation
sv: Många-till-många-relation

source: Fill Color
sv: Fyllningsfärg

source: Text Color
sv: Textfärg

source: Add/Edit Note
sv: Lägg till/redigera anteckning

source: Auto Align
sv: Automatisk justering

source: Show Details
sv: Visa detaljer

source: Zoom In
sv: Zooma in

source: Zoom to Fit
sv: Zooma för att passa

source: Zoom Out
sv: Zooma ut

source: File Menu
sv: Meny Arkiv

source: Save as
sv: Spara som

source: With DROP Table
sv: Med DROP-tabell

source: Crow's Foot Notation
sv: Kråkfotsnotation

source: Local Table
sv: Lokalt bord

source: Local Column
sv: Lokal krönika

source: Referenced Column
sv: Refererad kolumn

source: Select constraint
sv: Välj begränsning

source: A constraint is required to implement One to One relationship.
sv: En begränsning krävs för att implementera en en-till-en-relation.

source: Primary key already exists, please select different constraint.
sv: Primärnyckel finns redan, välj en annan begränsning.

source: Check Note
sv: Kontrollera not

source: Fetching...
sv: Hämtar…

source: Failed to get data. Please delete this table.
sv: Misslyckades med att hämta data. Radera denna tabell.

source: Unable to fetch the {} objects
sv: Det går inte att hämta {} objekt

source: Object Selection
sv: Val av objekt

source: Privilege Selection
sv: Val av privilegier

source: Error while fetching grant wizard data.
sv: Fel vid hämtning av data från Grant Wizard.

source: Error while fetching SQL.
sv: Fel vid hämtning av SQL.

source: Error while saving grant wizard data: ${error.response.data.errormsg}
sv: Fel vid sparande av data från Grant Wizard: ${error.response.data.errormsg}

source: Please select any database object.
sv: Välj valfritt databasobjekt.

source: The SQL below will be executed on the database server to grant the selected privileges. Please click on Finish to complete the process.
sv: SQL-koden nedan kommer att köras på databasservern för att ge de valda behörigheterna. Klicka på Finish för att slutföra processen.
