Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Could not find the specified schedule.
sv: Det gick inte att hitta det angivna schemat.

source: Job schedule creation failed.
sv: Skapandet av jobbschemat misslyckades.

source: DBMS Schedule
sv: DBMS-schema

source: DBMS Schedule...
sv: DBMS-schema...

source: Repeat Interval
sv: Intervall för upprepning

source: Repeat
sv: Upprepa

source: YYYY-MM-DD HH:mm:ss Z
sv: ÅÅÅÅÅ-MM-DD HH:mm:ss Z

source: End
sv: Slut

source: Frequency
sv: Frekvens

source: Select the frequency...
sv: Välj frekvens...

source: Date
sv: Datum

source: YYYYMMDD
sv: ÅÅÅÅMMDD

source: Months
sv: Månader

source: Select the months...
sv: Välj de månader...

source: Week Days
sv: Vardagar

source: Select the weekdays...
sv: Välj veckodagar...

source: Month Days
sv: Månad Dagar

source: Select the month days...
sv: Välj månadens dagar...

source: Hours
sv: Timmar

source: Select the hours...
sv: Välj timmar...

source: Minutes
sv: Minuter

source: Select the minutes...
sv: Välj minuterna...

source: Type
sv: Typ

source: Action
sv: Åtgärd

source: Code
sv: Kod

source: Procedure
sv: Procedur

source: Number of Arguments
sv: Antal argument

source: Arguments
sv: Argument

source: Data type
sv: Datatyp

source: Default
sv: Standard

source: Value
sv: Värde

source: Error
sv: Fel

source: Start Time
sv: Starttid

source: End Time
sv: Sluttid

source: Next Run
sv: Nästa körning

source: Event Triggers
sv: Utlösare för händelser

source: Could not find the specified event trigger.
sv: Den angivna händelseutlösaren kunde inte hittas.

source: Could not find the event trigger information.
sv: Kunde inte hitta informationen om händelseutlösaren.

source: The specified event trigger could not be found.
sv: Den angivna händelseutlösaren kunde inte hittas.

source: Event trigger dropped
sv: Händelseutlösare togs bort

source: Could not find the specified event trigger on the server.
sv: Den angivna händelseutlösaren kunde inte hittas på servern.

source: Event Trigger
sv: Händelseutlösare

source: Event Trigger...
sv: Händelseutlösare...

source: Owner
sv: Ägare

source: System event trigger?
sv: Systemhändelseutlösare?

source: Trigger enabled?
sv: Utlösare aktiverad?

source: Enable
sv: Aktivera

source: Disable
sv: Inaktivera

source: Replica
sv: Replika

source: Always
sv: Alltid

source: Trigger function
sv: Utlösarfunktion

source: Event
sv: Evenemang

source: When TAG in
sv: När TAG i

source: Security labels
sv: Säkerhetsetiketter

source: Security
sv: Säkerhet

source: Event trigger function cannot be empty.
sv: Händelseutlösarfunktionen kan inte vara tom.

source: Extensions
sv: Utökningar

source: Could not find the specified extension.
sv: Det angivna tillägget kunde inte hittas.

source: Could not find the extension information.
sv: Kunde inte hitta förlängningsinformationen.

source: The specified extension could not be found.
sv: Det angivna tillägget kunde inte hittas.

source: Extension dropped
sv: Utökning togs bort

source: Could not find the extension on the server.
sv: Det gick inte att hitta tillägget på servern.

source: Extension
sv: Utökning

source: Extension...
sv: Utökning...

source: Cascade?
sv: Kaskad?

source: Relocatable?
sv: Flyttbar?

source: System extension?
sv: Systemförlängning?

source: Name cannot be empty.
sv: Namnet får inte vara tomt.

source: Foreign Data Wrappers
sv: Främmande dataförpackningar

source: Could not find the specified foreign data wrapper.
sv: Kunde inte hitta den angivna främmande dataomslaget.

source: Could not find the foreign data wrapper information.
sv: Det gick inte att hitta informationen om den främmande dataförpackningen.

source: The specified foreign data wrapper could not be found.
sv: Den angivna omslutningen av främmande data kunde inte hittas.

source: Foreign Data Wrapper dropped
sv: Främmande dataomslag togs bort

source: Could not find the foreign data wrapper on the server.
sv: Kunde inte hitta den främmande dataomslaget på servern.

source: Foreign Servers
sv: Främmande servrar

source: Could not find the specified foreign server.
sv: Den angivna främmande servern kunde inte hittas.

source: The specified foreign server could not be found.
sv: Den angivna främmande servern kunde inte hittas.

source: The specified foreign server could not be found.
sv: Den angivna främmande servern kunde inte hittas.

source: Foreign Server dropped
sv: Främmande server togs bort

source: Foreign Server
sv: Främmande server

source: Foreign Server...
sv: Främmande server...

source: System foreign server?
sv: Systemutländsk server?

source: Options
sv: Alternativ

source: Privileges
sv: Privilegier

source: User Mappings
sv: Mappning av användare

source: Could not find the specified user mapping.
sv: Den angivna användarmappningen kunde inte hittas.

source: The specified user mappings could not be found.
sv: De angivna användarmappningarna kunde inte hittas.

source: The specified user mapping could not be found.
sv: Den angivna användarmappningen kunde inte hittas.

source: User Mapping dropped
sv: Mappning av användare togs bort

source: User Mapping
sv: Mappning av användare

source: User Mapping...
sv: Kartläggning av användare...

source: User
sv: Användare

source: System user mapping?
sv: Mappning av systemanvändare?

source: Foreign Data Wrapper
sv: Främmande dataomslag

source: Foreign Data Wrapper...
sv: Främmande dataomslag...

source: System foreign data wrapper?
sv: Systemets främmande dataomslag?

source: Handler
sv: Handläggare

source: Validator
sv: Validerare

source: Languages
sv: Språk

source: Could not find the language information.
sv: Kunde inte hitta språkinformationen.

source: Could not find the specified language.
sv: Det angivna språket kunde inte hittas.

source: Language dropped
sv: Språket togs bort

source: Language
sv: Språk

source: Language...
sv: Språk...

source: System language?
sv: Systemspråk?

source: Trusted?
sv: Betrodda?

source: Handler function
sv: Hanterar funktion

source: Inline function
sv: Inline-funktion

source: Validator function
sv: Valideringsfunktion

source: Handler function cannot be empty.
sv: Handlerfunktionen kan inte vara tom.

source: Publications
sv: Publikationer

source: Could not find the publication information.
sv: Kunde inte hitta publikationsinformationen.

source: Could not find the specified publication.
sv: Det gick inte att hitta den angivna publikationen.

source: Publication dropped
sv: Publiceringen togs bort

source: Publication
sv: Publikation

source: Publication...
sv: Publikation...

source: With
sv: Med

source: Publish via root?
sv: Publicera via root?

source: %s <= Supported version >= %s
sv: %s <= Version som stöds >= %s

source: Supported version >= %s
sv: Version som stöds >= %s

source: Supported version <= %s
sv: Version som stöds <= %s

source: Table Name
sv: Tabellnamn

source: Columns
sv: Kolumner

source: Where
sv: Var

source: All tables?
sv: Alla bord?

source: Tables
sv: Tabeller

source: Only table?
sv: Bara bord?

source: If ONLY is specified before the table name, only that table is added to the publication. If ONLY is not specified, the table and all its descendant tables (if any) are added.
sv: Om ONLY anges före tabellnamnet läggs endast den tabellen till i publikationen. Om ONLY inte anges läggs tabellen och alla dess eventuella underordnade tabeller till.

source: Tables in Schema
sv: Tabeller i schema

source: Schemas
sv: Scheman

source: Catalogs
sv: Kataloger

source: Could not find the schema in the database. It may have been removed by another user.
sv: Det gick inte att hitta schemat i databasen. Det kan ha tagits bort av en annan användare.

source: Could not find the schema in the database. It may have been removed by another user.
sv: Det gick inte att hitta schemat i databasen. Det kan ha tagits bort av en annan användare.

source: Could not find the schema in the database. It may have been removed by another user.
sv: Det gick inte att hitta schemat i databasen. Det kan ha tagits bort av en annan användare.

source: The specified schema could not be found.
sv: Det angivna schemat kunde inte hittas.

source: Schema dropped
sv: Schema togs bort

source: Definition incomplete.
sv: Definitionen är ofullständig.

source: Could not find the schema in the database. It may have been removed by another user.
sv: Det gick inte att hitta schemat i databasen. Det kan ha tagits bort av en annan användare.

source: Aggregates
sv: Aggregat

source: Aggregate
sv: Sammanslagna

source: System aggregate?
sv: Systemaggregat?

source: Input types
sv: Inmatningstyper

source: State type
sv: Typ av stat

source: State function
sv: Statens funktion

source: State data size
sv: Storlek på statusdata

source: Final type
sv: Slutlig typ

source: Final function
sv: Slutlig funktion

source: Final function modify
sv: Slutlig funktion modifiera

source: Pass extra arguments to final function
sv: Skicka extra argument till den slutliga funktionen

source: Initial condition
sv: Initialt tillstånd

source: Moving Options
sv: Alternativ för flyttning

source: Inverse function
sv: Invers funktion

source: Sort operator
sv: Sortera operatör

source: Advanced
sv: Avancerat

source: Combine function
sv: Kombinera funktion

source: Serialization function
sv: Serialiseringsfunktion

source: Deserialization function
sv: Deserialiseringsfunktion

source: Catalog Objects
sv: Katalogobjekt

source: Could not find the specified catalog object.
sv: Det gick inte att hitta det angivna katalogobjektet.

source: Could not find the specified column.
sv: Den angivna kolumnen kunde inte hittas.

source: catalog_object_column
sv: katalog_objekt_kolumn

source: Column
sv: Kolumn

source: Collation
sv: Kollation

source: System column?
sv: Systemkolumn?

source: Catalog Object
sv: Katalogobjekt

source: System database?
sv: Systemdatabas?

source: Collations
sv: Kollationer

source: Definition incomplete. Please provide Locale OR Copy Collation OR LC_TYPE/LC_COLLATE.
sv: Definitionen är ofullständig. Ange Locale OR Copy Collation OR LC_TYPE/LC_COLLATE.

source: Collation dropped
sv: Kollation togs bort

source: -- missing definition
sv: -- saknar definition

source: Collation...
sv: Kollation...

source: Copy collation
sv: Sortering av kopior

source: Locale Provider
sv: Lokal leverantör

source: Locale
sv: Plats

source: Deterministic
sv: Deterministisk

source: Rules
sv: Regler

source: System collation?
sv: Systemkollation?

source: Definition incomplete. Please provide LC_TYPE.
sv: Definitionen är ofullständig. Ange LC_TYPE.

source: Definition incomplete. Please provide LC_COLLATE.
sv: Definitionen är ofullständig. Ange LC_COLLATE.

source: Domains
sv: Domäner

source: Could not find the domain in the database. It may have been removed by another user or moved to another schema.
sv: Domänen kunde inte hittas i databasen. Den kan ha tagits bort av en annan användare eller flyttats till ett annat schema.

source: Domain dropped
sv: Domän togs bort

source: Domain Constraints
sv: Begränsningar för domäner

source: Domain Constraint dropped
sv: Domänbegränsning togs bort

source: Domain Constraint...
sv: Domänbegränsning...

source: System domain constraint?
sv: Begränsning av systemdomän?

source: Check
sv: Kontrollera

source: Validate?
sv: Validera?

source: Domain
sv: Domän

source: Domain...
sv: Domän...

source: System domain?
sv: Systemdomän?

source: Base type
sv: Typ av bas

source: Length
sv: Längd

source: Enter an expression or a value.
sv: Ange ett uttryck eller ett värde.

source: Not NULL?
sv: Inte NULL?

source: Constraints
sv: Begränsningar

source: Foreign Tables
sv: Främmande tabeller

source: Foreign Table dropped
sv: Främmande tabell togs bort

source: -- Please create column(s) first...
sv: -- Skapa kolumn(er) först...

source: Trigger(s) have been disabled
sv: Utlösare har inaktiverats

source: Trigger(s) have been enabled
sv: Utlösare har aktiverats

source: Column...
sv: Kolumnen...

source: Foreign Table
sv: Främmande bord

source: Foreign Table...
sv: Främmande bord...

source: Trigger(s)
sv: Utlösare

source: Enable All
sv: Tillåt alla

source: The selected tree node does not support this option.
sv: Den valda trädnoden stöder inte detta alternativ.

source: Disable All
sv: Inaktivera alla

source: System foreign table?
sv: System främmande tabell?

source: Foreign server
sv: Främmande server

source: Inherits
sv: Ärver

source: Foreign server cannot be empty.
sv: Den främmande servern får inte vara tom.

source: Inherited from
sv: Ärvt från

source: Scale
sv: Skala

source: Statistics
sv: Statistik

source: Storage
sv: Lagring

source: Select storage
sv: Välj lagringsutrymme

source: Expression
sv: Uttryck

source: Variables
sv: Variabler

source: No inherit?
sv: Inget arv?

source: FTS Configurations
sv: FTS-konfigurationer

source: Could not find the FTS Configuration node.
sv: Kunde inte hitta noden FTS Configuration.

source: Could not find the FTS Configuration node in the database node.
sv: Det gick inte att hitta noden FTS Configuration i databasnoden.

source: Provide at least copy config or parser.
sv: Tillhandahåll åtminstone en kopia av konfigurationen eller parsern.

source: Could not find the FTS Configuration node to update.
sv: Kunde inte hitta noden FTS Configuration att uppdatera.

source: The specified FTS configuration could not be found.
sv: Den angivna FTS-konfigurationen kunde inte hittas.

source: FTS Configuration dropped
sv: FTS-konfiguration togs bort

source: Could not generate reversed engineered query for the FTS Configuration. {0}
sv: Det gick inte att generera en omvänd teknisk fråga för FTS-konfigurationen. {0}

source: Could not generate reversed engineered query for FTS Configuration node.
sv: Det gick inte att generera en omvänd teknisk fråga för noden FTS Configuration.

source: FTS Configuration
sv: FTS-konfiguration

source: FTS Configuration...
sv: FTS-konfiguration...

source: Dictionaries
sv: Ordböcker

source: System FTS configuration?
sv: System FTS-konfiguration?

source: Copy config
sv: Kopiera konfiguration

source: Select parser or configuration to copy.
sv: Välj parser eller konfiguration som ska kopieras.

source: FTS Dictionaries
sv: FTS ordböcker

source: Could not find the FTS Dictionary node.
sv: Det gick inte att hitta noden FTS Dictionary.

source: Could not find the FTS Dictionary node in the database node.
sv: Det gick inte att hitta noden FTS Dictionary i databasnoden.

source: Could not find the FTS Dictionary node to update.
sv: Kunde inte hitta den FTS Dictionary-nod som skulle uppdateras.

source: The specified FTS dictionary could not be found.
sv: Det angivna FTS-lexikonet kunde inte hittas.

source: FTS Dictionary dropped
sv: FTS-ordbok togs bort

source: FTS Dictionary
sv: FTS ordbok

source: FTS Dictionary...
sv: FTS ordbok...

source: System FTS dictionary?
sv: System FTS ordbok?

source: Template
sv: Mall

source: Could not find the FTS Parser node.
sv: Kunde inte hitta noden FTS Parser.

source: Could not find the FTS Parser node in the database node.
sv: Kunde inte hitta noden FTS Parser i databasnoden.

source: Could not find the FTS Parser node to update.
sv: Kunde inte hitta FTS Parser-noden att uppdatera.

source: The specified FTS parser could not be found.
sv: Den angivna FTS-parsern kunde inte hittas.

source: FTS Parser dropped
sv: FTS Parser togs bort

source: Could not generate reversed engineered query for the FTS Parser. {0}
sv: Kunde inte generera en omvänd teknisk fråga för FTS Parser. {0}

source: Could not generate reversed engineered query for FTS Parser node.
sv: Det gick inte att generera en omvänd teknisk fråga för FTS Parser-noden.

source: Start function
sv: Starta funktion

source: Get next token function
sv: Hämta nästa token-funktion

source: End function
sv: Slutfunktion

source: Lextypes function
sv: Lextypes funktion

source: Headline function
sv: Rubrikens funktion

source: FTS Templates
sv: FTS mallar

source: FTS Template dropped
sv: FTS-mall togs bort

source: Could not generate reversed engineered query for the FTS Template. {0}
sv: Det gick inte att generera en omvänd teknisk fråga för FTS-mallen. {0}

source: Could not generate reversed engineered query for FTS Template node.
sv: Det gick inte att generera en omvänd teknisk fråga för FTS Template-noden.

source: FTS Template
sv: FTS-mall

source: System FTS template?
sv: System FTS-mall?

source: Init function
sv: Init-funktion

source: Lexize function
sv: Lexize-funktion

source: Functions
sv: Funktioner

source: Could not find the specified %s.
sv: Kunde inte hitta den angivna %s.

source: Could not find the function node in the database.
sv: Det gick inte att hitta funktionsnoden i databasen.

source: The specified function could not be found.
sv: Den angivna funktionen kunde inte hittas.

source: Function dropped.
sv: Funktion togs bort.

source: Could not find the function in the database.
sv: Det gick inte att hitta funktionen i databasen.

source: The specified function could not be found.
sv: Den angivna funktionen kunde inte hittas.

source: Procedures
sv: Förfaranden

source: Trigger Functions
sv: Utlösarfunktioner

source: Function...
sv: Funktion...

source: Mode
sv: Läge

source: Argument name
sv: Argumentets namn

source: System function?
sv: Systemfunktion?

source: System procedure?
sv: Systemförfarande?

source: Argument count
sv: Antal argument

source: Signature arguments
sv: Argument för signatur

source: Custom return type?
sv: Anpassad returtyp?

source: Return type
sv: Typ av retur

source: Object file
sv: Objektfil

source: Link symbol
sv: Länksymbol

source: Volatility
sv: Volatilitet

source: Returns a set?
sv: Returnerar en uppsättning?

source: Strict?
sv: Strikt?

source: Security of definer?
sv: Säkerhet för definierare?

source: Window?
sv: Fönster?

source: Parallel
sv: Parallell

source: Estimated cost
sv: Uppskattad kostnad

source: Estimated rows
sv: Beräknade rader

source: Leak proof?
sv: Läckagesäker?

source: Support function
sv: Stödfunktion

source: Parameters
sv: Parametrar

source: Return type cannot be empty.
sv: Returtypen kan inte vara tom.

source: Object File cannot be empty.
sv: Objektfilen får inte vara tom.

source: Link Symbol cannot be empty.
sv: Länksymbolen får inte vara tom.

source: Procedure...
sv: Procedur...

source: Trigger functions
sv: Utlösarfunktioner

source: Trigger function...
sv: Utlösarfunktion...

source: System trigger function?
sv: Systemets triggerfunktion?

source: trigger
sv: utlösare

source: event_trigger
sv: händelse_utlösare

source: Number of calls
sv: Antal samtal

source: Total time
sv: Total tid

source: Self time
sv: Egen tid

source: Operators
sv: Operatörer

source: Operator
sv: Operatör

source: System operator?
sv: Systemoperatör?

source: Left type
sv: Vänster typ

source: Right type
sv: Rätt typ

source: Result type
sv: Typ av resultat

source: Kind
sv: Typ

source: Operator function
sv: Operatörsfunktion

source: Restrict function
sv: Begränsa funktionen

source: Implementation
sv: Genomförande

source: Join function
sv: Gemensam funktion

source: Commutator
sv: Kommutator

source: Supports hash
sv: Stöder hash

source: Supports merge
sv: Stöder sammanslagning

source: Packages
sv: Paket

source: Package dropped
sv: Paketet togs bort

source: Package {0}
sv: Paket {0}

source: Could not find the function
sv: Kunde inte hitta funktionen

source: Visibility
sv: Synlighet

source: Could not find the variables
sv: Variablerna kunde inte hittas

source: Package
sv: Paket

source: Package...
sv: Paket...

source: This option is only available on EPAS servers.
sv: Detta alternativ är endast tillgängligt på EPAS-servrar.

source: System package?
sv: Systempaket?

source: Header
sv: Sidhuvud

source: Updating the package header definition may remove its existing body.
sv: Uppdatering av paketets rubrikdefinition kan ta bort dess befintliga kropp.

source: Do you want to continue?
sv: Vill du fortsätta?

source: Body
sv: Brödtext

source: Header cannot be empty.
sv: Huvudet får inte vara tomt.

source: Sequences
sv: Sekvenser

source: Sequence dropped
sv: Sekvens togs bort

source: Sequence
sv: Sekvens

source: Sequence...
sv: Sekvens...

source: Table
sv: Tabell

source: Column cannot be empty.
sv: Kolumnen får inte vara tom.

source: System sequence?
sv: Systemsekvens?

source: Current value
sv: Aktuellt värde

source: Sets the sequence object's current value. The next nextval will return exactly the specified value, and sequence advancement commences with the following nextval.
sv: Ställer in sequence-objektets aktuella värde. Nästa nextval kommer att returnera exakt det angivna värdet, och sekvensförloppet börjar med nästa nextval.

source: Increment
sv: Räknare

source: Maximum
sv: Maximal

source: Cycled
sv: Cyklisk

source: Unlogged?
sv: Ologgad?

source: Owned By
sv: Ägs av

source: The OWNED BY option causes the sequence to be associated with a specific table column, such that if that column (or its whole table) is dropped, the sequence will be automatically dropped as well. The specified table must have the same owner and be in the same schema as the sequence.
sv: Alternativet OWNED BY gör att sekvensen associeras med en specifik tabellkolumn, så att om den kolumnen (eller hela tabellen) tas bort, tas även sekvensen bort automatiskt. Den angivna tabellen måste ha samma ägare och finnas i samma schema som sekvensen.

source: Minimum value must be less than maximum value.
sv: Minimivärdet måste vara mindre än maximivärdet.

source: Start value cannot be less than minimum value.
sv: Startvärdet kan inte vara mindre än minimivärdet.

source: Start value cannot be greater than maximum value.
sv: Startvärdet kan inte vara större än maxvärdet.

source: Blocks read
sv: Block lästa

source: Blocks hit
sv: Block träffar

source: Catalog
sv: Katalog

source: System catalog?
sv: Systemkatalog?

source: ERD For Schema
sv: ERD för schema

source: Default TABLE privileges
sv: Standardrättigheter för TABLE

source: Default SEQUENCE privileges
sv: Standard SEQUENCE-rättigheter

source: Default FUNCTION privileges
sv: Standard FUNCTION-rättigheter

source: Default TYPE privileges
sv: Standardbehörighet TYPE

source: Default privileges
sv: Standardprivilegier

source: Owner cannot be empty.
sv: Ägaren kan inte vara tom.

source: Synonyms
sv: Synonymer

source: Synonym dropped
sv: Synonym togs bort

source: Public Synonym
sv: Synonym för offentlig

source: View
sv: Visa

source: Target schema
sv: Målschema

source: Target object
sv: Målobjekt

source: Could not find the table.
sv: Kunde inte hitta bordet.

source: Table dropped
sv: Tabell togs bort

source: Table rows counted: {}
sv: Tabellrader räknade: {}

source: Table statistics have been reset
sv: Tabellstatistiken har återställts

source: -- definition incomplete for {0}
sv: -- definition ofullständig för {0}

source: Table truncated
sv: Tabell avkortad

source: The table is currently locked and the operation cannot be completed. Please try again later. Blocking Process ID : {0} Application Name : {1}
sv: Bordet är för närvarande låst och operationen kan inte slutföras. Försök igen senare. Blockeringsprocess-ID: {0} Applikationsnamn: {1}

source: Column is dropped
sv: Kolumnen är borttagen

source: Primary key?
sv: Primär nyckel?

source: Inherited from table
sv: Ärvt från tabell

source: Geometry Type
sv: Geometri typ

source: Length/Precision
sv: Längd/Precision

source: Compression
sv: Kompression

source: Select compression
sv: Välj komprimering

source: Identity
sv: Identitet

source: Select identity
sv: Välj identitet

source: ALWAYS
sv: ALLTID

source: Foreign key?
sv: Främmande nyckel?

source: Inherited?
sv: Ärvda?

source: Inherited from table(s)
sv: Nedärvd från bord(en)

source: Length/Precision should not be less than:
sv: Längd/Precision bör inte vara mindre än:
