Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: The application has lost the database connection:
sv: Programmet har tappat databasanslutningen:

source: ⁃ If the connection was idle it may have been forcibly disconnected.
sv: ⁃ Om anslutningen var inaktiv kan den ha kopplats bort med våld.

source: ⁃ The application server or database server may have been restarted.
sv: ⁃ Applikationsservern eller databasservern kan ha startats om.

source: ⁃ The user session may have timed out.
sv: ⁃ Användarsessionen kan ha tidsavgränsats.

source: Do you want to continue and establish a new session
sv: Vill du fortsätta och skapa en ny session

source: Add New Connection
sv: Lägg till ny koppling

source: Connection with this configuration already present.
sv: Anslutning med denna konfiguration finns redan.

source: Manage Macros
sv: Hantera makron

source: Sort/Filter options
sv: Alternativ för sortering/filter

source: The session is idle and there is no current transaction.
sv: Sessionen är inaktiv och det finns ingen pågående transaktion.

source: A command is currently in progress.
sv: Ett kommando pågår för närvarande.

source: The session is idle in a valid transaction block.
sv: Sessionen är inaktiv i ett giltigt transaktionsblock.

source: The session is idle in a failed transaction block.
sv: Sessionen är inaktiv i ett misslyckat transaktionsblock.

source: The connection with the server is bad.
sv: Förbindelsen med servern är dålig.

source: Arrays must start with "{" and end with "}"
sv: Arrayer måste börja med "{" och sluta med "}"

source: Please enter a valid number
sv: Ange ett giltigt nummer

source: Invalid JSON input
sv: Ogiltig JSON-ingång

source: View all geometries in this column
sv: Visa alla geometrier i denna kolumn

source: Don't ask again
sv: Fråga inte igen

source: Rollback
sv: Återgå

source: FIRST
sv: FÖRSTA

source: Data Sorting
sv: Sortering av data

source: Key must be unique.
sv: Nyckeln måste vara unik.

source: Name must be unique.
sv: Namnet måste vara unikt.

source: By changing the connection you will lose all your unsaved data for the current connection. <br> Do you want to continue?
sv: Om du byter anslutning förlorar du alla dina osparade data för den aktuella anslutningen. <br> Vill du fortsätta?

source: (Obtaining connection)
sv: (Upprättande av anslutning)

source: New query tool for current connection
sv: Nytt frågeverktyg för aktuell anslutning

source: %s of %s geometries rendered.
sv: %s av %s geometrier återges.

source: 3D geometries not rendered.
sv: 3D-geometrier återges inte.

source: Unsupported geometries not rendered.
sv: Geometrier som inte stöds återges inte.

source: Empty row.
sv: Tom rad.

source: Geometries with non-SRID %s not rendered.
sv: Geometrier med icke-SRID %s återges inte.

source: Empty
sv: Tomt

source: Street
sv: Gata

source: Topography
sv: Topografi

source: Gray Style
sv: Grå stil

source: Light Color
sv: Ljus färg

source: Dark Matter
sv: Mörk materia

source: <Row Number>
sv: <Radrummerr>

source: Fetching all the records...
sv: Hämtar alla register...

source: Rendering data points...
sv: Rendering av datapunkter...

source: Graph Type
sv: Typ av diagram

source: Line Chart
sv: Linjediagram

source: Stacked Line Chart
sv: Staplat linjediagram

source: Bar Chart
sv: Stapeldiagram

source: Stacked Bar Chart
sv: Staplat stapeldiagram

source: Pie Chart
sv: Cirkeldiagram

source: Generate
sv: Generera

source: Collapse
sv: Minimera

source: Expand
sv: Expandera

source: X Axis
sv: X-axel

source: Y Axis
sv: Y-axel

source: Close query tool?
sv: Nära frågeverktyg?

source: There is an active query running currently. Are you sure you want to close?
sv: Det finns en aktiv fråga som körs för närvarande. Är du säker på att du vill stänga?

source: The current transaction is not committed to the database. Do you want to commit or rollback the transaction?
sv: Den aktuella transaktionen är inte överförd till databasen. Vill du bekräfta eller rulla tillbaka transaktionen?

source: Commit transaction?
sv: Genomför transaktion?

source: Open in a new tab
sv: Öppna i en ny flik

source: Edit
sv: Redigera

source: Sort/Filter
sv: Sortera/Filtrera

source: Filter options
sv: Filteralternativ

source: No limit
sv: Ingen begränsning

source: 1000 rows
sv: 1000 rader

source: 500 rows
sv: 500 rader

source: 100 rows
sv: 100 rader

source: Cancel query
sv: Avbryt fråga

source: Execute script
sv: Exekvera skriptet

source: Execute query
sv: Exekvera förfrågan

source: Execute options
sv: Utför alternativ

source: Explain
sv: Förklara

source: Explain Analyze
sv: Förklara Analysera

source: Explain Settings
sv: Förklara inställningar

source: Macros
sv: Makron

source: Open file Menu
sv: Öppna filmenyn

source: Open in a new tab?
sv: Öppna i en ny flik?

source: Save As
sv: Spara som

source: Edit Menu
sv: Redigera meny

source: Find
sv: Hitta

source: Go to Line/Column
sv: Gå till rad/kolumn

source: Indent Selection
sv: Val av indrag

source: Unindent Selection
sv: Oindenterad markering

source: Toggle Comment
sv: Toggle Kommentar

source: Toggle Case Of Selected Text
sv: Växla fall av markerad text

source: Clear Query
sv: Tydlig fråga

source: Format SQL
sv: Formatera SQL

source: Filter Options Menu
sv: Meny för filteralternativ

source: Filter by Selection
sv: Filtrera efter urval

source: Exclude by Selection
sv: Utesluta genom val

source: Remove Sort/Filter
sv: Ta bort sortering/filter

source: Execute Options Menu
sv: Meny för körningsalternativ

source: Auto rollback on error?
sv: Automatisk rollback vid fel?

source: Explain Options Menu
sv: Förklara alternativmeny

source: Verbose
sv: Utförlig

source: Costs
sv: Kostnader

source: Buffers
sv: Buffertar

source: Timing
sv: Tid

source: Settings
sv: Inställningar

source: Macros Menu
sv: Meny Makron

source: Manage macros
sv: Hantera makron

source: Add to macros
sv: Lägg till i makron

source: Recorded time
sv: Inspelad tid

source: Payload
sv: Nyttolast

source: File saved successfully.
sv: Filen sparades framgångsrikt.

source: Save query changes?
sv: Spara frågeändringar?

source: The query text has changed. Do you want to save changes?
sv: Frågetexten har ändrats. Vill du spara ändringarna?

source: Promote to Query Tool
sv: Befordra till frågeverktyg

source: Today -
sv: Idag -

source: Yesterday -
sv: Igår -

source: Select an history entry to see details.
sv: Välj en historikpost för att se detaljer.

source: Rows affected
sv: Rader som berörs

source: Copy to Query Editor
sv: Kopia till Query Editor

source: Fetching history...
sv: Fint historiematerial...

source: Failed to fetch query history.
sv: Misslyckades med att hämta frågehistorik.

source: Removing history entry...
sv: Ta bort historikpost...

source: Failed to remove query history.
sv: Misslyckades med att ta bort frågehistorik.

source: Clear history
sv: Tydlig historik

source: Are you sure you wish to clear the history?
sv: Är du säker på att du vill rensa historiken?

source: This will remove all of your query history from this and other sessions for this database.
sv: Detta kommer att ta bort all din frågehistorik från denna och andra sessioner för den här databasen.

source: Removing history...
sv: Att ta bort historia...

source: No history found
sv: Ingen historik hittades

source: Show queries generated internally by pgAdmin?
sv: Visa frågor som genereras internt av pgAdmin?

source: Remove All
sv: Ta bort alla

source: hr
sv: tim

source: secs
sv: s

source: msec
sv: msek

source: Refetching latest results...
sv: Återhämtning av senaste resultat...

source: Waiting for the query to complete...
sv: Väntar på att frågan ska slutföras...

source: Connection Error
sv: Anslutningsproblem

source: Execution Cancelled!
sv: Avrättning inställd!

source: Execution Cancelled
sv: Verkställighet avbruten

source: Server Connected.
sv: Server ansluten.

source: Query complete
sv: Förfrågan slutförd

source: Query returned successfully in %s.
sv: Frågan returnerades framgångsrikt i %s.

source: Successfully run. Total query runtime: %s.
sv: Framgångsrik körning. Total körtid för frågan: %s.

source: %s rows affected.
sv: %s rader påverkade.

source: The data has been modified, but not saved. Are you sure you wish to discard the changes?
sv: Uppgifterna har ändrats, men inte sparats. Är du säker på att du vill förkasta ändringarna?

source: Applying the new filter...
sv: Tillämpar det nya filtret...

source: Downloading results...
sv: Hämtning av resultat...

source: Downloading results(%s)...
sv: Hämtar ner resultat(%s)...

source: Setting the limit on the result...
sv: Sätter gränsen för resultatet...

source: Removing the filter...
sv: Ta bort filtret...

source: Fetching rows...
sv: Hämtar rader...

source: Save data changes?
sv: Spara dataändringar?

source: The data has changed. Do you want to save changes?
sv: Uppgifterna har ändrats. Vill du spara ändringarna?

source: Saving data...
sv: Spara data...

source: This query was generated by pgAdmin as part of a "Save Data" operation
sv: Denna fråga genererades av pgAdmin som en del av en "Spara data"-operation

source: Saving data changes was rolled back but the current transaction is still active; previous queries are unaffected.
sv: Spara dataändringar rullades tillbaka men den aktuella transaktionen är fortfarande aktiv; tidigare frågor påverkas inte.

source: Data saved successfully.
sv: Uppgifterna har sparats.

source: Auto-commit is off. You still need to commit changes to the database.
sv: Auto-commit är avstängt. Du måste fortfarande överföra ändringar till databasen.

source: Geometry Viewer
sv: Geometri-visningsprogram

source: Graph Visualiser
sv: Grafvisualiserare

source: No data output. Execute a query to get output.
sv: Ingen datautmatning. Exekvera en fråga för att få utdata.

source: Showing rows:
sv: Visar rader:

source: to
sv: till

source: Showing rows: %s to %s
sv: Visar rader: %s till %s

source: Apply (or press Enter on input)
sv: Använd (eller tryck på Enter vid inmatning)

source: Edit range
sv: Redigera intervall

source: Cancel edit
sv: Avbryt redigering

source: Page No:
sv: Sidnummer:

source: of
sv: av

source: First Page
sv: Första sidan

source: Previous Page
sv: Förgående sida

source: Next Page
sv: Nästa sida

source: Last Page
sv: Sista sidan

source: Copy options
sv: Alternativ för kopiering

source: Paste
sv: Klistra in

source: Paste options
sv: Klistra in alternativ

source: Save Data Changes
sv: Spara ändringar i data

source: Save results to file
sv: Spara resultat till fil

source: SQL query of data
sv: SQL-fråga om data

source: All rows on this page are selected.
sv: Alla rader på den här sidan är markerade.

source: All %s rows are selected.
sv: Alla %s rader väljs.

source: Clear Selection
sv: Rensa markeringen

source: Copy Options Menu
sv: Meny för kopieringsalternativ

source: Copy with headers
sv: Kopia med rubriker

source: Paste Options Menu
sv: Meny för klistra in alternativ

source: Paste with SERIAL/IDENTITY values?
sv: Klistra in med SERIAL/IDENTITY-värden?

source: Added: %s
sv: Lagt till: %s

source: Updated: %s
sv: Uppdaterad: %s

source: Deleted: %s
sv: Raderad: %s

source: Total rows: %s
sv: Totalt antal rader: %s

source: Rows selected: %s
sv: Rader valda: %s

source: Changes staged: %s
sv: Förändringar iscensatta: %s

source: EOL Options Menu
sv: Meny för EOL-alternativ

source: Ln %s, Col %s
sv: Rad %s, Kol %s

source: Data sorting object updated successfully
sv: Datasorteringsobjektet uppdaterades framgångsrikt

source: Failed to update the data on server.
sv: Misslyckades med att uppdatera data på servern.

source: Macro not found.
sv: Makro hittades inte.

source: Nothing to update.
sv: Inget att uppdatera.

source: Could not find the required parameter (name).
sv: Den nödvändiga parametern (name) kunde inte hittas.

source: Could not find the required parameter (sql).
sv: Kunde inte hitta den nödvändiga parametern (sql).

source: Upper case
sv: Versaler

source: Lower case
sv: Små bokstäver

source: Preserve
sv: Bevara

source: Verbose output?
sv: Verbose-utdata?

source: Show costs?
sv: Visa kostnader?

source: Show buffers?
sv: Visa buffertar?

source: Show summary?
sv: Visa sammanfattning?

source: Show settings?
sv: Visa inställningar?

source: Show wal?
sv: Visa mig?

source: Set auto commit on or off by default in new Query Tool tabs.
sv: Ställ in auto commit på eller av som standard i nya flikar i Query Tool.

source: Set auto rollback on or off by default in new Query Tool tabs.
sv: Ställ in automatisk rollback på eller av som standard i nya flikar i frågeverktyget.

source: Prompt to save unsaved query changes?
sv: Fråga om att spara osparade frågeändringar?

source: Specifies whether or not to prompt user to save unsaved query on query tool exit.
sv: Anger om användaren ska uppmanas att spara en osparad fråga när frågeverktyget avslutas eller inte.

source: Sort View Data results by primary key columns?
sv: Sortera Visa dataresultat efter primära nyckelkolumner?

source: If set to True, data returned when using the View/Edit Data - All Rows option will be sorted by the Primary Key columns by default. When using the First/Last 100 Rows options, data is always sorted.
sv: Om inställningen är True sorteras data som returneras när alternativet View/Edit Data - All Rows används som standard efter kolumnerna Primary Key. När du använder alternativen First/Last 100 Rows sorteras data alltid.

source: Prompt to save unsaved data changes?
sv: Fråga om att spara osparade dataändringar?

source: Specifies whether or not to prompt user to save unsaved data on data grid exit.
sv: Anger om användaren ska uppmanas att spara osparade data när datagallret avslutas.

source: Prompt to commit/rollback active transactions?
sv: Uppmaning till commit/rollback av aktiva transaktioner?

source: Specifies whether or not to prompt user to commit or rollback an active transaction on Query Tool exit.
sv: Anger om användaren ska uppmanas att genomföra eller rulla tillbaka en aktiv transaktion när Query Tool avslutas.

source: Copy SQL from main window to query tool?
sv: Kopiera SQL från huvudfönstret till frågeverktyget?

source: Specifies whether or not to copy SQL to query tool from main window.
sv: Anger om SQL ska kopieras till frågeverktyget från huvudfönstret eller inte.

source: Open the file in a new tab?
sv: Öppna filen i en ny flik?

source: Specifies whether or not to open the file in a new tab.
sv: Anger om filen ska öppnas i en ny flik eller inte.

source: Show View/Edit Data Promotion Warning?
sv: Visa varning för visning/redigering av data?

source: If set to True, View/Edit Data tool will show promote to Query tool confirm dialog on query edit.
sv: Om inställningen är True kommer verktyget View/Edit Data att visa bekräftelsedialogen för verktyget Promote to Query vid redigering av en fråga.

source: Underline query at cursor?
sv: Understryka fråga vid markören?

source: If set to True, query tool will parse and underline the query at the cursor position.
sv: Om värdet är True kommer frågeverktyget att analysera och understryka frågan vid markörens position.

source: Underlined query execute warning?
sv: Understruken fråga exekvera varning?

source: If set to True, query tool will warn upon clicking the Execute Query button in the query tool. The warning will appear only if Underline query at cursor? is set to False.
sv: Om inställningen är True kommer frågeverktyget att varna när du klickar på knappen Execute Query i frågeverktyget. Varningen visas endast om Underline query at cursor? är inställt på False.

source: Plain text mode?
sv: Vanlig text-läge?

source: When set to True, keywords won't be highlighted and code folding will be disabled. Plain text mode will improve editor performance with large files.
sv: När inställningen är True markeras inte nyckelord och kodvikning inaktiveras. Läget för vanlig text förbättrar redigerarens prestanda med stora filer.

source: Code folding?
sv: Fällning av kod?

source: Enable or disable code folding. In plain text mode, this will have no effect as code folding is always disabled in that mode. Disabling will improve editor performance with large files.
sv: Aktivera eller inaktivera kodvikning. I klartextläget har detta ingen effekt eftersom kodvikning alltid är inaktiverat i det läget. Om du avaktiverar funktionen förbättras redigerarens prestanda med stora filer.

source: Specifies whether or not to wrap SQL code in the editor.
sv: Anger om SQL-koden ska brytas om i editorn eller inte.

source: Insert bracket pairs?
sv: Infoga konsolpar?

source: Specifies whether or not to insert paired brackets in the editor.
sv: Anger om parenteser ska infogas i editorn eller inte.

source: Highlight selection matches?
sv: Markera urvalsmatcher?

source: Specifies whether or not to highlight matched selected text in the editor.
sv: Anger om matchad markerad text ska markeras i redigeraren eller inte.

source: Brace matching?
sv: Matchande armband?

source: Specifies whether or not to highlight matched braces in the editor.
sv: Anger om matchade hakparenteser ska markeras i editorn eller inte.

source: None
sv: Ingen

source: All
sv: Alla

source: Strings
sv: Strängar

source: CSV quote character
sv: CSV citationstecken

source: CSV field separator
sv: CSV fältavskiljare

source: Tab
sv: Flik

source: Replace null values with
sv: Ersätt nollvärden med

source: Specifies the string that represents a null value while downloading query results as CSV. You can specify any arbitrary string to represent a null value, with quotes if desired.
sv: Anger den sträng som representerar ett null-värde när du hämtar ner frågeresultat som CSV. Du kan ange en godtycklig sträng som representerar ett nollvärde, med citattecken om så önskas.

source: Result copy quoting
sv: Resultat kopia citering

source: Result copy quote character
sv: Resultat kopiera citat tecken

source: Result copy field separator
sv: Separator för fält för resultatkopia

source: Columns sized by
sv: Kolumner i storlek

source: Column data
sv: Kolumndata

source: Column name
sv: Kolumnnamn

source: If set to 'Column data' columns will auto-size to the maximum width of the data in the column as loaded in the first batch. If set to 'Column name', the column will be sized to the widest of the data type or column name.
sv: Om inställningen är "Kolumndata" kommer kolumnerna automatiskt att dimensioneras till den maximala bredden för data i kolumnen som lästs in i den första batchen. Om den är inställd på "Kolumnnamn" kommer kolumnen att dimensioneras till den bredaste datatypen eller kolumnnamnet.

source: Maximum column width
sv: Maximal kolumnbredd

source: Specify the maximum width of the column in pixels when 'Columns sized by ' is set to 'Column data'.
sv: Ange kolumnens maximala bredd i pixlar när 'Columns sized by' är inställt på 'Column data'.

source: Data result rows per page
sv: Dataresultat rader per sida

source: Specify the number of records to fetch in one batch. Changing this value will override DATA_RESULT_ROWS_PER_PAGE setting from config file.
sv: Ange antalet poster som ska hämtas i en batch. Om du ändrar detta värde åsidosätts inställningen DATA_RESULT_ROWS_PER_PAGE i konfigurationsfilen.

source: Striped rows?
sv: Randiga rader?

source: If set to true, the result grid will display rows with alternating background colors.
sv: Om värdet true anges visas rader med alternerande bakgrundsfärger i resultatrutnätet.

source: Max column data display length
sv: Max längd för visning av kolumndata

source: Font size
sv: Teckenstorlek

source: The font size to use for the SQL text boxes and editors. The value specified is in "em" units, in which 1 is the default relative font size. For example, to increase the font size by 20 percent use a value of 1.2, or to reduce by 20 percent, use a value of 0.8. Minimum 0.1, maximum 10.
sv: Den teckenstorlek som ska användas för SQL-textrutorna och redigerarna. Det angivna värdet är i "em"-enheter, där 1 är den relativa standardstorleken för teckensnitt. Om du t.ex. vill öka teckenstorleken med 20 procent använder du värdet 1,2 och om du vill minska den med 20 procent använder du värdet 0,8. Minimum 0,1, maximum 10.

source: Font ligatures?
sv: Font ligaturer?

source: If set to true, ligatures will be enabled in SQL text boxes and editors provided the configured font family supports them.
sv: Om värdet är true aktiveras ligaturer i SQL-textrutor och redigerare om den konfigurerade teckensnittsfamiljen har stöd för dem.

source: Font family
sv: Typsnittsfamilj

source: Specify the font family to be used for all SQL editors. The specified font should already be installed on your system. If the font is not found, the editor will fall back to the default font, Source Code Pro.
sv: Ange den teckensnittsfamilj som ska användas för alla SQL-editorer. Det angivna teckensnittet bör redan vara installerat på ditt system. Om teckensnittet inte hittas kommer redigeraren att återgå till standardteckensnittet Source Code Pro.

source: Connection status
sv: Status för anslutning

source: If set to True, the Query Tool will monitor and display the connection and transaction status.
sv: Om inställningen är True övervakar och visar Query Tool anslutnings- och transaktionsstatus.

source: Connection status refresh rate
sv: Uppdateringsfrekvens för anslutningsstatus

source: The number of seconds between connection/transaction status polls.
sv: Antal sekunder mellan pollningar av anslutnings-/transaktionsstatus.

source: Show query success notification?
sv: Visa meddelande om framgångsrik fråga?

source: If set to True, the Query Tool will show notifications on successful query execution.
sv: Om inställningen är True kommer frågeverktyget att visa meddelanden när en fråga har körts framgångsrikt.

source: Save data changes
sv: Spara ändringar i data

source: EXPLAIN query
sv: EXPLAIN-fråga

source: EXPLAIN ANALYZE query
sv: EXPLAIN ANALYZE-fråga

source: Clear query
sv: Tydlig fråga

source: Open file
sv: Öppna fil

source: Save file
sv: Spara fil

source: Paste rows
sv: Klistra in rader

source: Delete rows
sv: Ta bort rader

source: Filter dialog
sv: Dialogrutan Filter

source: Edit options
sv: Redigera alternativ

source: Toggle case of selected text
sv: Växla fall för markerad text

source: Keywords in uppercase
sv: Nyckelord i versaler

source: Auto completion
sv: Automatisk komplettering

source: If set to True, Keywords will be displayed in upper case for auto completion.
sv: Om värdet är True visas nyckelorden med versaler för automatisk komplettering.

source: Autocomplete on key press
sv: Autokomplettering vid tangenttryckning

source: If set to True, autocomplete will be available on key press along with CTRL/CMD + Space. If set to False, autocomplete is only activated when CTRL/CMD + Space is pressed.
sv: Om den är inställd på True kommer autokomplettering att vara tillgänglig vid tangenttryckning tillsammans med CTRL/CMD + mellanslag. Om inställningen är False aktiveras autokomplettering endast när du trycker på CTRL/CMD + mellanslag.

source: Keyword case
sv: Sökord skiftläge

source: Convert keywords to upper, lower, or preserve casing.
sv: Konvertera nyckelord till stor bokstav, liten bokstav eller bibehållen bokstav.

source: Identifier case
sv: Identifieringsfall

source: Convert identifiers to upper, lower, or preserve casing.
sv: Konvertera identifierare till stor bokstav, liten bokstav eller bibehållen bokstav.

source: Function case
sv: Funktionshölje

source: Convert function names to upper, lower, or preserve casing.
sv: Konvertera funktionsnamn till stor bokstav, liten bokstav eller bibehållen bokstav.

source: Data type case
sv: Fall med datatyp

source: Convert data types to upper, lower, or preserve casing.
sv: Konvertera datatyper till övre, undre eller bevarad versal.

source: Spaces around operators?
sv: Utrymmen runt operatörer?
