Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Role membership information must be passed as a string representing an array of JSON objects in the following format: rolmembers:{ 'added': [{ role: [rolename], admin: True/False }, ... ], 'deleted': [{ role: [rolename], admin: True/False }, ... ], 'updated': [{ role: [rolename], admin: True/False }, ... ]
sv: Information om rollmedlemskap måste skickas som en sträng som representerar en array av JSON-objekt i följande format: rolmembers:{ 'added': [{ roll: [rolename], admin: Sant/Falskt }, ... ], 'borttagen': [{ roll: [rolename], admin: Sant/Falskt }, ... ], 'uppdaterad': [{ roll: [rolename], admin: Sant/Falskt }, ... ]

source: Role membership information must be passed as an array of JSON objects in the following format: rolmembership:[{ role: [rolename], admin: True/False }, ... ]
sv: Information om rollmedlemskap måste skickas som en array av JSON-objekt i följande följande format: rolmembership:[{ roll: [rolename], admin: Sant/Falskt }, ... ]

source: Role membership information must be passed as a string representing an array of JSON objects in the following format: rolmembership:{ 'added': [{ role: [rolename], admin: True/False }, ... ], 'deleted': [{ role: [rolename], admin: True/False }, ... ], 'updated': [{ role: [rolename], admin: True/False }, ... ]
sv: Information om rollmedlemskap måste skickas som en sträng som representerar en array av JSON-objekt i följande format: rolmembership:{ 'added': [{ roll: [rolename], admin: Sant/Falskt }, ... ], 'borttagen': [{ roll: [rolename], admin: Sant/Falskt }, ... ], 'uppdaterad': [{ roll: [rolename], admin: Sant/Falskt }, ... ]

source: Security Label must be passed as an array of JSON objects in the following format: seclabels:[{ provider: <provider>, label: <label> }, ... ]
sv: Security Label måste skickas som en array av JSON-objekt i följande format: säkerhetsmärkningar:[{ leverantör: <provider>, etikett: <label> }, ... ]

source: Security Label must be passed as an array of JSON objects in the following format: seclabels:{ 'added': [{ provider: <provider>, label: <label> }, ... ], 'deleted': [{ provider: <provider>, label: <label> }, ... ], 'updated': [{ provider: <provider>, label: <label> }, ... ]
sv: Security Label måste skickas som en array av JSON-objekt i följande format: säkerhetsmärkningar:{ 'added': [{ leverantör: <provider>, etikett: <label> }, ... ], "borttagen": [{ leverantör: <provider>, etikett: <label> }, ... ], "uppdaterad": [{ leverantör: <provider>, etikett: <label> }, ... ]

source: Configuration parameters/variables must be passed as an array of JSON objects in the following format in create mode: variables:[{ database: <database> or null, name: <configuration>, value: <value> }, ... ]
sv: Konfigurationsparametrar/variabler måste skickas som en array av JSON-objekt i följande format i create-läget: variabler:[{ databas: <database> eller null, namn: <configuration>, värde: <value> }, ... ]

source: Configuration parameters/variables must be passed as an array of JSON objects in the following format in update mode: rolmembership:{ 'added': [{ database: <database> or null, name: <configuration>, value: <value> }, ... ], 'deleted': [{ database: <database> or null, name: <configuration>, value: <value> }, ... ], 'updated': [{ database: <database> or null, name: <configuration>, value: <value> }, ... ]
sv: Konfigurationsparametrar/variabler måste skickas som en array av JSON-objekt i följande format i uppdateringsläge: rolmembership:{ 'added': [{ databas: <database> eller null, namn: <configuration>, värde: <value> }, ... ], 'deleted': [{ { databas: <database> eller null, namn: <configuration>, värde: <value> }, ... ], "uppdaterad": [{ databas: <database> eller null, namn: <configuration>, värde: <value> }, ... ]

source: Name must be specified.
sv: Namnet måste anges.

source: The current user does not have permission to drop the role.
sv: Den aktuella användaren har inte behörighet att släppa rollen.

source: The current user does not have permission to update the role.
sv: Den aktuella användaren har inte behörighet att uppdatera rollen.

source: The current user does not have permission to create the role.
sv: Den aktuella användaren har inte behörighet att skapa rollen.

source: Error retrieving the role information. {0}
sv: Fel vid hämtning av rollinformation. {0}

source: Could not find the role on the database server.
sv: Det gick inte att hitta rollen på databasservern.

source: Could not drop the role. {0}
sv: Det gick inte att släppa rollen. {0}

source: Could not generate reversed engineered query for the role. {0}
sv: Det gick inte att generera en omvänd teknisk fråga för rollen. {0}

source: Could not generate reversed engineered query for the role.
sv: Det gick inte att generera en omvänd teknisk fråga för rollen.

source: Could not create the role. {0}
sv: Det gick inte att skapa rollen. {0}

source: Error retrieving variable information for the role. {0}
sv: Fel vid hämtning av variabelinformation för rollen. {0}

source: Error retrieving the variable options for the role. {0}
sv: Fel vid hämtning av variabelalternativen för rollen. {0}

source: Reassign owned executed successfully!
sv: Omfördelning av ägd exekverad framgångsrikt!

source: Drop owned executed successfully!
sv: Drop owned genomfördes framgångsrikt!

source: Login/Group Role
sv: Inloggning/Grupproll

source: Login Role
sv: Inloggningsroll

source: Group Role
sv: Gruppens roll

source: Login/Group Role...
sv: Inloggning/Grupp Roll...

source: Reassign/Drop Owned...
sv: Omfördela/avlämna ägda...

source: System role?
sv: Systemets roll?

source: Account expires
sv: Kontot upphör att gälla

source: Please note that if you leave this field blank, then password will never expire.
sv: Observera att om du lämnar detta fält tomt kommer lösenordet aldrig att upphöra att gälla.

source: No Expiry
sv: Inget utgångsdatum

source: Can login?
sv: Kan du logga in?

source: Create roles?
sv: Skapa roller?

source: Create databases?
sv: Skapa databaser?

source: Inherit rights from the parent roles?
sv: Ärva rättigheter från föräldrarollerna?

source: Can initiate streaming replication and backups?
sv: Kan du initiera strömmande replikering och säkerhetskopiering?

source: Member of
sv: Medlem i

source: Membership
sv: Medlemskap

source: Select the checkbox for roles to include WITH ADMIN OPTION.
sv: Markera kryssrutan för de roller som ska inkluderas WITH ADMIN OPTION.

source: Roles shown with a check mark have the WITH ADMIN OPTION set.
sv: Roller som är markerade med en bock har inställningen WITH ADMIN OPTION.

source: General
sv: Allmänt

source: Reassign
sv: Tilldela åter

source: Drop
sv: Släpp

source: Change the ownership or drop the database objects owned by a database role
sv: Ändra ägarskap eller ta bort de databasobjekt som ägs av en databasroll

source: Reassign objects to
sv: Omfördela objekt till

source: New owner of the affected objects
sv: Ny ägare till de berörda objekten

source: Note: CASCADE will automatically drop objects that depend on the affected objects, and in turn all objects that depend on those objects
sv: Observera: CASCADE kommer automatiskt att ta bort objekt som är beroende av de berörda objekten, och i sin tur alla objekt som är beroende av dessa objekt

source: From database
sv: Från databas

source: Target database on which the operation will be carried out
sv: Måldatabas på vilken operationen kommer att utföras

source: 'Reassign objects to' can not be empty
sv: "Omfördela objekt till" får inte vara tomt

source: 'From database ' can not be empty
sv: 'From database' kan inte vara tomt

source: Are you sure you wish to ${state.role_op} all the objects owned by the selected role?
sv: Är du säker på att du vill ${state.role_op} alla objekt som ägs av den valda rollen?

source: Reassign/Drop Owned - ${data.label}
sv: Omfördela/avvisa ägda - ${data.label}

source: Reassign/Drop
sv: Omfördelning/avhopp

source: User/Role
sv: Användare/Roll

source: Option
sv: Alternativ

source: Grantee
sv: Bidragsmottagare

source: Grantor
sv: Givare

source: At least one privilege should be selected.
sv: Minst ett privilegium bör väljas.

source: Provider
sv: Leverantör

source: Security label
sv: Säkerhetsmärkning

source: Copy Server - %s
sv: Kopieringsserver - %s

source: Copy of %s
sv: Kopia av %s

source: Disconnect from all servers
sv: Koppla bort från alla servrar

source: Connect Server
sv: Anslut server

source: Database server is already connected.
sv: Databasservern är redan ansluten.

source: Disconnect from server
sv: Koppla bort från servern

source: Database server is already disconnected.
sv: Databasservern är redan bortkopplad.

source: Reload Configuration
sv: Läs om konfigurationen

source: Please select a server from the object explorer to reload the configuration files.
sv: Välj en server från objektutforskaren för att läsa om konfigurationsfilerna.

source: Add Named Restore Point...
sv: Lägg till namngiven återställningspunkt...

source: Please select any server from the object explorer to Add Named Restore Point.
sv: Välj en server från objektutforskaren för att lägga till Named Restore Point.

source: Change Password...
sv: Ändra lösenord...

source: Please connect server to enable change password.
sv: Anslut servern för att kunna ändra lösenordet.

source: Pause Replay of WAL
sv: Pausa uppspelning av WAL

source: Please select a connected database as a Super user and run in Recovery mode to Pause Replay of WAL.
sv: Välj en ansluten databas som superanvändare och kör i återställningsläge för att pausa uppspelningen av WAL.

source: Resume Replay of WAL
sv: Återuppta uppspelning av WAL

source: Please select a connected database as a Super user and run in Recovery mode to Resume Replay of WAL.
sv: Välj en ansluten databas som superanvändare och kör i återställningsläge för att återuppta uppspelningen av WAL.

source: Clear Saved Password
sv: Rensa sparat lösenord

source: Clear SSH Tunnel Password
sv: Rensa lösenord för SSH-tunnel

source: SSH Tunnel password is not saved for selected server.
sv: Lösenordet för SSH-tunneln sparas inte för vald server.

source: Copy Server...
sv: Kopiera server...

source: Are you sure you want to disconnect from all servers?
sv: Är du säker på att du vill koppla bort från alla servrar?

source: Reload server configuration
sv: Läs om serverkonfigurationen

source: Are you sure you want to reload the server configuration on %s?
sv: Är du säker på att du vill läsa om serverkonfigurationen på %s?

source: Restore point name
sv: Namn på återställningspunkt

source: Change Password
sv: Ändra lösenord

source: Clear saved password
sv: Rensa sparat lösenord

source: Are you sure you want to clear the saved password for server %s?
sv: Är du säker på att du vill rensa det sparade lösenordet för server %s?

source: Clear SSH Tunnel password
sv: Rensa lösenord för SSH-tunnel

source: Are you sure you want to clear the saved password of SSH Tunnel for server %s?
sv: Är du säker på att du vill rensa det sparade lösenordet för SSH Tunnel för server %s?

source: You have connected to a server version that is older than is supported by pgAdmin. This may cause pgAdmin to break in strange and unpredictable ways. Or a plague of frogs. Either way, you have been warned!
sv: Du har anslutit till en serverversion som är äldre än den som stöds av pgAdmin. Detta kan leda till att pgAdmin bryts på konstiga och oförutsägbara sätt. Eller en plåga av grodor. Hur som helst, du har blivit varnad!

source: Server connected
sv: Server ansluten

source: Connect to server.
sv: Anslut till server.

source: Connect to Server
sv: Anslut till server

source: Are you sure you want to disconnect from the server <b>%s</b>?
sv: Är du säker på att du vill koppla bort från servern <b>%s</b>?

source: Color
sv: Färg

source: Host address
sv: Värdadress

source: Password file
sv: Lösenordsfil

source: Channel binding
sv: Kanalbindning

source: prefer
sv: föredra

source: require
sv: kräv

source: disable
sv: inaktivera

source: Connection timeout (seconds)
sv: Timeout för anslutning (sekunder)

source: Client encoding
sv: Kodning av klient

source: Application name
sv: Applikationsnamn

source: Fallback application name
sv: Namn på reservapplikation

source: Keepalives idle (seconds)
sv: Keepalives i viloläge (sekunder)

source: Keepalives interval (seconds)
sv: Keepalives intervall (sekunder)

source: Keepalives count
sv: Antal Keepalives

source: TCP user timeout (milliseconds)
sv: Tidsgräns för TCP-användare (millisekunder)

source: Replication
sv: Replikering

source: on
sv: på

source: off
sv: av

source: database
sv: databas

source: GSS encmode
sv: GSS omkodning

source: allow
sv: tillåta

source: verify-ca
sv: verifiera-ca

source: verify-full
sv: verifiera-fullständig

source: SSL password
sv: SSL-lösenord

source: Certificate revocation list directory
sv: Katalog över spärrlistor för certifikat

source: Server name indication
sv: Indikation av servernamn

source: Require peer
sv: Kräver peer

source: SSL min protocol version
sv: SSL min protokollversion

source: SSL max protocol version
sv: SSL max protokollversion

source: Kerberos service name
sv: Namn på Kerberos-tjänst

source: GSS library
sv: GSS bibliotek

source: Target session attribute
sv: Attribut för målsession

source: read-write
sv: skriv-läsning

source: read-only
sv: skrivskyddad

source: primary
sv: primär

source: prefer-standby
sv: föredrar-standby

source: Load balance hosts
sv: Lastbalansera värdar

source: random
sv: slumpvis

source: Server group
sv: Servergrupp

source: Shared Server Owner
sv: Ägare av delad server

source: Server type
sv: Typ av server

source: Connected?
sv: Ansluten?

source: Background
sv: Bakgrund

source: Foreground
sv: Förgrund

source: Connect now?
sv: Ansluta nu?

source: Shared?
sv: Delade?

source: Shared Username
sv: Delat användarnamn

source: Connection String
sv: Anslutningssträng

source: Kerberos authentication?
sv: Kerberos-autentisering?

source: GSS authenticated?
sv: GSS autentiserad?

source: GSS encrypted?
sv: GSS krypterad?

source: Save password?
sv: Spara lösenord?

source: Service
sv: Tjänst

source: Connection Parameters
sv: Parametrar för anslutning

source: Use SSH tunneling
sv: Använd SSH-tunnel

source: Tunnel host
sv: Tunnelvärd

source: Authentication
sv: Autentisering

source: Identity file
sv: Identitetsfil

source: Keep alive (seconds)
sv: Hålla sig vid liv (sekunder)

source: DB restriction type
sv: Typ av DB-begränsning

source: DB restriction
sv: DB-begränsning

source: Password exec command
sv: Lösenord exec-kommando

source: The server hostname, port, and username can be passed as variables by using the placeholders %HOST%, %PORT%, and %USERNAME%, which will be replaced with the corresponding server connection information.
sv: Serverns värdnamn, port och användarnamn kan skickas som variabler genom att använda platshållarna %HOST%, %PORT% och %USERNAME%, som ersätts med motsvarande serveranslutningsinformation.

source: Password exec expiration (seconds)
sv: Lösenordets utgångsdatum (sekunder)

source: Prepare threshold
sv: Förbered tröskelvärde

source: If it is set to 0, every query is prepared the first time it is executed. If it is set to blank, prepared statements are disabled on the connection.
sv: Om den är inställd på 0 förbereds varje fråga första gången den körs. Om värdet är tomt inaktiveras förberedda satser i anslutningen.

source: Post Connection SQL
sv: SQL efter anslutning

source: Any query specified in the control below will be executed with autocommit mode enabled for each connection to any database on this server.
sv: Alla frågor som anges i kontrollen nedan kommer att köras med autokommit-läge aktiverat för varje anslutning till en databas på den här servern.

source: Tags
sv: Taggar

source: Server group must be specified.
sv: Servergrupp måste anges.

source: Either Host name or Service must be specified.
sv: Antingen Host name eller Service måste anges.

source: Host name must be valid hostname or IPv4 or IPv6 address.
sv: Värdnamnet måste vara ett giltigt värdnamn eller en IPv4- eller IPv6-adress.

source: SSH Tunnel host must be specified.
sv: SSH Tunnel host måste anges.

source: SSH Tunnel port must be specified.
sv: SSH Tunnel-port måste anges.

source: SSH Tunnel username must be specified.
sv: SSH-tunnelns användarnamn måste anges.

source: SSH Tunnel identity file must be specified.
sv: SSH Tunnel identity file måste anges.

source: Keep alive must be specified. Specify 0 for no keep alive.
sv: Keep alive måste anges. Ange 0 för ingen keep alive.

source: Custom auto-vacuum?
sv: Anpassad auto-vacuum?

source: Autovacuum Enabled?
sv: Autovacuum aktiverat?

source: Not set
sv: Inte satt

source: Yes
sv: Ja

source: TOAST table
sv: TOAST-bord

source: Keyword
sv: Nyckelord

source: Please select a parameter name.
sv: Välj ett parameternamn.

source: Please enter a value for the parameter.
sv: Ange ett värde för parametern.

source: Tablespaces
sv: Tabellutrymmen

source: Could not find the tablespace.
sv: Kunde inte hitta tablespace.

source: Could not find the tablespace information.
sv: Kunde inte hitta informationen om tablespace.

source: Tablespace created successfully, Set parameter fail: {0}
sv: Tabellutrymme skapades, Set parameter fail: {0}

source: The specified tablespace could not be found.
sv: Det angivna tablespacet kunde inte hittas.

source: Tablespace dropped
sv: Tabellutrymmet togs bort

source: Could not find the tablespace on the server.
sv: Det gick inte att hitta tablespace på servern.

source: Tablespace...
sv: Tabellutrymme...

source: System tablespace?
sv: Systemets tablespace?

source: Backend start
sv: Start av backend

source: Client
sv: Kund

source: Application
sv: Ansökan

source: Wait event type
sv: Typ av väntande händelse

source: Wait event name
sv: Namn på väntande händelse

source: Query
sv: Fråga

source: Query start
sv: Start av förfrågan

source: Streaming Replication
sv: Replikering av streaming

source: Server Group
sv: Servergrupp

source: Server Group...
sv: Servergruppen...

source: File
sv: Arkiv

source: Object
sv: Objekt

source: Tools
sv: Verktyg

source: Help
sv: Hjälp

source: Error in opening window
sv: Fel vid öppning av fönster

source: No object selected
sv: Inget objekt valt

source: No menu available for this object.
sv: Ingen meny finns tillgänglig för detta objekt.

source: Please select an object in the tree view.
sv: Välj ett objekt i trädvyn.

source: Register
sv: Registrera

source: Are you sure you want to close the %s browser?
sv: Är du säker på att du vill stänga webbläsaren %s?

source: Error retrieving details for the node.
sv: Fel vid hämtning av detaljer för noden.

source: Refresh
sv: Uppdatera

source: Search Objects...
sv: Sök objekt...

source: Sunday
sv: Söndag

source: Monday
sv: Måndag

source: Tuesday
sv: Tisdag

source: Wednesday
sv: Onsdag

source: Thursday
sv: Torsdag

source: Friday
sv: Fredag

source: Saturday
sv: Lördag

source: 4th
sv: 4:e

source: 5th
sv: 5:e

source: 6th
sv: 6:e

source: 7th
sv: 7:e

source: 8th
sv: åttonde

source: 10th
sv: 10:e

source: 11th
sv: 11:e

source: 12th
sv: 12:e

source: 13th
sv: 13:e

source: 14th
sv: 14:e

source: 15th
sv: 15:e

source: January
sv: Januari

source: February
sv: Februari

source: March
sv: Mars

source: May
sv: Maj

source: June
sv: Juni

source: July
sv: Juli

source: August
sv: Augusti

source: October
sv: Oktober

source: Last day
sv: Sista dagen

source: pgAdmin server not responding, try to login again: ${error.message || error.response.data.errormsg}
sv: pgAdmin-servern svarar inte, försök att logga in igen: ${error.message || error.response.data.errormsg}

source: Server heartbeat logging error: ${error.message || error.response.data.errormsg}
sv: Loggningsfel för serverhjärtslag: ${error.message || error.response.data.errormsg}

source: Create - %s
sv: Skapa - %s

source: Refresh...
sv: Uppdatera...

source: Properties...
sv: Egenskaper...

source: Remove %s
sv: Ta bort %s

source: %s Script
sv: %s-skript

source: Scripts
sv: Script

source: Are you sure want to stop editing the properties of %s "%s"?
sv: Är du säker på att du vill sluta redigera egenskaperna för %s "%s"?

source: Are you sure want to reset the current changes and re-open the panel for %s "%s"?
sv: Är du säker på att du vill återställa de aktuella ändringarna och öppna panelen igen för %s "%s"?

source: Edit in progress?
sv: Pågående redigering?

source: The %s "%s" cannot be dropped.
sv: Det går inte att ta bort %s "%s".

source: Are you sure you want to remove the %s <b>"%s"</b>?
sv: Är du säker att du vill ta bort %s <b>"%s"</b>?

source: Remove %s?
sv: Ta bort %s?

source: The %s "%s" cannot be dropped/removed.
sv: %s "%s" kan inte tas bort.

source: Error dropping/removing %s: "%s"
sv: Fel vid borttagning av %s: "%s"

source: Remove
sv: Ta bort

source: Permission Denied
sv: Åtkomst nekad

source: You don’t have the necessary permissions to access this feature. Please contact your administrator for assistance
sv: Du har inte de nödvändiga behörigheterna för att komma åt den här funktionen. Kontakta din administratör för hjälp

source: Your browser was detected as <strong>{0}</strong> version <strong>{1}</strong>, which is either deprecated or not supported by pgAdmin 4.
sv: Din webbläsare upptäcktes som <strong>{0}</strong> version <strong>{1}</strong>som antingen är föråldrad eller inte stöds av pgAdmin 4.

source: Your browser was detected as <strong>{0}</strong> version <strong>{1}</strong>, which pgAdmin has not been tested with. pgAdmin may not work as expected, and any issues reported when using this browser may not be fixed.
sv: Din webbläsare upptäcktes som <strong>{0}</strong> version <strong>{1}</strong>som pgAdmin inte har testats med. pgAdmin kanske inte fungera som förväntat, och eventuella problem som rapporteras när du använder den här webbläsaren kanske inte vara åtgärdade.

source: Please visit the <a class="alert-link" href="https://www.pgadmin.org/faq/#11" target="_new">FAQ</a> to see the supported browsers.
sv: Besök <a class="alert-link" href="https://www.pgadmin.org/faq/#11" target="_new">FAQ</a> för att se vilka webbläsare som webbläsare som stöds.

source: Loading {0} v{1}...
sv: Läser in {0} v{1}...

source: Login Failed.
sv: Inloggning misslyckades.

source: Logged out successfully.
sv: Loggade ut framgångsrikt.

source: Close
sv: Stäng

source: You are currently running version {0} of {1}, however the current version is {2}.
sv: Du kör för närvarande version {0} av {1}, men den aktuella versionen är {2}.

source: Please click <a class="alert-link" href="{0}" target="_new">here</a> for more information.
sv: Klicka <a class="alert-link" href="{0}" target="_new">här</a> för mer information.

source: Click here for details.
sv: Klicka här för mer information.

source: Definition incomplete
sv: Definition ofullständig

source: Nothing changed
sv: Ingenting förändrades

source: '%s' must be an integer.
sv: '%s' måste vara ett heltal.

source: '%s' must be a numeric.
sv: '%s' måste vara en siffra.

source: Min and Max values are not valid
sv: Min- och Max-värdena är inte giltiga

source: '%s' must be greater than or equal to %s.
sv: '%s' måste vara större än eller lika med %s.

source: '%s' must be less than or equal to %s.
sv: '%s' måste vara mindre än eller lika med %s.

source: '%s' cannot be empty.
sv: '%s' kan inte vara tomt.

source: No SQL could be generated for the selected object.
sv: Ingen SQL kunde genereras för det valda objektet.

source: No statistics are available for the selected object.
sv: Ingen statistik finns tillgänglig för det valda objektet.

source: True
sv: Sant

source: False
sv: Falskt

source: Error retrieving the information - %s
sv: Fel vid hämtning av information - %s

source: Select All
sv: Välj alla
