Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Passed by value?
sv: Godkänd av värde?

source: Collatable?
sv: Kollapsbar?

source: Input function cannot be empty
sv: Inmatningsfunktionen kan inte vara tom

source: Output function cannot be empty
sv: Utgångsfunktionen kan inte vara tom

source: Member Name
sv: Medlems Namn

source: Please specify the value for member name.
sv: Ange värdet för medlemsnamnet.

source: Please specify the type.
sv: Ange typ.

source: Data Type
sv: Datatyp

source: Composite
sv: Komposit

source: Enumeration
sv: Uppräkning

source: External
sv: Extern

source: Shell
sv: Skal

source: Nested Table
sv: Nästat bord

source: Varying Array
sv: Varierande matris

source: Composite Type
sv: Komposittyp

source: Enumeration type
sv: Typ av uppräkning

source: External Type
sv: Extern typ

source: Members
sv: Medlemmar

source: Labels
sv: Etiketter

source: SubType
sv: Undertyp

source: System type?
sv: Systemtyp?

source: Views
sv: Visningar

source: Refresh Materialized View ({0})
sv: Uppdatera materialiserad vy ({0})

source: Refresh Materialized View
sv: Uppdatera materialiserad vy

source: Not available
sv: Ej tillgängligt

source: Refresh MView
sv: Uppdatera MView

source: Materialized Views
sv: Materialiserade vyer

source: View dropped
sv: Visning togs bort

source: -- Changing the columns in a view requires dropping and re-creating the view. -- This may fail if other objects are dependent upon this view, -- or may cause procedural functions to fail if they are not modified to -- take account of the changes.
sv: -- Om du vill ändra kolumnerna i en vy måste du ta bort vyn och skapa den på nytt. -- Detta kan misslyckas om andra objekt är beroende av denna vy, -- eller orsaka att procedurfunktioner misslyckas om de inte modifieras för att ta hänsyn till -- för att ta hänsyn till ändringarna.

source: Could not find the given server
sv: Kunde inte hitta den angivna servern

source: Please connect to the server first.
sv: Anslut först till servern.

source: Materialized view refresh job created.
sv: Skapat jobb för uppdatering av materialiserad vy.

source: Materialized View
sv: Materialiserad vy

source: Refresh View
sv: Uppdatera vy

source: Materialized View...
sv: Materialiserad vy...

source: With data
sv: Med data

source: With no data
sv: Utan data

source: With data (concurrently)
sv: Med data (samtidigt)

source: Please select server or child node from tree.
sv: Välj server eller underordnad nod från trädet.

source: Utility not found
sv: Verktyget hittades inte

source: Failed to create materialized view refresh job.
sv: Misslyckades med att skapa uppdateringsjobb för materialiserad vy.

source: Failed to fetch Utility information
sv: Misslyckades med att hämta Utility-information

source: System materialized view?
sv: System materialiserad vy?

source: With data?
sv: Med data?

source: Please enter view code.
sv: Ange visningskod.

source: Updating the definition will drop and re-create the materialized view. It may result in loss of information about its dependent objects.
sv: Om du uppdaterar definitionen kommer den materialiserade vyn att tas bort och skapas på nytt. Det kan leda till förlust av information om dess beroende objekt.

source: View...
sv: Visa...

source: System view?
sv: Systemvy?

source: Security barrier?
sv: Säkerhetsbarriär?

source: Security invoker?
sv: Säkerhetsinvokatör?

source: Check options
sv: Kontrollera alternativ

source: No
sv: Nej

source: Cascaded
sv: Kaskad

source: Changing the columns in a view requires dropping and re-creating the view. This may fail if other objects are dependent upon this view, or may cause procedural functions to fail if they are not modified to take account of the changes.
sv: Om du vill ändra kolumnerna i en vy måste du ta bort vyn och skapa den på nytt. Detta kan misslyckas om andra objekt är beroende av denna vy, eller kan leda till att procedurfunktioner misslyckas om de inte modifieras för att ta hänsyn till ändringarna.

source: Do you wish to continue?
sv: Önskar du fortsätta?

source: View Name
sv: Visa namn

source: Size of temporary files
sv: Storlek på temporära filer

source: Database
sv: Databas

source: Database...
sv: Databas...

source: Connect Database
sv: Anslut databas

source: Selected database is already connected.
sv: Vald databas är redan ansluten.

source: Disconnect from database
sv: Koppla bort från databasen

source: Selected database is already disconnected.
sv: Vald databas är redan frånkopplad.

source: Disconnect from all databases
sv: Koppla bort från alla databaser

source: All the databases are already disconnected.
sv: Alla databaser är redan bortkopplade.

source: ERD For Database
sv: ERD för databas

source: Connection lost
sv: Förbindelsen bruten

source: Would you like to reconnect to the database?
sv: Vill du återansluta till databasen?

source: Are you sure you want to disconnect from all databases?
sv: Är du säker på att du vill koppla bort från alla databaser?

source: Disconnect
sv: Koppla ned

source: Cancel
sv: Avbryt

source: Connect to database.
sv: Anslut till databasen.

source: Connect to database
sv: Anslut till databas

source: Database already connected.
sv: Databasen är redan ansluten.

source: Error: Object not found - %s.
sv: Fel på objektet: Objektet hittades inte - %s.

source: Are you sure you want to disconnect from the database - <b>%s</b>?
sv: Är du säker på att du vill koppla bort från databasen -? <b>%s</b>?

source: Encoding
sv: Avkodning

source: Strategy
sv: Strategi

source: WAL Log
sv: WAL-logg

source: File Copy
sv: Kopiera fil

source: builtin
sv: inbyggd

source: Character type
sv: Typ av tecken

source: ICU Locale
sv: Intensivvårdsavdelning

source: Collation Version
sv: Kollationsversion

source: ICU Rules
sv: ICU:s regler

source: Builtin Locale
sv: Inbyggd lokalspråk

source: Connection limit
sv: Gräns för anslutning

source: Template?
sv: Mall?

source: Note: When the preferences setting 'show template databases' is set to false, then template databases won't be displayed in the object explorer.
sv: Obs: Om inställningen "visa malldatabaser" i inställningarna är inställd på false visas inte malldatabaser i objektutforskaren.

source: Allow connections?
sv: Tillåta anslutningar?

source: Default Privileges
sv: Standardprivilegier

source: Schema restriction
sv: Schema-begränsning

source: Note: Changes to the schema restriction will require the Schemas node in the browser to be refreshed before they will be shown.
sv: Observera: Ändringar i schemabegränsningen kräver att noden Scheman i webbläsaren uppdateras innan de visas.

source: Please refresh the Schemas node to make changes to the schema restriction take effect.
sv: Uppdatera noden Scheman för att ändringarna i schemabegränsningen ska börja gälla.

source: Please specify Builtin Locale.
sv: Ange inbyggt språk.

source: Subscriptions
sv: Prenumerationer

source: Could not find the subscription information.
sv: Kunde inte hitta abonnemangsinformationen.

source: Could not find the specified subscription.
sv: Det gick inte att hitta den angivna prenumerationen.

source: Subscription dropped
sv: Prenumeration togs bort

source: Subscription
sv: Prenumeration

source: Subscription...
sv: Prenumeration...

source: Publication fetched successfully.
sv: Publikation hämtad framgångsrikt.

source: Check connection?
sv: Kontrollera anslutningen?

source: Host name/address
sv: Värdens namn/adress

source: Connection
sv: Anslutning

source: To apply changes to the connection configuration, please disconnect from the server and then reconnect.
sv: Om du vill göra ändringar i anslutningskonfigurationen ska du koppla från servern och sedan ansluta igen.

source: Password
sv: Lösenord

source: Connection timeout
sv: Timeout för anslutning

source: Passfile
sv: Passfil

source: Click the refresh button to get the publications
sv: Klicka på uppdateringsknappen för att få publikationerna

source: SSL mode
sv: SSL-läge

source: Allow
sv: Tillåt

source: Prefer
sv: Föredrar

source: Require
sv: Obligatorisk

source: Verify-CA
sv: Verifiera-CA

source: Verify-Full
sv: Verifiera-Full

source: Client certificate
sv: Klientcertifikat

source: Client certificate key
sv: Nyckel till klientcertifikat

source: Root certificate
sv: Rotcertifikat

source: Certificate revocation list
sv: Lista över återkallade certifikat

source: SSL compression?
sv: SSL-komprimering?

source: Copy data?
sv: Kopiera data?

source: Specifies whether the existing data in the publications that are being subscribed to should be copied once the replication starts.
sv: Anger om befintliga data i de publikationer som man prenumererar på ska kopieras när replikeringen startar.

source: Create slot?
sv: Skapa slot?

source: Specifies whether the command should create the replication slot on the publisher.This field will be disabled and set to false if subscription connects to same database.Otherwise, the CREATE SUBSCRIPTION call will hang.
sv: Anger om kommandot ska skapa replikeringsplatsen på utgivaren. Detta fält inaktiveras och sätts till false om prenumerationen ansluter till samma databas. I annat fall kommer CREATE SUBSCRIPTION-anropet att hänga sig.

source: Specifies whether the subscription should be actively replicating, or whether it should be just setup but not started yet.
sv: Anger om prenumerationen ska vara aktivt replikerande eller om den bara ska vara konfigurerad men inte startad ännu.

source: Refresh publication?
sv: Uppdatera publikationen?

source: Fetch missing table information from publisher.
sv: Hämta information om saknade tabeller från utgivaren.

source: Connect?
sv: Ansluta?

source: Specifies whether the CREATE SUBSCRIPTION should connect to the publisher at all. Setting this to false will change default values of enabled, create_slot and copy_data to false.
sv: Anger om CREATE SUBSCRIPTION överhuvudtaget ska ansluta till utgivaren. Om du ställer in detta till false ändras standardvärdena för enabled, create_slot och copy_data till false.

source: Slot name
sv: Platsens namn

source: Name of the replication slot to use. The default behavior is to use the name of the subscription for the slot name.
sv: Namnet på den replikeringsslot som ska användas. Standardinställningen är att använda namnet på prenumerationen för slotnamnet.

source: Synchronous commit
sv: Synkron överföring

source: The value of this parameter overrides the synchronous_commit setting. The default value is off.
sv: Värdet på denna parameter åsidosätter inställningen för synchronous_commit. Standardvärdet är off.

source: Streaming
sv: Strömning

source: Specifies whether to enable streaming of in-progress transactions for this subscription. By default, all transactions are fully decoded on the publisher and only then sent to the subscriber as a whole.
sv: Anger om streaming av pågående transaktioner ska aktiveras för den här prenumerationen. Som standard avkodas alla transaktioner fullständigt på utgivaren och skickas först därefter till abonnenten som en helhet.

source: Binary?
sv: Binär?

source: Specifies whether the subscription will request the publisher to send the data in binary format (as opposed to text). Even when this option is enabled, only data types having binary send and receive functions will be transferred in binary.
sv: Anger om prenumerationen ska begära att utgivaren skickar data i binärt format (i motsats till text). Även om detta alternativ är aktiverat kommer endast datatyper som har binära sändnings- och mottagningsfunktioner att överföras i binärt format.

source: Two phase?
sv: Två faser?

source: Specifies whether two-phase commit is enabled for this subscription.
sv: Anger om tvåfas commit är aktiverat för den här prenumerationen.

source: Disable on error?
sv: Inaktivera vid fel?

source: Specifies whether the subscription should be automatically disabled if any errors are detected by subscription workers during data replication from the publisher.
sv: Anger om prenumerationen ska inaktiveras automatiskt om några fel upptäcks av prenumerationsarbetare under datareplikering från utgivaren.

source: Run as owner?
sv: Driva som ägare?

source: If true, all replication actions are performed as the subscription owner. If false, replication workers will perform actions on each table as the owner of that table.
sv: Om true, utförs alla replikeringsåtgärder som prenumerationens ägare. Om false, kommer replikeringsarbetare att utföra åtgärder på varje tabell som ägare till den tabellen.

source: Password required?
sv: Lösenord krävs?

source: Specifies whether connections to the publisher made as a result of this subscription must use password authentication. Only superusers can set this value to false.
sv: Anger om anslutningar till utgivaren som görs som ett resultat av denna prenumeration måste använda lösenordsautentisering. Endast superanvändare kan ställa in detta värde till false.

source: Origin
sv: Ursprung

source: none
sv: ingen

source: any
sv: någon

source: Specifies whether the subscription will request the publisher to only send changes that do not have an origin or send changes regardless of origin. Setting origin to none means that the subscription will request the publisher to only send changes that do not have an origin. Setting origin to any means that the publisher sends changes regardless of their origin.
sv: Anger om prenumerationen ska begära att utgivaren endast skickar ändringar som inte har något ursprung eller om ändringar ska skickas oavsett ursprung. Om du anger origin till none innebär det att prenumerationen begär att utgivaren endast skickar ändringar som inte har något ursprung. Om du anger origin till any innebär det att utgivaren skickar ändringar oavsett deras ursprung.

source: Either Host name, Address must be specified.
sv: Antingen Host name eller Address måste anges.

source: Username must be specified.
sv: Användarnamn måste anges.

source: Port must be specified.
sv: Port måste anges.

source: Publication must be specified.
sv: Publikation måste anges.

source: Subscription name
sv: Prenumerationens namn

source: Latest end time
sv: Senaste sluttid

source: Latest end lsn
sv: Senaste slut lsn

source: Last message receipt
sv: Mottagande av senaste meddelandet

source: Last message send time
sv: Senaste meddelandets sändningstid

source: Xact committed
sv: Xact åtagit sig

source: Xact rolled back
sv: Xact rullas tillbaka

source: Tuples returned
sv: Tuples returneras

source: Tuples fetched
sv: Tuples hämtade

source: Directories
sv: Kataloger

source: Could not find the directory.
sv: Kunde inte hitta katalogen.

source: Could not find the directory information.
sv: Det gick inte att hitta kataloginformationen.

source: The specified directory could not be found.
sv: Den angivna katalogen kunde inte hittas.

source: Directory dropped
sv: Katalog togs bort

source: Could not find the directory on the server.
sv: Det gick inte att hitta katalogen på servern.

source: Directory
sv: Katalog

source: Directory...
sv: Katalog...

source: Location
sv: Plats

source: 'Location' cannot be empty.
sv: "Location" kan inte vara tomt.

source: pgAgent Jobs
sv: pgAgent jobb

source: Could not find the pgAgent job on the server.
sv: Kunde inte hitta pgAgent-jobbet på servern.

source: Updated the next runtime to now.
sv: Uppdaterade nästa körtid till nu.

source: Schedules
sv: Scheman

source: Could not find the specified job step.
sv: Det gick inte att hitta det angivna jobbsteget.

source: Job schedule update failed.
sv: Uppdateringen av jobbschemat misslyckades.

source: -- No SQL could be generated for the selected object.
sv: -- Ingen SQL kunde genereras för det valda objektet.

source: Schedule
sv: Schema

source: Schedule...
sv: Schema...

source: <any>
sv: <alla>

source: Time
sv: Tid

source: Please specify date/time.
sv: Ange datum/tid.

source: Schedules are specified using a
sv: Scheman specificeras med hjälp av en

source: cron-style
sv: cron-stil

source: For each selected time or date element, the schedule will execute.
sv: För varje valt tids- eller datumelement kommer schemat att utföras.

source: e.g. To execute at 5 minutes past every hour, simply select ‘05’ in the Minutes list box.
sv: om du t.ex. vill köra 5 minuter efter varje timme väljer du "05" i listrutan Minutes.

source: Values from more than one field may be specified in order to further control the schedule.
sv: Värden från mer än ett fält kan anges för att ytterligare styra schemat.

source: e.g. To execute at 12:05 and 14:05 every Monday and Thursday, you would click minute 05, hours 12 and 14, and weekdays Monday and Thursday.
sv: om du t.ex. vill köra kl. 12.05 och 14.05 varje måndag och torsdag klickar du på minut 05, timme 12 och 14 samt vardag måndag och torsdag.

source: For additional flexibility, the Month Days check list includes an extra Last Day option. This matches the last day of the month, whether it happens to be the 28th, 29th, 30th or 31st.
sv: För ytterligare flexibilitet innehåller checklistan Månadsdagar ett extra alternativ för Sista dagen. Detta matchar den sista dagen i månaden, oavsett om det råkar vara den 28:e, 29:e, 30:e eller 31:a.

source: Week days
sv: Veckodagar

source: Month days
sv: Månad dagar

source: Days
sv: Dygn

source: Times
sv: Gånger

source: Exceptions
sv: Undantag

source: Please enter the start time.
sv: Ange starttid.

source: pga_jobs
sv: pga_jobb

source: pgAgent Job
sv: pgAgent Jobb

source: pgAgent Job...
sv: pgAgent Jobb...

source: Run now
sv: Kör nu

source: Job class
sv: Jobbklass

source: Please select a class to categorize the job. This option will not affect the way the job runs.
sv: Välj en klass för att kategorisera jobbet. Detta alternativ kommer inte att påverka hur jobbet körs.

source: Host agent
sv: Värd agent

source: Enter the hostname of a machine running pgAgent if you wish to ensure only that machine will run this job. Leave blank if any host may run the job.
sv: Ange värdnamnet på en maskin som kör pgAgent om du vill vara säker på att endast den maskinen kör det här jobbet. Lämna tomt om alla värdar får köra jobbet.

source: Created
sv: Skapad

source: Changed
sv: Ändrad

source: Next run
sv: Nästa körning

source: Last run
sv: Senaste körning

source: Last result
sv: Senaste resultat

source: Unknown
sv: Okänd

source: Running at
sv: Kör på

source: Not running currently.
sv: Inte igång för närvarande.

source: Steps
sv: Steg

source: Job step creation failed.
sv: Skapandet av jobbsteg misslyckades.

source: Job step update failed.
sv: Uppdatering av jobbsteg misslyckades.

source: Step
sv: Steg

source: Job Step...
sv: Jobb steg...

source: Connection type
sv: Typ av anslutning

source: Remote
sv: Fjärr

source: Select <strong>Local</strong> if the job step will execute on the local database server, or <strong>Remote</strong> to specify a remote database server.
sv: Välj <strong>Local</strong> om jobbsteget ska köras på den lokala databasservern eller <strong>Remote</strong> om du vill ange en fjärrdatabasserver.

source: Please select the database on which the job step will run.
sv: Välj den databas som jobbsteget ska köras på.

source: Connection string
sv: Anslutningssträng

source: Please specify the connection string for the remote database server. Each parameter setting is in the form keyword = value. Spaces around the equal sign are optional. To write an empty value, or a value containing spaces, surround it with single quotes, e.g., keyword = 'a value'. Single quotes and backslashes within the value must be escaped with a backslash, i.e., ' and \.<br>For more information, please see the documentation on <a href="https://www.postgresql.org/docs/current/libpq-connect.html#LIBPQ-CONNSTRING" target="_blank">libpq connection strings</a>.
sv: Ange anslutningssträngen för fjärrdatabasservern. Varje parameterinställning är i formatet nyckelord = värde. Mellanslag runt likhetstecknet är valfria. Om du vill skriva ett tomt värde, eller ett värde som innehåller mellanslag, omger du det med enkla citattecken, t.ex. keyword = 'a value'. Enstaka citattecken och backslash inom värdet måste avbrytas med ett backslash, t.ex. ' och \.<br>Mer information finns i dokumentationen om <a href="https://www.postgresql.org/docs/current/libpq-connect.html#LIBPQ-CONNSTRING" target="_blank">libpq-anslutningssträngar</a>.

source: On error
sv: Vid fel

source: Fail
sv: Misslyckad

source: Success
sv: Lyckades

source: Ignore
sv: Ignorera

source: Please select a database.
sv: Välj en databas.

source: Please enter a connection string.
sv: Ange en anslutningssträng.

source: Please enter a valid connection string.
sv: Ange en giltig anslutningssträng.

source: Invalid parameter in the connection string - %s.
sv: Ogiltig parameter i anslutningssträngen - %s.

source: Please specify code to execute.
sv: Ange vilken kod som ska köras.

source: Please select valid on error option.
sv: Välj giltig på fel alternativ.

source: Run
sv: Kör

source: Start time
sv: Starttid

source: Duration
sv: Varaktighet

source: End time
sv: Sluttid

source: Result
sv: Resultat

source: Output
sv: Utmatning

source: PGD Replication Groups
sv: PGD-replikeringsgrupper

source: Could not find the Replication Node.
sv: Replikationsnoden kunde inte hittas.

source: Sequence ID
sv: Sekvens-ID

source: Group Name
sv: Gruppnamn

source: Local DB Name
sv: Namn på lokal DB

source: Streaming Mode
sv: Streaming-läge

source: Enable Proxy Routing?
sv: Aktivera Proxy Routing?

source: Enable Raft?
sv: Aktivera Raft?

source: PGD Replication Group
sv: PGD Replikationsgrupp

source: Replica Nodes
sv: Replika noder

source: App Name
sv: App Namn

source: Client Address
sv: Kundens adress

source: Client Hostname
sv: Klientens värdnamn

source: Client Port
sv: Klientport

source: State
sv: Län

source: Sent LSN
sv: Skickat LSN

source: WAL Details
sv: WAL Detaljer

source: Write LSN
sv: Skriv LSN

source: Replay LSN
sv: Spela upp LSN

source: Write Lag
sv: Skriv lag

source: Replay Lag
sv: Uppspelningsfördröjning

source: Slot Name
sv: Slottens namn

source: Replication Slot
sv: Replikeringsplats

source: Slot Type
sv: Typ av kortplats

source: Active
sv: Aktiv

source: Resource Groups
sv: Resursgrupper

source: Could not find the resource group.
sv: Det gick inte att hitta resursgruppen.

source: The specified resource group could not be found.
sv: Den angivna resursgruppen kunde inte hittas.

source: Resource Group dropped
sv: Resursgrupp togs bort

source: The specified resource group could not be found.
sv: Den angivna resursgruppen kunde inte hittas.

source: Resource Group
sv: Resursgrupp

source: Resource Group...
sv: Resursgruppen...

source: System resource group?
sv: Systemresursgrupp?

source: CPU rate limit (percentage)
sv: Begränsning av CPU-hastighet (procent)

source: Dirty rate limit (KB)
sv: Gräns för smutsig hastighet (KB)

source: Login/Group Roles
sv: Inloggning/Grupproller

source: Date format is invalid.
sv: Datumformatet är ogiltigt.

source: Connection limit must be an integer value or equal to -1.
sv: Connection limit måste vara ett heltalsvärde eller lika med -1.

source: Role members information must be passed as an array of JSON objects in the following format: rolmembers:[{ role: [rolename], admin: True/False }, ... ]
sv: Information om rollmedlemmar måste skickas som en array av JSON-objekt i följande följande format: rollmedlemmar:[{ roll: [rolename], admin: Sant/Falskt }, ... ]
