Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Incorrect username or password.
sv: Felaktigt användarnamn eller lösenord.

source: Unauthorised access, permission denied.
sv: Obehörig åtkomst, behörighet nekad.

source: Auto-detected {0} installation with the data directory at {1}
sv: Automatisk detektering av {0}-installation med datakatalogen på {1}

source: You need to refresh the page.
sv: Du måste uppdatera sidan.

source: About %(appname)s
sv: Om %(appname)s

source: Desktop
sv: Skrivbord

source: Application Mode
sv: Applikationsläge

source: Commit
sv: Genomför

source: Current User
sv: Aktuell användare

source: Electron Version
sv: Elektronversion

source: Browser
sv: Webbläsare

source: Operating System
sv: Operativsystem

source: pgAdmin Database File
sv: pgAdmin databasfil

source: Log File
sv: Loggfil

source: pgAdmin Server Configuration
sv: konfiguration av pgAdmin-server

source: About %s
sv: Om %s

source: Your account is locked. Please contact the Administrator.
sv: Ditt konto är låst. Kontakta administratören.

source: {0} more attempts remaining.
sv: {0} fler försök återstår.

source: {0} more attempt remaining.
sv: {0} fler försök kvarstår.

source: Login failed
sv: Inloggning misslyckades

source: Email/Username not provided
sv: E-post/användarnamn har inte angetts

source: Password not provided
sv: Lösenordet har inte angetts

source: Email/Username is not valid
sv: E-post/användarnamn är inte giltigt

source: internal
sv: intern

source: Kerberos authentication can't be used as GSSAPI module couldn't be loaded.
sv: Kerberos-autentisering kan inte användas eftersom GSSAPI-modulen inte kunde läsas in.

source: Kerberos authentication failed. Couldn't find kerberos ticket.
sv: Kerberos-autentiseringen misslyckades. Kunde inte hitta kerberos-biljett.

source: Delegated credentials not supplied.
sv: Delegerad fullmakt har inte lämnats.

source: Error searching the LDAP directory: {}
sv: Fel vid sökning i LDAP-katalogen: {}

source: Error connecting to the LDAP server: {}
sv: Fel vid anslutning till LDAP-servern: {}

source: LDAP configuration error: Set the bind password.
sv: Fel i LDAP-konfigurationen: Ange bindningslösenordet.

source: Error binding to the LDAP server: {}
sv: Fel vid bindning till LDAP-servern: {}

source: Error starting TLS: {}
sv: Fel vid start av TLS: {}

source: LDAP configuration error: {}
sv: Fel i LDAP-konfigurationen: {}

source: LDAP configuration error: Set the proper LDAP URI.
sv: Fel i LDAP-konfigurationen: Ange rätt LDAP-URI.

source: LDAP configuration error: Set the Search Domain.
sv: Fel i LDAP-konfigurationen: Ställ in sökdomänen.

source: More than one result found.
sv: Mer än ett resultat hittades.

source: Could not find the specified user.
sv: Kunde inte hitta den angivna användaren.

source: Please set the configuration parameters properly.
sv: Ställ in konfigurationsparametrarna korrekt.

source: webserver
sv: webbserver

source: Webserver authenticate failed.
sv: Autentisering av webbserver misslyckades.

source: '{}' is not a valid multi-factor authentication method
sv: '{}' är inte en giltig metod för multifaktorautentisering

source: No valid multi-factor authentication found, hence - disabling it.
sv: Ingen giltig multifaktorautentisering hittades, därför avaktiveras den.

source: Authenticator App
sv: Autentiseringsapp

source: Enter code
sv: Ange kod

source: User has not registered the Time-based One-Time Password (TOTP) Authenticator for authentication.
sv: Användaren har inte registrerat den tidsbaserade TOTP-autentiseraren (Time-based One-Time Password) för autentisering.

source: User does not have valid HASH to generate the OTP.
sv: Användaren har inte giltig HASH för att generera OTP.

source: Enter the code shown in your authenticator application for TOTP (Time-based One-Time Password)
sv: Ange den kod som visas i din autentiseringsapplikation för TOTP (tidsbaserat engångslösenord)

source: TOTP Authenticator QRCode
sv: TOTP-autentiserare QRCod

source: Scan the QR code and the enter the code from the TOTP Authenticator application
sv: Skanna QR-koden och ange koden från TOTP Authenticator-applikationen

source: Failed to validate the code
sv: Misslyckades med att validera koden

source: TOTP Authenticator registered successfully for authentication.
sv: TOTP Authenticator registrerades framgångsrikt för autentisering.

source: Not accessible
sv: Ej tillgänglig

source: No email address is available.
sv: Ingen e-postadress är tillgänglig.

source: {} - Verification Code
sv: {} - Verifieringskod

source: Failed to send the code to email.
sv: Misslyckades med att skicka koden till e-post.

source: A verification code was sent to {}. Check your email and enter the code.
sv: En verifieringskod har skickats till {}. Kontrollera din e-post och ange koden.

source: User has not registered for email authentication
sv: Användaren har inte registrerat sig för e-postautentisering

source: Email Authentication
sv: Autentisering av e-post

source: Verify with Email Authentication
sv: Verifiera med e-postautentisering

source: Send Code
sv: Skicka kod

source: Sending Code...
sv: Skickar kod...

source: Enter the email address to send a code
sv: Ange e-postadressen för att skicka en kod

source: Email address
sv: E-postadress

source: Note
sv: Anteckning

source: This email address will only be used for two factor authentication purposes. The email address for the user account will not be changed.
sv: Den här e-postadressen kommer endast att användas för tvåfaktorsautentisering. E-postadressen för användarkontot kommer inte att ändras.

source: Enter code here
sv: Ange kod här

source: Email Authentication registered successfully.
sv: E-postautentisering registrerades framgångsrikt.

source: Invalid code
sv: Ogiltig kod

source: No authentication method provided.
sv: Ingen autentiseringsmetod angiven.

source: No user supported authentication method provided
sv: Ingen autentiseringsmetod som stöds av användaren tillhandahålls

source: '{}' is already registered'
sv: '{}' är redan registrerad'

source: '{}' unregistered from the authentication list.
sv: '{}' avregistrerad från autentiseringslistan.

source: '{}' is not found in the authentication list.
sv: '{}' finns inte i autentiseringslistan.

source: Please close the dialog.
sv: Stäng dialogen.

source: Can't access this page, when multi factor authentication is disabled.
sv: Det går inte att komma åt den här sidan när multifaktorautentisering är inaktiverad.

source: Complete the authentication process first
sv: Slutför autentiseringsprocessen först

source: Your password has not been changed.
sv: Ditt lösenord har inte ändrats.

source: SMTP Socket error: {error} {pass_error}
sv: Fel i SMTP-uttaget: {error} {pass_error}

source: SMTP error: {error} {pass_error}
sv: SMTP-fel: {error} {pass_error}

source: Error: {error} {pass_error}
sv: Felmeddelande: {error} {pass_error}

source: Nodes
sv: Noder

source: The master password could not be retrieved from the MASTER_PASSWORD_HOOK utility specified {0}. Please check that the hook utility is configured correctly.
sv: Det gick inte att hämta huvudlösenordet från MASTER_PASSWORD_HOOK-verktyget som specificerats {0}. Kontrollera att krokverktyget är korrekt konfigurerat.

source: Incorrect master password
sv: Felaktigt huvudlösenord

source: Master password cannot be empty
sv: Masterlösenordet kan inte vara tomt

source: pgAdmin user password changed successfully
sv: pgAdmin-användarens lösenord har ändrats framgångsrikt

source: Your account is authenticated using an external {} source. Please contact the administrators of this service if you need to reset your password.
sv: Ditt konto autentiseras med hjälp av en extern {} källa. Kontakta administratörerna för den här tjänsten om du behöver återställa ditt lösenord.

source: You successfully reset your password but your account is locked. Please contact the Administrator.
sv: Du har lyckats återställa ditt lösenord men ditt konto är låst. Kontakta administratören.

source: Show system objects?
sv: Visa systemobjekt?

source: Show empty object collections?
sv: Visa tomma objektsamlingar?

source: If turned off, then all object collections which are empty will be hidden from browser tree.
sv: Om den är avstängd kommer alla objektsamlingar som är tomma att döljas från webbläsarträdet.

source: Show template databases?
sv: Visa malldatabaser?

source: Hide shared servers?
sv: Gömma delade servrar?

source: Display
sv: Visning

source: If set to True, then all shared servers will be hidden from browser tree
sv: Om inställningen är True döljs alla delade servrar från webbläsarträdet

source: Object explorer tree state saving interval
sv: Sparintervall för trädstatus i objektutforskaren

source: Object explorer state saving interval in seconds. Use -1 to disable the tree saving mechanism.
sv: Sparintervall för objektutforskarens tillstånd i sekunder. Använd -1 för att inaktivera trädbesparingsmekanismen.

source: Confirm on close or refresh?
sv: Bekräfta vid stängning eller uppdatering?

source: Confirm closure or refresh of the browser or browser tab is intended before proceeding.
sv: Bekräfta att webbläsaren eller webbläsarfliken ska stängas eller uppdateras innan du fortsätter.

source: Confirm before Close/Reset in object properties dialog?
sv: Bekräfta innan Close/Reset i dialogen för objektets egenskaper?

source: Confirm before closing or resetting the changes in the properties dialog for an object if the changes are not saved.
sv: Bekräfta innan du stänger eller återställer ändringarna i egenskapsdialogen för ett objekt om ändringarna inte sparas.

source: Auto-expand sole children
sv: Auto-expandera enda barn

source: If a treeview node is expanded and has only a single child, automatically expand the child node as well.
sv: Om en trädvy-nod expanderas och bara har ett enda underordnat objekt, expanderas även den underordnade noden automatiskt.

source: Count rows if estimated less than
sv: Räkna rader om uppskattningen är mindre än

source: Properties
sv: Egenskaper

source: Maximum job history rows
sv: Maximalt antal rader i jobbhistoriken

source: The maximum number of history rows to show on the Statistics tab for pgAgent jobs
sv: Det maximala antalet historikrader som ska visas på fliken Statistik för pgAgent-jobb

source: Process details/logs retention days
sv: Bevarandedagar för processdetaljer/loggar

source: Processes
sv: Processer

source: After this many days, the process info and logs will be automatically cleared.
sv: Efter så många dagar kommer processinformationen och loggarna att rensas automatiskt.

source: Key
sv: Nyckel

source: Shift
sv: Skift

source: Object Explorer
sv: Objektutforskare

source: Tabbed panel backward
sv: Flikad panel bakåt

source: Close tab panel
sv: Stäng flikpanelen

source: Tabbed panel forward
sv: Flikad panel framåt

source: File main menu
sv: Huvudmeny för fil

source: Object main menu
sv: Objektets huvudmeny

source: Tools main menu
sv: Verktygshuvudmeny

source: Help main menu
sv: Hjälp huvudmeny

source: Open query tool
sv: Öppet frågeverktyg

source: View data
sv: Visa data

source: Search objects
sv: Sök objekt

source: Create object
sv: Skapa objekt

source: Edit object properties
sv: Redigera objektets egenskaper

source: Direct debugging
sv: Direkt felsökning

source: Refresh object explorer
sv: Uppdatera objektutforskaren

source: Add grid row
sv: Lägg till rutnätsrad

source: Quick Search
sv: Snabbsökning

source: Dynamic tab size
sv: Dynamisk flikstorlek

source: If set to True, the tabs will take full size as per the title, it will also applicable for already opened tabs
sv: Om inställningen är True kommer flikarna att visas i full storlek enligt titeln, och detta gäller även för redan öppnade flikar

source: Query tool tab title
sv: Fliktitel för frågeverktyg

source: Supported placeholders are %DATABASE%, %USERNAME%, and %SERVER%. Users can provide any string with or without placeholders of their choice. The blank title will be revert back to the default title with placeholders.
sv: Platshållare som stöds är %DATABASE%, %USERNAME% och %SERVER%. Användare kan ange vilken sträng som helst med eller utan platshållare efter eget val. Den tomma titeln kommer att återgå till standardtiteln med platshållare.

source: View/Edit data tab title
sv: Visa/redigera titeln på datafliken

source: Supported placeholders are %SCHEMA%, %TABLE%, %DATABASE%, %USERNAME%, and %SERVER%. Users can provide any string with or without placeholders of their choice. The blank title will be revert back to the default title with placeholders.
sv: Platshållare som stöds är %SCHEMA%, %TABLE%, %DATABASE%, %USERNAME% och %SERVER%. Användare kan ange vilken sträng som helst med eller utan platshållare efter eget val. Den tomma titeln kommer att återgå till standardtiteln med platshållare.

source: Debugger tab title
sv: Titel på fliken Felsökare

source: Supported placeholders are %FUNCTION%, %ARGS%, %SCHEMA% and %DATABASE%. Users can provide any string with or without placeholders of their choice. The blank title will be revert back to the default title with placeholders.
sv: Platshållare som stöds är %FUNCTION%, %ARGS%, %SCHEMA% och %DATABASE%. Användare kan ange vilken sträng som helst med eller utan platshållare efter eget val. Den tomma titeln kommer att återgå till standardtiteln med platshållare.

source: Query Tool
sv: Frågeverktyg

source: Debugger
sv: Felsökare

source: ERD Tool
sv: ERD-verktyg

source: PSQL Tool
sv: PSQL-verktyg

source: Open in new browser tab
sv: Öppna i en ny webbläsarflik

source: Select Query Tool, Debugger, Schema Diff, ERD Tool or PSQL Tool from the drop-down to set open in new browser tab for that particular module.
sv: Välj Query Tool, Debugger, Schema Diff, ERD Tool eller PSQL Tool från rullgardinsmenyn för att ange att modulen ska öppnas i en ny webbläsarflik.

source: Select open new tab...
sv: Välj öppna ny flik...

source: PSQL tool tab title
sv: Titel på fliken PSQL-verktyg

source: Enable object breadcrumbs?
sv: Aktivera brödsmulor för objekt?

source: Enable breadcrumbs to show the complete path of an object in the object explorer. The breadcrumbs are displayed on object mouse hover.
sv: Aktivera brödsmulor för att visa den fullständiga sökvägen för ett objekt i objektutforskaren. Brödsmulorna visas när muspekaren rör objektet.

source: Show comment with object breadcrumbs?
sv: Visa kommentar med objektet brödsmulor?

source: Show object comment along with breadcrumbs.
sv: Visa objektkommentar tillsammans med brödsmulor.

source: Unimplemented method ({0}) for this url ({1})
sv: Ej implementerad metod ({0}) för denna webbadress ({1})

source: Required properties are missing.
sv: Nödvändiga egenskaper saknas.

source: Connection to the server has been lost.
sv: Anslutningen till servern har brutits.

source: Could not find the specified {}.
sv: Kunde inte hitta den angivna {}.

source: The specified server group cannot be deleted.
sv: Den angivna servergruppen kan inte tas bort.

source: The specified server group already exists.
sv: Den angivna servergruppen finns redan.

source: No server group name was specified
sv: Inget servergruppnamn har angetts

source: Could not find the server group.
sv: Det gick inte att hitta servergruppen.

source: Servers
sv: Servrar

source: The specified server group with id# {0} could not be found.
sv: Den angivna servergruppen med id-nummer {0} kunde inte hittas.

source: Could not find the server with id# {0}.
sv: Det gick inte att hitta servern med id-nummer {0}.

source: The specified server could not be found. Does the user have permission to access the server?
sv: Den angivna servern kunde inte hittas. Har användaren behörighet att komma åt servern?

source: Server deleted
sv: Server raderad

source: Could not find the required server.
sv: Kunde inte hitta den server som krävs.

source: name
sv: namn

source: Maintenance database
sv: Databas för underhåll

source: Username
sv: Användarnamn

source: Comments
sv: Kommentarer

source: Role
sv: Roll

source: Not a valid Host address
sv: Inte en giltig Host-adress

source: No parameters were changed.
sv: Inga parametrar ändrades.

source: '{0}' is not allowed to modify, when server is connected.
sv: '{0}' är inte tillåtet att ändra när servern är ansluten.

source: Could not find the required parameter ({}).
sv: Den nödvändiga parametern ({}) kunde inte hittas.

source: Unable to connect to server: {}
sv: Det går inte att ansluta till servern: {}

source: Server has no active connection for generating statistics.
sv: Servern har ingen aktiv anslutning för generering av statistik.

source: Please enter the server details to connect
sv: Ange serveruppgifterna för att ansluta

source: Server connected.
sv: Server ansluten.

source: Server could not be disconnected.
sv: Servern kunde inte kopplas bort.

source: Server disconnected.
sv: Servern frånkopplad.

source: Could not reload the server configuration.
sv: Det gick inte att läsa om serverkonfigurationen.

source: Server configuration reloaded.
sv: Serverkonfigurationen har lästs om.

source: Named restore point created: {0}
sv: Namngiven återställningspunkt skapad: {0}

source: Named restore point creation failed ({0})
sv: Skapandet av en namngiven återställningspunkt misslyckades ({0})

source: Could not find the required parameter(s).
sv: Kunde inte hitta den eller de parametrar som krävs.

source: Passwords do not match.
sv: Lösenorden stämmer inte överens.

source: Incorrect password.
sv: Felaktigt lösenord.

source: Password changed successfully.
sv: Lösenordsbytet genomfört.

source: WAL replay paused
sv: WAL-uppspelning pausad

source: WAL replay resumed
sv: WAL-uppspelning återupptagen

source: Please connect the server.
sv: Anslut servern.

source: The saved password cleared successfully.
sv: Det sparade lösenordet rensades framgångsrikt.

source: EDB Advanced Server Binary Path
sv: EDB Advanced Server Binär sökväg

source: Path to the directory containing the EDB Advanced Server utility programs (pg_dump, pg_restore etc).
sv: Sökväg till den katalog som innehåller EDB Advanced Server-verktygsprogrammen (pg_dump, pg_restore etc).

source: PostgreSQL Binary Path
sv: PostgreSQL binär sökväg

source: Path to the directory containing the PostgreSQL utility programs (pg_dump, pg_restore etc).
sv: Sökväg till katalogen som innehåller PostgreSQL-verktygsprogrammen (pg_dump, pg_restore etc.).

source: Paths
sv: Sökvägar

source: Binary paths
sv: Binära banor

source: Type: {0}, Description: {1}, Priority: {2}
sv: Typ: {0}, Beskrivning: {1}, Prioritet: {2}

source: Could not find the utility for the operation '%s'
sv: Kunde inte hitta verktyget för operationen '%s'

source: Databases
sv: Databaser

source: Could not find the server.
sv: Det gick inte att hitta servern.

source: Database connected.
sv: Databas ansluten.

source: Database could not be disconnected.
sv: Databasen kunde inte kopplas bort.

source: Database disconnected.
sv: Databasen är bortkopplad.

source: Could not find the database on the server.
sv: Databasen kunde inte hittas på servern.

source: Database could not be deleted.
sv: Databasen kunde inte raderas.

source: Error: Object not found.
sv: Fel på objektet: Objektet hittades inte.

source: The specified database could not be found.
sv: Den angivna databasen kunde inte hittas.

source: -- definition incomplete
sv: -- definition ofullständig

source: Could not find the specified cast.
sv: Kunde inte hitta den angivna rollbesättningen.

source: Could not find the cast information.
sv: Kunde inte hitta information om rollbesättningen.

source: The specified cast object could not be found.
sv: Det angivna cast-objektet kunde inte hittas.

source: Cast dropped
sv: Cast togs bort

source: Could not find the specified cast on the server.
sv: Det gick inte att hitta den angivna rollen på servern.

source: -- definition incomplete
sv: -- definition ofullständig

source: Could not generate reversed engineered SQL for the cast.
sv: Det gick inte att generera omvänd SQL-teknik för rollbesättningen.

source: Could not generate reversed engineered SQL for the cast node.
sv: Det gick inte att generera SQL för omvänd konstruktion för den gjutna noden.

source: Something went wrong
sv: Något gick fel

source: Name
sv: Namn

source: Source type
sv: Källtyp

source: Target type
sv: Typ av mål

source: Function
sv: Funktion

source: Context
sv: Sammanhang

source: Comment
sv: Kommentar

source: Source type must be selected.
sv: Källtyp måste väljas.

source: Target type must be selected.
sv: Måltyp måste väljas.

source: DBMS Job Scheduler
sv: Schemaläggare för DBMS-jobb

source: DBMS Jobs
sv: DBMS Jobb

source: Could not find the specified job.
sv: Det gick inte att hitta det angivna jobbet.

source: Job creation failed.
sv: Jobbskapandet misslyckades.

source: Job enabled
sv: Aktiverat jobb

source: Job disabled
sv: Jobb för funktionshindrade

source: Started the Job execution.
sv: Startade utförandet av jobbet.

source: DBMS Job
sv: DBMS Jobb

source: DBMS Job...
sv: DBMS Jobb...

source: Enable Job
sv: Aktivera jobb

source: Job is already enabled.
sv: Jobbet är redan aktiverat.

source: Disable Job
sv: Inaktivera jobb

source: Job is already disabled.
sv: Jobbet är redan inaktiverat.

source: Run Job
sv: Kör jobb

source: Are you sure you want to enable the job %s?
sv: Är du säker på att du vill aktivera jobbet %s?

source: Are you sure you want to disable the job %s?
sv: Är du säker på att du vill avaktivera jobbet %s?

source: Are you sure you want to run the job %s now?
sv: Är du säker på att du vill köra jobbet %s nu?

source: Enabled?
sv: Aktiverad?

source: Job Type
sv: Jobbtyp

source: If the Job Type is Self-Contained you need to specify the action and repeat interval in the Action and Repeat tabs respectively. If the Job Type is Pre-Defined you need to specify the existing Program and Schedule names in the Pre-Defined tab.
sv: Om jobbtypen är Self-Contained måste du ange åtgärd och upprepningsintervall på flikarna Action respektive Repeat. Om jobbtypen är Pre-Defined måste du ange de befintliga program- och schemanamnen på fliken Pre-Defined.

source: Run Count
sv: Antal körningar

source: Failure Count
sv: Antal fel

source: Program Name
sv: Programnamn

source: Pre-Defined
sv: Fördefinierad

source: Schedule Name
sv: Schemanamn

source: Job Type cannot be empty.
sv: Job Type kan inte vara tomt.

source: Code cannot be empty.
sv: Koden får inte vara tom.

source: Procedure cannot be empty.
sv: Förfarandet kan inte vara tomt.

source: Either Start time or Repeat interval must be specified.
sv: Antingen Starttid eller Upprepningsintervall måste anges.

source: Start time must be less than end time
sv: Starttiden måste vara mindre än sluttiden

source: Pre-Defined program name cannot be empty.
sv: Fördefinierat programnamn kan inte vara tomt.

source: Pre-Defined schedule name cannot be empty.
sv: Namnet på det fördefinierade schemat kan inte vara tomt.

source: DBMS Programs
sv: DBMS-program

source: Could not find the specified program.
sv: Kunde inte hitta det angivna programmet.

source: Job program creation failed.
sv: Skapandet av jobbprogram misslyckades.

source: Could not find the DBMS Schedule.
sv: Kunde inte hitta DBMS Schedule.

source: Program enabled
sv: Program aktiverat

source: Program disabled
sv: Program inaktiverat

source: Enable Program
sv: Aktivera program

source: Program is already enabled.
sv: Programmet är redan aktiverat.

source: Disable Program
sv: Inaktivera program

source: Program is already disabled.
sv: Programmet är redan inaktiverat.

source: Are you sure you want to enable the program %s?
sv: Är du säker på att du vill aktivera programmet %s?

source: Are you sure you want to disable the program %s?
sv: Är du säker på att du vill avaktivera programmet %s?

source: DBMS Schedules
sv: DBMS-scheman
