Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Please select any database, schema or schema objects from the object explorer to access Grant Wizard Tool.
sv: Välj en databas, ett schema eller schemaobjekt från objektutforskaren för att komma åt Grant Wizard Tool.

source: Import/Export
sv: Importera/Exportera

source: Copying table data using query on database '{0}' and server '{1}'
sv: Kopiera tabelldata med hjälp av en fråga på databas '{0}' och server '{1}'

source: Copying table data '{0}.{1}' on database '{2}' and server '{3}'
sv: Kopiering av tabelldata '{0}.{1}' på databas '{2}' och server '{3}'

source: Export - Copying table data using query
sv: Export - Kopiera tabelldata med hjälp av en fråga

source: Import -
sv: Importera -

source: Export -
sv: Exportera -

source: Copying table data
sv: Kopiera tabelldata

source: Import Data
sv: Importera data

source: Export Data
sv: Exportera data

source: Please connect to the server first...
sv: Anslut till servern först...

source: Please specify a valid file
sv: Ange en giltig fil

source: Import/Export Data...
sv: Importera/exportera data...

source: Please select any table from the object explorer to Import/Export data.
sv: Välj valfri tabell från objektutforskaren för att importera/exportera data.

source: Export Data Using Query...
sv: Exportera data med hjälp av Query...

source: Please select any database from the object explorer to Export Data using query.
sv: Välj en databas från objektutforskaren för att exportera data med hjälp av en fråga.

source: Export Data Using Query - database '%s'
sv: Exportera data med hjälp av Query - databas '%s'

source: Import/Export data - table '%s'
sv: Importera/exportera data - tabell '%s'

source: Columns to export
sv: Kolumner som ska exporteras

source: Columns to import
sv: Kolumner att importera

source: Import
sv: Importera

source: Export
sv: Exportera

source: binary
sv: binär

source: On Error
sv: Vid fel

source: stop
sv: stoppa

source: ignore
sv: ignorera

source: Specifies how to behave when encountering an error converting a columns input value into its data type. An error_action value of stop means fail the command, while ignore means discard the input row and continue with the next one. The default is stop. The ignore option is applicable only for COPY FROM when the FORMAT is text or csv.
sv: Anger hur man ska agera om man stöter på ett fel när man konverterar en kolumns indatavärde till dess datatyp. Ett error_action-värde på stop innebär att kommandot misslyckas, medan ignore innebär att inmatningsraden kasseras och att man fortsätter med nästa. Standardvärdet är stop. Alternativet ignore är endast tillämpligt för COPY FROM när FORMAT är text eller csv.

source: Log Verbosity
sv: Loggens ordningsföljd

source: default
sv: standard

source: verbose
sv: utförlig

source: Specify the amount of messages emitted by a COPY command: default or verbose. If verbose is specified, additional messages are emitted during processing. This is currently used in COPY FROM command when ON_ERROR option is set to ignore.
sv: Ange hur många meddelanden som ska skickas ut av ett COPY-kommando: default eller verbose. Om verbose anges skickas ytterligare meddelanden ut under bearbetningen. Detta används för närvarande i kommandot COPY FROM när alternativet ON_ERROR är inställt på ignore.

source: Freeze
sv: Frys

source: Requests copying the data with rows already frozen, just as they would be after running the VACUUM FREEZE command.
sv: Begäran om kopiering av data med rader som redan är frysta, precis som de skulle vara efter att ha kört kommandot VACUUM FREEZE.

source: Specifies the character that separates columns within each row (line) of the file. The default is a tab character in text format, a comma in CSV format. This must be a single one-byte character. This option is not allowed when using binary format.
sv: Anger det tecken som avgränsar kolumnerna inom varje rad (rad) i filen. Standard är ett tabbtecken i textformat och ett kommatecken i CSV-format. Detta måste vara ett enda tecken på en byte. Detta alternativ är inte tillåtet när binärt format används.

source: Quote
sv: Citat

source: Specifies the quoting character to be used when a data value is quoted. The default is double-quote. This must be a single one-byte character. This option is allowed only when using CSV format.
sv: Anger det citattecken som ska användas när ett datavärde citeras. Standardvärdet är dubbelcitat. Detta måste vara ett enda tecken på en byte. Detta alternativ är endast tillåtet när CSV-format används.

source: Escape
sv: Flykt

source: Specifies the character that should appear before a data character that matches the QUOTE value. The default is the same as the QUOTE value (so that the quoting character is doubled if it appears in the data). This must be a single one-byte character. This option is allowed only when using CSV format.
sv: Anger det tecken som ska visas före ett datatecken som matchar QUOTE-värdet. Standardvärdet är detsamma som QUOTE-värdet (så att citattecknet dubbleras om det förekommer i data). Detta måste vara ett enda tecken på en byte. Detta alternativ är endast tillåtet när CSV-format används.

source: NULL String
sv: NULL Sträng

source: Specifies the string that represents a null value. The default is \N (backslash-N) in text format, and an unquoted empty string in CSV format. You might prefer an empty string even in text format for cases where you don't want to distinguish nulls from empty strings. This option is not allowed when using binary format.
sv: Anger den sträng som representerar ett nollvärde. Standardvärdet är \N (backslash-N) i textformat och en tom sträng utan citationstecken i CSV-format. Du kanske föredrar en tom sträng även i textformat i fall där du inte vill skilja på nulls och tomma strängar. Det här alternativet är inte tillåtet när binärt format används.

source: Default String
sv: Standardsträng

source: Specifies the string that represents a default value. Each time the string is found in the input file, the default value of the corresponding column will be used. This option is allowed only in COPY FROM, and only when not using binary format
sv: Anger den sträng som representerar ett standardvärde. Varje gång strängen hittas i indatafilen kommer standardvärdet för motsvarande kolumn att användas. Detta alternativ är endast tillåtet i COPY FROM, och endast när binärformat inte används

source: Columns for importing...
sv: Kolumner för import...

source: Columns for exporting...
sv: Kolumner för export...

source: An optional list of columns to be copied. If no column list is specified, all columns of the table will be copied.
sv: En valfri lista över kolumner som ska kopieras. Om ingen kolumnlista anges kommer alla kolumner i tabellen att kopieras.

source: Export Data Query
sv: Fråga om export av data

source: Specifies A SELECT, VALUES, INSERT, UPDATE, DELETE, or MERGE command whose results are to be copied.
sv: Anger ett SELECT-, VALUES-, INSERT-, UPDATE-, DELETE- eller MERGE-kommando vars resultat ska kopieras.

source: Force Quote columns
sv: Force Quote kolumner

source: Force Quote columns...
sv: Force Quote-kolumner...

source: Forces quoting to be used for all non-NULL values in each specified column. NULL output is never quoted. If * is specified, non-NULL values will be quoted in all columns. This option is allowed only in COPY TO, and only when using CSV format.
sv: Tvingar citering att användas för alla icke-NULL-värden i varje angiven kolumn. NULL-utdata citeras aldrig. Om * anges kommer icke-NULL-värden att citeras i alla kolumner. Detta alternativ är endast tillåtet i COPY TO och endast när CSV-format används.

source: NOT NULL columns
sv: NOT NULL kolumner

source: Not null columns...
sv: Inte nollkolumner...

source: Do not match the specified column values against the null string. In the default case where the null string is empty, this means that empty values will be read as zero-length strings rather than nulls, even when they are not quoted. This option is allowed only in import, and only when using CSV format.
sv: Matchar inte de angivna kolumnvärdena mot null-strängen. I standardfallet där nollsträngen är tom innebär detta att tomma värden läses som strängar med noll längd i stället för nollsträngar, även om de inte är citerade. Det här alternativet är endast tillåtet vid import och endast när CSV-format används.

source: NULL columns
sv: NULL-kolumner

source: Null columns...
sv: Null-kolumner...

source: Match the specified columns values against the null string, even if it has been quoted, and if a match is found set the value to NULL. In the default case where the null string is empty, this converts a quoted empty string into NULL. This option is allowed only in COPY FROM, and only when using CSV format.
sv: Matchar de angivna kolumnvärdena mot null-strängen, även om den har citerats, och om en matchning hittas sätts värdet till NULL. I standardfallet där null-strängen är tom konverteras en citerad tom sträng till NULL. Detta alternativ är endast tillåtet i COPY FROM och endast när CSV-format används.

source: Export Data Query can not be empty.
sv: Export Data Query kan inte vara tom.

source: Import/Export Servers
sv: Import/Export-servrar

source: The specified file is not in the correct format.
sv: Den angivna filen är inte i rätt format.

source: Unable to load the specified file.
sv: Den angivna filen kan inte läsas in.

source: The specified file does not exist.
sv: Den angivna filen finns inte.

source: Database Servers
sv: Databasservrar

source: Export Servers
sv: Exportera servrar

source: The selected servers were exported successfully.
sv: De valda servrarna exporterades framgångsrikt.

source: Export Error
sv: Exportfel

source: The selected servers were imported successfully.
sv: De valda servrarna importerades framgångsrikt.

source: The existing server groups and servers were removed, and the selected servers were imported successfully.
sv: De befintliga servergrupperna och servrarna togs bort och de valda servrarna importerades framgångsrikt.

source: Import Servers
sv: Importera servrar

source: Import error
sv: Fel vid import

source: The following servers will be imported. Click the Finish button to complete the import process.
sv: Följande servrar kommer att importeras. Klicka på knappen Finish för att slutföra importprocessen.

source: All existing server groups and servers will be removed before the servers above are imported. On a successful import process, the object explorer will be refreshed.
sv: Alla befintliga servergrupper och servrar kommer att tas bort innan servrarna ovan importeras. Efter en lyckad importprocess kommer objektutforskaren att uppdateras.

source: On a successful import process, the object explorer will be refreshed.
sv: Efter en lyckad importprocess kommer objektutforskaren att uppdateras.

source: Error while fetching Server Groups and Servers.
sv: Fel vid hämtning av servergrupper och servrar.

source: Select the Server Groups/Servers to import/export:
sv: Välj de servergrupper/servrar som ska importeras/exporteras:

source: Supports only JSON format.
sv: Stöder endast JSON-format.

source: Remove all the existing servers?
sv: Ta bort alla befintliga servrar?

source: If this option is turned on then pgAdmin will remove all the existing database servers and then import the selected servers. This setting is applicable only while importing the servers.
sv: Om det här alternativet är aktiverat kommer pgAdmin att ta bort alla befintliga databasservrar och sedan importera de valda servrarna. Denna inställning är endast tillämplig vid import av servrarna.

source: Import/Export Servers...
sv: Import/Export av servrar...

source: Maintenance
sv: Underhåll

source: on database '{0}'
sv: på databas '{0}'

source: on constraint '{0}/{1}/{2}/{3}'
sv: på begränsningen '{0}/{1}/{2}/{3}'

source: on index '{0}/{1}/{2}/{3}'
sv: på index '{0}/{1}/{2}/{3}'

source: on table '{0}/{1}/{2}'
sv: på tabellen '{0}/{1}/{2}'

source: on schema '{0}/{1}'
sv: på schema '{0}/{1}'

source: {0} {1} of server {2}
sv: {0} {1} för servern {2}

source: Maintenance job created.
sv: Underhållsjobb skapat.

source: Maintenance...
sv: Underhåll...

source: Please select any database from the object explorer to do Maintenance.
sv: Välj valfri databas från objektutforskaren för att göra underhåll.

source: Maintenance error
sv: Underhållsfel

source: Maintenance job creation failed. Databases with = symbols in the name cannot be maintained using this utility.
sv: Skapandet av underhållsjobbet misslyckades. Databaser med =-symboler i namnet kan inte underhållas med hjälp av detta verktyg.

source: ONLY DATABASE STATS
sv: ENDAST DATABASSTATISTIK

source: Sizes should be specified as a string containing the numerical size followed by any one of the following memory units: kB (kilobytes), MB (megabytes), GB (gigabytes), or TB (terabytes)
sv: Storlekar ska anges som en sträng som innehåller den numeriska storleken följt av någon av följande minnesenheter: kB (kilobyte), MB (megabyte), GB (gigabyte) eller TB (terabyte)

source: This option is enabled only when the database is selected in the object explorer.
sv: Detta alternativ är endast aktiverat när databasen är markerad i objektutforskaren.

source: Maintenance operation
sv: Underhållsarbete

source: Verbose Messages
sv: Verbose-meddelanden

source: PSQL utility not found. Specify the valid binary path in the preferences for the appropriate server version, or select "Set as default" to use an existing binary path.
sv: PSQL-verktyget hittades inte. Ange den giltiga binära sökvägen i inställningarna för den aktuella serverversionen eller välj "Ange som standard" om du vill använda en befintlig binär sökväg.

source: Connection terminated, To create new connection please open another psql tool.
sv: Connection terminated, För att skapa en ny anslutning, öppna ett annat psql-verktyg.

source: Invalid session.
sv: Ogiltig session.

source: Please select a database from the object explorer to access Pql Tool.
sv: Välj en databas från objektutforskaren för att komma åt Pql Tool.

source: PSQL Error
sv: PSQL-fel

source: Please select a server/database object.
sv: Välj ett server-/databasobjekt.

source: Clipboard write permission required
sv: Skrivbehörighet för urklipp krävs

source: To copy data from PSQL terminal, Clipboard write permission required.
sv: För att kopiera data från PSQL-terminalen krävs skrivbehörighet för Clipboard.

source: Clipboard read permission required
sv: Läsbehörighet för urklipp krävs

source: To paste data on the PSQL terminal, Clipboard read permission required.
sv: För att klistra in data på PSQL-terminalen krävs lästillstånd för Clipboard.

source: Restoring backup on the server '{0}'
sv: Återställer säkerhetskopian på servern '{0}'

source: Restoring backup on the server
sv: Återställning av säkerhetskopia på servern

source: File could not be found.
sv: Filen kunde inte hittas.

source: Restore...
sv: Återställ...

source: Please select any schema or table from the object explorer to Restore data.
sv: Välj ett schema eller en tabell från objektutforskaren för att återställa data.

source: Restore Error
sv: Återställ fel

source: Restore (${pgBrowser.Nodes[data._type].label}: ${data.label})
sv: Återställ (${pgBrowser.Nodes[data._type].label}: ${data.label})

source: Only schema
sv: Endast schema

source: Miscellaneous / Behavior
sv: Övrigt / Beteende

source: Exit on error
sv: Avsluta vid fel

source: Custom or tar
sv: Anpassad eller tar

source: Clean before restore
sv: Rengör innan du återställer

source: Single transaction
sv: Enstaka transaktion

source: No data for failed tables
sv: Inga data för misslyckade tabeller

source: Comparing objects...
sv: Jämförelse av objekt...

source: Ignore Whitespace
sv: Ignorera blanksteg

source: Set ignore whitespace on or off by default in the drop-down menu near the Compare button in the Schema Diff tab.
sv: Ange ignorera blanksteg på eller av som standard i rullgardinsmenyn nära Jämför-knappen på fliken Schema Diff.

source: Ignore Owner
sv: Ignorera ägaren

source: Set ignore owner on or off by default in the drop-down menu near the Compare button in the Schema Diff tab.
sv: Ställ in ignore owner på eller av som standard i rullgardinsmenyn nära Jämför-knappen på fliken Schema Diff.

source: Ignore Tablespace
sv: Ignorera tabellutrymme

source: Set ignore tablespace on or off by default in the drop-down menu near the Compare button in the Schema Diff tab.
sv: Ange ignorera tablespace på eller av som standard i rullgardinsmenyn nära Jämför-knappen på fliken Schema Diff.

source: Ignore Grants/Revoke
sv: Ignorera bidrag/återkalla

source: Set ignore grants/revoke on or off by default in the drop-down menu near the Compare button in the Schema Diff tab.
sv: Ange ignorera beviljanden/återkallanden på eller av som standard i rullgardinsmenyn nära Jämför-knappen på fliken Schema Diff.

source: Selected object is not supported for DDL comparison.
sv: Det valda objektet stöds inte för DDL-jämförelse.

source: Server(s) disconnected.
sv: Server(s) frånkopplad(e).

source: Schema diff does not support the comparison between Postgres Server and EDB Postgres Advanced Server.
sv: Schema diff stöder inte jämförelsen mellan Postgres Server och EDB Postgres Advanced Server.

source: Source and Target database server must be of the same major version.
sv: Käll- och måldatabasservern måste vara av samma huvudversion.

source: Comparing {0}
sv: Jämförelse {0}

source: Database Objects
sv: Databasobjekt

source: Comparing {0}
sv: Jämförelse {0}

source: Comparing {0} of schema '{1}'
sv: Jämförelse av {0} i schema '{1}'

source: Source Only
sv: Endast källa

source: Target Only
sv: Endast mål

source: Identical
sv: Identiska

source: Different
sv: Annat

source: Ignore Grant/Revoke
sv: Ignorera beviljande/återkallande

source: No difference found
sv: Ingen skillnad konstaterad

source: Loading result grid...
sv: Läser in resultattabell...

source: DDL Comparision
sv: DDL-jämförelse

source: Source
sv: Källa

source: Difference
sv: Skillnad

source: Compare
sv: Jämför

source: Generate Script
sv: Generera skript

source: Unable to get the response text.
sv: Det går inte att få fram svarstexten.

source: Selection Error
sv: Fel vid urval

source: Please select the different source and target.
sv: Välj olika källa och mål.

source: (this may take a few minutes)... ${Math.round(res.diff_percentage)} %
sv: (detta kan ta några minuter) ... ${Math.round(res.diff_percentage)} %

source: Generating script...
sv: Genererar skript...

source: -- This script was generated by the Schema Diff utility in pgAdmin 4.
sv: -- Detta skript skapades av verktyget Schema Diff i pgAdmin 4.

source: -- For the circular dependencies, the order in which Schema Diff writes the objects is not very sophisticated
sv: -- För de cirkulära beroendena är den ordning i vilken Schema Diff skriver objekten inte särskilt sofistikerad

source: -- and may require manual changes to the script to ensure changes are applied in the correct order.
sv: -- och kan kräva manuella ändringar av skriptet för att säkerställa att ändringarna tillämpas i rätt ordning.

source: -- Please report an issue for any failure with the reproduction steps.
sv: -- Rapportera ett problem om du inte lyckas med reproduktionsstegen.

source: Generate script error
sv: Generera fel i skriptet

source: Error in connect database ${error.response.data}
sv: Fel vid anslutning av databas ${error.response.data}

source: Error in connect server ${error.response.data}
sv: Fel vid anslutning till server ${error.response.data}

source: Select Source
sv: Välj källa

source: Select Target
sv: Välj mål

source: Source and Target database server must be of the same major version.
sv: Käll- och måldatabasservern måste vara av samma huvudversion.

source: Database Compare:
sv: Databasjämförelse:

source: Select the server and database for the source and target and Click
sv: Välj server och databas för källan och målet och klicka på

source: Compare.
sv: Jämför.

source: Schema Compare:
sv: Schema jämför:

source: Select the server, database and schema for the source and target and Click
sv: Välj server, databas och schema för källan och målet och klicka på

source: Note:
sv: Anteckning:

source: The dependencies will not be resolved in the Schema comparison.
sv: Beroendena kommer inte att lösas i Schema-jämförelsen.

source: Error in schema diff initialize ${err.response.data}
sv: Fel i schema diff initialisera ${err.response.data}

source: Object name
sv: Objektets namn

source: Object path
sv: Objektets väg

source: Locating...
sv: Lokaliserar...

source: Unable to locate this object in the browser.
sv: Det går inte att hitta det här objektet i webbläsaren.

source: Searching....
sv: Sökning....

source: All types
sv: Alla typer

source: Type at least 3 characters
sv: Skriv minst 3 tecken

source: Please select a database from the object explorer to search the database objects.
sv: Välj en databas från objektutforskaren för att söka i databasobjekten.

source: Search Objects -
sv: Sök objekt -

source: Transaction status check failed.
sv: Kontrollen av transaktionsstatus misslyckades.

source: Query tool
sv: Frågeverktyg

source: ******* Error *******
sv: ******* Fel *******

source: No primary key found for this object, so unable to save records.
sv: Ingen primärnyckel hittades för detta objekt, så det går inte att spara poster.

source: Either transaction object or session object not found.
sv: Antingen transaktionsobjekt eller sessionsobjekt hittades inte.

source: Could not find the required parameter (query).
sv: Kunde inte hitta den nödvändiga parametern (query).

source: This feature has not been implemented for object type '{0}'.
sv: Denna funktion har inte implementerats för objekttypen '{0}'.

source: The specified object could not be found.
sv: Det angivna objektet kunde inte hittas.

source: Data cannot be saved for the current object.
sv: Det går inte att spara data för det aktuella objektet.

source: Resultset is not updatable.
sv: Resultset är inte uppdaterbart.

source: Please select a database from the object explorer to access Query Tool.
sv: Välj en databas från objektutforskaren för att komma åt Query Tool.

source: First 100 Rows
sv: Första 100 raderna

source: Last 100 Rows
sv: De senaste 100 raderna

source: View/Edit Data
sv: Visa/redigera data

source: Query Tool Error
sv: Fel i frågeverktyget

source: Query tool launch error
sv: Fel vid start av frågeverktyg

source: Please allow pop-ups for this site to perform the desired action. If the main window of pgAdmin is closed then close this window and open a new pgAdmin session.
sv: Tillåt popup-fönster för att den här webbplatsen ska kunna utföra önskad åtgärd. Om huvudfönstret i pgAdmin är stängt stänger du det här fönstret och öppnar en ny pgAdmin-session.

source: Data filter can not be empty.
sv: Datafiltret får inte vara tomt.

source: Data Grid Error
sv: Fel i datagalleriet

source: File -
sv: Fil -

source: View/Edit Data -
sv: Visa/redigera data -

source: Query Tool -
sv: Frågeverktyg -

source: Database moved/renamed
sv: Databas flyttad/omdöpts

source: An unexpected error occurred - ensure you are logged into the application.
sv: Ett oväntat fel inträffade - kontrollera att du är inloggad i programmet.

source: Query History
sv: Frågans historia

source: Scratch Pad
sv: Skraplåda

source: Data Output
sv: Datautmatning

source: Notifications
sv: Aviseringar

source: Not Connected
sv: Inte uppkopplad

source: -- Query text not stored as it exceeds maximum length of ${MAX_QUERY_LENGTH}
sv: -- Frågetexten lagras inte eftersom den överskrider maximal längd på ${MAX_QUERY_LENGTH}

source: Connection Warning
sv: Varning för anslutning
