Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: General Purpose SSD (gp3)
sv: SSD för allmänt ändamål (gp3)

source: General Purpose SSD (gp2)
sv: SSD för allmänt ändamål (gp2)

source: Provisioned IOPS SSD (io1)
sv: Tillhandahållna IOPS SSD (io1)

source: Magnetic
sv: Magnetisk

source: Size in GiB.
sv: Storlek i GiB.

source: Allocated storage should be between 20 - 65536 GiB.
sv: Tilldelad lagring bör vara mellan 20 - 65536 GiB.

source: Allocated storage should be between 100 - 65536 GiB.
sv: Tilldelad lagring bör vara mellan 100 - 65536 GiB.

source: Allocated storage should be between 5 - 3072 GiB.
sv: Tilldelad lagring bör vara mellan 5 - 3072 GiB.

source: Creates a standby in a different Availability Zone (AZ) to provide data redundancy, eliminate I/O freezes, and minimize latency spikes during system backups.
sv: Skapar en standby i en annan AZ (Availability Zone) för att tillhandahålla dataredundans, eliminera I/O-frysningar och minimera latensökningar under säkerhetskopiering av systemet.

source: Error while verifying Microsoft Azure: ${error}
sv: Fel vid verifiering av Microsoft Azure: ${error}

source: Error while checking server name availability with Microsoft Azure: ${error.response.data.errormsg}
sv: Fel vid kontroll av servernamnets tillgänglighet med Microsoft Azure: ${error.response.data.errormsg}

source: Resource group
sv: Resursgrupp

source: Availability zone
sv: Tillgänglighetszon

source: Azure Tenant ID is required for Azure interactive authentication.
sv: Azure Tenant ID krävs för interaktiv Azure-autentisering.

source: Authenticate via
sv: Autentisera via

source: Interactive Browser
sv: Interaktiv webbläsare

source: Azure CLI will use the currently logged in identity through the Azure CLI on the local machine. Interactive Browser will open a browser window to authenticate a user interactively.
sv: Azure CLI använder den aktuella inloggade identiteten via Azure CLI på den lokala maskinen. Interactive Browser öppnar ett webbläsarfönster för att autentisera en användare interaktivt.

source: Azure tenant id
sv: Azure hyresgäst-ID

source: Enter the Azure tenant ID against which the user is authenticated.
sv: Ange det Azure tenant ID som användaren autentiseras mot.

source: Click here to authenticate yourself to Microsoft Azure
sv: Klicka här för att autentisera dig till Microsoft Azure

source: After clicking the button above you will be redirected to the Microsoft Azure authentication page in a new browser tab if the Interactive Browser option is selected.
sv: När du har klickat på knappen ovan kommer du att omdirigeras till Microsoft Azure-autentiseringssidan i en ny webbläsarflik om alternativet Interactive Browser är valt.

source: General Purpose (2-64 vCores)
sv: Allmänt ändamål (2-64 vCores)

source: Memory Optimized (2-64 vCores)
sv: Minnesoptimerad (2-64 vCores)

source: Storage Size
sv: Förvaringsstorlek

source: The Admin username must be between 1-63 characters long, and must only contain alphabetic characters and numbers.
sv: Admin-användarnamnet måste vara mellan 1-63 tecken långt och får endast innehålla alfabetiska tecken och siffror.

source: Specified Admin username is not allowed.
sv: Angivet Admin-användarnamn är inte tillåtet.

source: The password must be 8-128 characters long and must contain characters from three of the following categories - English uppercase letters, English lowercase letters, numbers (0-9), and non-alphanumeric characters (!, $, #, %, etc.)
sv: Lösenordet måste vara 8-128 tecken långt och innehålla tecken från tre av följande kategorier: engelska versaler, engelska gemener, siffror (0-9) och icke-alfanumeriska tecken (!, $, #, %, etc.)

source: Admin username
sv: Användarnamn för administratör

source: The admin username must be 1-63 characters long and can only contain characters, numbers and the underscore character. The username cannot be "azure_superuser", "azure_pg_admin", "admin", "administrator", "root", "guest", "public", or start with "pg_".
sv: Administratörens användarnamn måste vara 1-63 tecken långt och får endast innehålla tecken, siffror och understreck. Användarnamnet kan inte vara "azure_superuser", "azure_pg_admin", "admin", "administrator", "root", "guest", "public" eller börja med "pg_".

source: The password must be 8-128 characters long and must contain characters from three of the following categories - English uppercase letters, English lowercase letters, numbers (0-9), and non-alphanumeric characters (!, $, #, %, etc.), and cannot contain all or part of the login name
sv: Lösenordet måste vara 8-128 tecken långt och måste innehålla tecken från tre av följande kategorier - engelska versaler, engelska gemener, siffror (0-9) och icke-alfanumeriska tecken (!, $, #, % osv.) och får inte innehålla hela eller delar av inloggningsnamnet

source: List of IP addresses or range of IP addresses (start IP Address - end IP address) from which inbound traffic should be accepted. Add multiple IP addresses/ranges separated with commas, for example: "192.168.0.50, 192.168.0.100 - 192.168.0.200"
sv: Lista över IP-adresser eller intervall av IP-adresser (start-IP-adress - slut-IP-adress) från vilka inkommande trafik ska accepteras. Lägg till flera IP-adresser/intervall åtskilda med kommatecken, t.ex: "192.168.0.50, 192.168.0.100 - 192.168.0.200"

source: Zone redundant high availability
sv: Zonredundant hög tillgänglighet

source: Zone redundant high availability deploys a standby replica in a different zone. The Burstable instance type does not support high availability.
sv: Zonredundant hög tillgänglighet distribuerar en standbyreplik i en annan zon. Instanstypen Burstable har inte stöd för hög tillgänglighet.

source: Cluster name
sv: Klustrets namn

source: Project Details
sv: Detaljerade uppgifter om tjänsten

source: Network Connectivity
sv: Nätverksanslutning

source: Subscription cannot be empty.
sv: Prenumeration får nte vara tomt.

source: Resource group cannot be empty.
sv: Resursgruppen får inte vara tom.

source: Location cannot be empty.
sv: Platsen får inte vara tom.

source: Availability zone cannot be empty.
sv: Tillgänglighetszonen får inte vara tom.

source: Database version cannot be empty.
sv: Databasversionen får inte vara tom.

source: Instance class cannot be empty.
sv: Instansklassen kan inte vara tom.

source: Instance type cannot be empty.
sv: Instanstyp kan inte vara tom.

source: Storage size cannot be empty.
sv: Lagringsutrymmet får inte vara tomt.

source: Public IP range cannot be empty.
sv: Offentligt IP-intervall får inte vara tomt.

source: Name must be more than 2 characters and must only contain lowercase letters, numbers, and hyphens
sv: Namnet måste innehålla mer än 2 tecken och får endast innehålla gemener, siffror och bindestreck

source: Cluster type
sv: Typ av kluster

source: Public IPs
sv: Offentliga IP-adresser

source: No. of Standby Replicas
sv: Antal standby-repliker

source: Instance series
sv: Serie av instanser

source: Instance size
sv: Instansens storlek

source: Volume type
sv: Typ av volym

source: Volume size
sv: Volymens storlek

source: Volume IOPS
sv: Volym IOPS

source: Disk Throughput
sv: Diskgenomströmning

source: Database Type
sv: Typ av databas

source: Database Version
sv: Databasversion

source: Please select number of stand by replicas.
sv: Välj antal reservreplikor.

source: Project
sv: Projekt

source: Single Node
sv: Enstaka nod

source: High Availability
sv: Hög tillgänglighet

source: Extreme High Availability
sv: Extrem hög tillgänglighet

source: Number of standby replicas
sv: Antal standby-repliker

source: Adding standby replicas will increase your number of CPUs, as well as your cost.
sv: Om du lägger till standby-repliker ökar antalet CPU:er och därmed kostnaden.

source: Cluster provider
sv: Klusterleverantör

source: Please select volume properties.
sv: Välj volymegenskaper.

source: Please enter the volume size in the range between 1 to 16384.
sv: Ange volymstorlek i intervallet mellan 1 och 16384.

source: Please enter the volume size in the range between 4 to 16384.
sv: Ange volymstorleken i intervallet mellan 4 och 16384.

source: Please enter volume IOPS.
sv: Ange volym IOPS.

source: Volume properties
sv: Volymegenskaper

source: Size (4-16,384 GiB)
sv: Storlek (4-16,384 GiB)

source: Size (1-16,384 GiB)
sv: Storlek (1-16 384 GiB)

source: Disk throughput
sv: Diskgenomströmning

source: Password must be 12 characters or more.
sv: Lösenordet måste innehålla 12 tecken eller mer.

source: Database type
sv: Typ av databas

source: Database password
sv: Lösenord för databas

source: IP address range for allowed inbound traffic, for example: 127.0.0.1/32. Add multiple IP addresses/ranges separated with commas. Leave blank for 0.0.0.0/0
sv: IP-adressintervall för tillåten inkommande trafik, till exempel: 127.0.0.1/32. Lägg till flera IP-adresser/intervall åtskilda med kommatecken. Lämna tomt för 0.0.0.0/0

source: Instance Type
sv: Typ av instans

source: Deploy Cloud Instance...
sv: Distribuera molninstans ...

source: Error while clearing cloud wizard data: ${error.response.data.errormsg}
sv: Fel vid rensning av data från molnguiden: ${error.response.data.errormsg}

source: Error while authentication: ${error}
sv: Fel vid autentisering: ${error}

source: Secondary availability zone
sv: Sekundär tillgänglighetszon

source: Client secret file
sv: Klientens hemliga fil

source: Select a client secrets file containing the client ID, client secret, and other OAuth 2.0 parameters for google authentication. Refer <a href="https://support.google.com/cloud/answer/6158849?hl=en#userconsent&zippy=%2Cuser-consent%2Cpublic-and-internal-applications" target="_blank">link</a> for creating client secret.
sv: Välj en fil med klienthemligheter som innehåller klient-ID, klienthemlighet och andra OAuth 2.0-parametrar för Google-autentisering. Se <a href="https://support.google.com/cloud/answer/6158849?hl=en#userconsent&zippy=%2Cuser-consent%2Cpublic-and-internal-applications" target="_blank">länk</a> för att skapa klienthemlighet.

source: Click here to authenticate yourself to Google
sv: Klicka här för att autentisera dig hos Google

source: After clicking the button above you will be redirected to the Google authentication page in a new browser tab.
sv: När du har klickat på knappen ovan kommer du att omdirigeras till Googles autentiseringssida i en ny webbläsarflik.

source: Shared core
sv: Gemensam kärna

source: High Memory
sv: Högt minne

source: HDD
sv: HÅRDDISK

source: Storage capacity
sv: Lagringskapacitet

source: Size in GB.
sv: Storlek i GB.

source: Please enter the value between 10 and 65,536.
sv: Ange ett värde mellan 10 och 65.536.

source: High availability?
sv: Hög tillgänglighet?

source: Please select Secondary availability zone different than primary.
sv: Välj sekundär tillgänglighetszon som skiljer sig från den primära.

source: Admin username for your Google Cloud Sql PostgreSQL instance.
sv: Admin-användarnamn för din Google Cloud Sql PostgreSQL-instans.

source: Set a password for the default admin user "postgres".
sv: Ange ett lösenord för standardadministratörsanvändaren "postgres".

source: Name must only contain lowercase letters, numbers, and hyphens.Should start with a letter and must be 97 characters or less
sv: Namnet får endast innehålla gemener, siffror och bindestreck, ska börja med en bokstav och får inte vara längre än 97 tecken

source: Deployment on {0} is started for instance {1}.
sv: Driftsättning på {0} har påbörjats för instans {1}.

source: Cloud Deployment
sv: Driftsättning i molnet

source: No dependency information is available for the selected object.
sv: Ingen information om beroenden finns tillgänglig för det valda objektet.

source: No dependent information is available for the selected object.
sv: Det finns ingen beroende information tillgänglig för det valda objektet.

source: Maximum file upload size (MB)
sv: Maximal storlek för filsändning (MB)

source: Last directory visited
sv: Senast besökta katalog

source: Last storage
sv: Senaste lagring

source: File dialog view
sv: Dialogvy för filer

source: Grid
sv: Rutnät

source: Show hidden files and folders?
sv: Visa dolda filer och mappar?

source: File type not supported
sv: Filtypen stöds inte

source: Error: {0}
sv: Felmeddelande: {0}

source: Not allowed
sv: Inte tillåten

source: Select File
sv: Välj fil

source: Select Folder
sv: Välj mapp

source: Create File
sv: Skapa fil

source: '{0}' file does not exist.
sv: filen '{0}' finns inte.

source: Permission denied
sv: Åtkomst nekades

source: Access denied ({0})
sv: Åtkomst nekad ({0})

source: There was an error renaming the file:
sv: Det uppstod ett fel när filen döptes om:

source: There was an error deleting the file:
sv: Det uppstod ett fel vid borttagningen av filen:

source: There was an error adding the file:
sv: Det uppstod ett fel när filen lades till:

source: Save File
sv: Spara fil

source: Open File
sv: Öppna fil

source: Are you sure you want to delete this file/folder?
sv: Är du säker på att du vill ta bort den här filen/mappen?

source: Are you sure you want to replace this file?
sv: Är du säker på att du vill ersätta den här filen?

source: Select
sv: Välj

source: Open
sv: Öppna

source: My Storage
sv: Min lagring

source: Home
sv: Hem

source: Go Back
sv: Gå tillbaka

source: Search
sv: Sök

source: Download
sv: Hämta ner

source: New Folder
sv: Ny mapp

source: Rename
sv: Byt namn

source: Delete
sv: Ta bort

source: Upload
sv: Skicka upp

source: List View
sv: Listvy

source: Show Hidden Files
sv: Visa dolda filer

source: All Files
sv: Alla filer

source: No files/folders found
sv: Inga filer/mappar hittades

source: Date Modified
sv: Modifierad datum

source: Remove from list
sv: Ta bort från listan

source: Drop files here, or click to select files.
sv: Släpp filer här, eller klicka för att välja filer.

source: The file size limit (per file) is %s MB.
sv: Gränsen för filstorlek (per fil) är %s MB.

source: The master password is not set.
sv: Huvudlösenordet är inte inställt.

source: This URL cannot be requested directly.
sv: Denna URL kan inte begäras direkt.

source: Existing Server (Optional)
sv: Befintlig server (valfritt)

source: Server Name
sv: Servernamn

source: Database must be specified.
sv: Databasen måste anges.

source: User must be specified.
sv: Användaren måste anges.

source: Connection to pgAdmin server has been lost.
sv: Anslutningen till pgAdmin-servern har gått förlorad.

source: Connect to server
sv: Anslut till server

source: Connect & Open Query Tool
sv: Anslut och öppna frågeverktyg

source: Connect & Open PSQL
sv: Ansluta och öppna PSQL

source: Default Workspace
sv: Standardarbetsyta

source: Query Tool Workspace
sv: Arbetsyta för frågeverktyg

source: PSQL Tool Workspace
sv: PSQL-verktygets arbetsyta

source: Schema Diff Workspace
sv: Schema Diff arbetsyta

source: Preferences
sv: Inställningar

source: Welcome to the Query Tool Workspace!
sv: Välkommen till arbetsytan för frågeverktyget!

source: The Query Tool is a robust and versatile environment designed for executing SQL commands and reviewing result sets efficiently.
sv: Query Tool är en robust och mångsidig miljö som är utformad för att utföra SQL-kommandon och granska resultatuppsättningar på ett effektivt sätt.

source: In this workspace, you can seamlessly open and manage multiple query tabs, making it easier to organize your work. You can select the existing servers or create a completely new ad-hoc connection to any database server as needed.
sv: I den här arbetsytan kan du sömlöst öppna och hantera flera frågeflikar, vilket gör det lättare att organisera ditt arbete. Du kan välja de befintliga servrarna eller skapa en helt ny ad hoc-anslutning till valfri databasserver efter behov.

source: Welcome to the PSQL Workspace!
sv: Välkommen till PSQL-arbetsytan!

source: The PSQL tool allows users to connect to PostgreSQL or EDB Advanced server using the psql command line interface.
sv: PSQL-verktyget tillåter användare att ansluta till PostgreSQL eller EDB Advanced-servern med hjälp av psql-kommandoradsgränssnittet.

source: In this workspace, you can seamlessly open and manage multiple PSQL tabs, making it easier to organize your work. You can select the existing servers or create a completely new ad-hoc connection to any database server as needed.
sv: I den här arbetsytan kan du sömlöst öppna och hantera flera PSQL-flikar, vilket gör det lättare att organisera ditt arbete. Du kan välja de befintliga servrarna eller skapa en helt ny ad hoc-anslutning till valfri databasserver efter behov.

source: Let's connect to the server
sv: Låt oss ansluta till servern

source: label
sv: etikett

source: help_str
sv: hjälp_str

source: Object explorer refresh required
sv: Uppdatering av objektutforskaren krävs

source: An object explorer refresh is required. Do you wish to refresh it now?
sv: En uppdatering av objektutforskaren krävs. Vill du uppdatera den nu?

source: Later
sv: Senare

source: Refresh required
sv: Uppdatering krävs

source: A page refresh is required. Do you wish to refresh the page now?
sv: En uppdatering av sidan krävs. Vill du uppdatera sidan nu?

source: Layout changed
sv: Ändrad layout

source: Continue
sv: Fortsätt

source: Save
sv: Spara

source: Reset all preferences
sv: Återställ alla inställningar

source: This settings is to Show/Hide nodes in the object explorer.
sv: Denna inställning används för att visa/dölja noder i objektutforskaren.

source: Results grid
sv: Resultat rutnät

source: User Interface
sv: Användargränssnitt

source: Save & Reload
sv: Spara och läs om

source: Save & Reload Later
sv: Spara och läs om senare

source: Set as default
sv: Sätt som standard

source: Database Server
sv: Databas server

source: Binary Path
sv: Binär sökväg

source: Select folder
sv: Välj mapp

source: Select binary path...
sv: Välj binär väg...

source: Enter binary path...
sv: Gå in på den binära vägen...

source: Validate Path
sv: Validera sökväg

source: Path should not be empty.
sv: Sökvägen får inte vara tom.

source: Validate binary path
sv: Validera binär sökväg

source: Failed to validate binary path.
sv: Misslyckades med att validera binär sökväg.

source: Reset Layout
sv: Återställ layout

source: Setting stored
sv: Inställning lagrad

source: Dashboard
sv: Kontrollpanel

source: Dependencies
sv: Beroenden

source: Dependents
sv: Beroende

source: Quit pgAdmin 4
sv: Avsluta pgAdmin 4

source: Are you sure you want to quit the application?
sv: Är du säker på att du vill avsluta applikationen?

source: Connection to pgAdmin server has been lost
sv: Anslutningen till pgAdmin-servern har gått förlorad

source: Configuration required
sv: Konfiguration krävs

source: Preferences Error
sv: Inställningar Fel

source: Failed to load preference %s of module %s
sv: Misslyckades med att läsa in inställningen %s för modul %s

source: The file opened contains bidirectional Unicode characters which could be interpreted differently than what is displayed. If this is unexpected it is recommended that you review the text in an application that can display hidden Unicode characters before proceeding.
sv: Den öppnade filen innehåller dubbelriktade Unicode-tecken som kan tolkas annorlunda än vad som visas. Om detta är oväntat rekommenderar vi att du granskar texten i ett program som kan visa dolda Unicode-tecken innan du fortsätter.

source: The pasted text contains bidirectional Unicode characters which could be interpreted differently than what is displayed. If this is unexpected it is recommended that you review the text in an application that can display hidden Unicode characters before proceeding.
sv: Den inklistrade texten innehåller dubbelriktade Unicode-tecken som kan tolkas på ett annat sätt än vad som visas. Om detta är oväntat rekommenderar vi att du granskar texten i ett program som kan visa dolda Unicode-tecken innan du fortsätter.

source: Trojan Source Warning
sv: Varning för trojansk källa

source: Select the user that will take ownership of the shared servers created by <b></b>. <b></b> shared servers are currently owned by this user. </br></br> Clicking on the “Change” button will either change ownership if a user is selected or delete any shared servers if no user is selected. There is no way to reverse this action.
sv: Välj den användare som ska ta över ägandet av de delade servrar som skapats av <b></b>. <b></b> delade servrar ägs för närvarande av den här användaren. </br></br> Om du klickar på knappen "Ändra" ändras antingen ägandet om en användare har valts eller så raderas alla delade servrar om ingen användare har valts. Det finns inget sätt att återkalla denna åtgärd.

source: The shared servers owned by <b></b> will be deleted. Do you wish to continue?
sv: De delade servrar som ägs av <b></b> kommer att raderas. Vill du fortsätta?

source: Current Password
sv: Nuvarande lösenord

source: New Password
sv: Nytt lösenord

source: Confirm Password
sv: Bekräfta lösenord

source: Don't save
sv: Spara inte

source: Please enter the SSH Tunnel password for the identity file '%s' to connect the server "%s"
sv: Ange lösenordet för SSH-tunneln för identitetsfilen '%s' för att ansluta till servern "%s"

source: Please enter the SSH Tunnel password for the user '%s' to connect the server "%s"
sv: Ange lösenordet för SSH-tunneln för användaren '%s' för att ansluta till servern "%s"

source: Save Password
sv: Spara lösenord

source: Please enter the password for the user '%s' to connect the server - "%s"
sv: Ange lösenordet för användaren '%s' för att ansluta till servern - "%s"

source: Please enter the password for the user to connect the server - "%s"
sv: Ange lösenordet för den användare som ska ansluta till servern - "%s"

source: Please enter your master password.
sv: Ange ditt huvudlösenord.

source: Saved passwords are encrypted using encryption key stored in ${keyringName}. Enter the master password for your existing pgAdmin saved passwords and they will be re-encrypted and saved when you click OK.
sv: Sparade lösenord krypteras med hjälp av krypteringsnyckeln som lagras i ${keyringName}. Ange huvudlösenordet för dina befintliga sparade pgAdmin-lösenord så krypteras de igen och sparas när du klickar på OK.

source: Please set a master password for pgAdmin.
sv: Ange ett huvudlösenord för pgAdmin.

source: This is required to unlock saved passwords and reconnect to the database server(s).
sv: Detta krävs för att låsa upp sparade lösenord och återansluta till databasservern(arna).

source: This will be used to secure and later unlock saved passwords and other credentials.
sv: Detta kommer att användas för att säkra och senare låsa upp sparade lösenord och andra referenser.

source: Reset Master Password
sv: Återställ huvudlösenord

source: Enter the name of the restore point to add
sv: Ange namnet på den återställningspunkt som ska läggas till

source: Title cannot be empty
sv: Titeln får inte vara tom

source: Migration failed
sv: Migreringen misslyckades

source: Passwords previously saved can not be re-encrypted using encryption key stored in the ${res.data.data.keyring_name}. due to ${error}
sv: Lösenord som tidigare sparats kan inte krypteras igen med hjälp av krypteringsnyckeln som lagrats i ${res.data.data.keyring_name}. på grund av ${error}

source: Migration successful
sv: Migrationen framgångsrik

source: Passwords previously saved are re-encrypted using encryption key stored in the ${res.data.data.keyring_name}.
sv: Lösenord som tidigare sparats krypteras på nytt med hjälp av krypteringsnyckeln som lagras i ${res.data.data.keyring_name}.

source: Set Master Password
sv: Ange huvudlösenord

source: Migrate Saved Passwords
sv: Migrera sparade lösenord

source: Unlock Saved Passwords
sv: Lås upp sparade lösenord
