Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Length/Precision should not be greater than:
sv: Längd/Precision bör inte vara större än:

source: Scale should not be less than:
sv: Skalan bör inte vara mindre än:

source: Scale should not be greater than:
sv: Skalan bör inte vara större än:

source: Expression value cannot be empty.
sv: Uttrycksvärdet kan inte vara tomt.

source: Increment value cannot be empty.
sv: Inkrementvärdet kan inte vara tomt.

source: Minimum value cannot be empty.
sv: Minsta värde kan inte vara tomt.

source: Maximum value cannot be empty.
sv: Maxvärdet får inte vara tomt.

source: Cache value cannot be empty.
sv: Cache-värdet får inte vara tomt.

source: Compound Trigger is dropped
sv: Compound Trigger togs bort

source: Could not find the compound trigger in the table.
sv: Det gick inte att hitta den sammansatta utlösaren i tabellen.

source: Compound Trigger
sv: Compound-avtryckare

source: Enable compound trigger
sv: Aktivera sammansatt trigger

source: Disable compound trigger
sv: Avaktivera sammansatt trigger

source: Enable Replica
sv: Aktivera replika

source: Enable Always
sv: Aktivera alltid

source: FOR Events
sv: FOR-händelser

source: Events
sv: Evenemang

source: When
sv: När

source: System trigger?
sv: Systemutlösare?

source: Specify at least one event.
sv: Ange minst en händelse.

source: -- Enter any global declarations below: -- BEFORE STATEMENT block. Delete if not required. BEFORE STATEMENT IS -- Enter any local declarations here BEGIN -- Enter any required code here END; -- AFTER STATEMENT block. Delete if not required. AFTER STATEMENT IS -- Enter any local declarations here BEGIN -- Enter any required code here END; -- BEFORE EACH ROW block. Delete if not required. BEFORE EACH ROW IS -- Enter any local declarations here BEGIN -- Enter any required code here END; -- AFTER EACH ROW block. Delete if not required. AFTER EACH ROW IS -- Enter any local declarations here BEGIN -- Enter any required code here END; -- INSTEAD OF EACH ROW block. Delete if not required. INSTEAD OF EACH ROW IS -- Enter any local declarations here BEGIN -- Enter any required code here END;
sv: -- Ange eventuella globala deklarationer nedan: -- FÖRE DEKLARATION block. Ta bort om det inte krävs. INNAN UTTALANDET ÄR -- Ange eventuella lokala deklarationer här BEGIN -- Ange eventuell nödvändig kod här SLUT; -- Block efter deklaration. Ta bort om det inte behövs. EFTER UTTALANDET ÄR -- Ange eventuella lokala deklarationer här BEGIN -- Ange eventuell nödvändig kod här SLUT; -- FÖRE VARJE RAD block. Ta bort om det inte behövs. FÖRE VARJE RAD ÄR -- Ange eventuella lokala deklarationer här BÖRJA -- Ange eventuell nödvändig kod här SLUT; -- Block efter varje rad. Ta bort om det inte behövs. EFTER VARJE RAD ÄR -- Ange eventuella lokala deklarationer här BÖRJA -- Ange eventuell nödvändig kod här SLUT; -- I STÄLLET FÖR VARJE RAD block. Ta bort om det inte behövs. ISTÄLLET FÖR VARJE RAD ÄR -- Ange eventuella lokala deklarationer här BEGIN -- Ange eventuell nödvändig kod här SLUT;

source: Constraints dropped.
sv: Begränsningar togs bort.

source: Check Constraints
sv: Kontrollera begränsningar

source: Could not find the check constraint.
sv: Kunde inte hitta kontrollbegränsningen.

source: Could not find the check constraint in the table.
sv: Det gick inte att hitta kontrollbegränsningen i tabellen.

source: The specified check constraint could not be found.
sv: Den angivna kontrollbegränsningen kunde inte hittas.

source: Check constraint dropped.
sv: Kontrollera att begränsningen togs bort.

source: Could not find the object on the server.
sv: Det gick inte att hitta objektet på servern.

source: Check constraint updated.
sv: Kontrollera begränsningen uppdaterad.

source: Validate check constraint
sv: Validera kontrollbegränsning

source: System check constraint?
sv: Systemkontrollbegränsning?

source: Don't validate?
sv: Validerar du inte?

source: Exclusion Constraints
sv: Begränsningar för uteslutning

source: Could not find the exclusion constraint in the table.
sv: Det gick inte att hitta uteslutningsbegränsningen i tabellen.

source: Could not find the exclusion constraint.
sv: Kunde inte hitta uteslutningsbegränsningen.

source: Could not find required parameter ({}).
sv: Kunde inte hitta den parameter som krävs ({}).

source: The specified exclusion constraint could not be found.
sv: Den angivna uteslutningsbegränsningen kunde inte hittas.

source: Exclusion constraint dropped.
sv: Uteslutningsbegränsningen har tagits bort.

source: Exclusion constraint
sv: Begränsning av uteslutning

source: Index size
sv: Indexets storlek

source: Exclusion constraint...
sv: Uteslutningsbegränsning...

source: Is expression
sv: Är uttryck

source: Col/Exp
sv: Kol/Exp

source: Operator class
sv: Operatörsklass

source: Select the operator class
sv: Välj operatörsklass

source: System exclusion constraint?
sv: Systemets uteslutningsbegränsning?

source: Tablespace
sv: Tabellutrymme

source: Access method
sv: Åtkomstmetod

source: Change access method?
sv: Ändra åtkomstmetod?

source: Changing access method will clear columns collection
sv: Byte av åtkomstmetod rensar kolumnsamlingen

source: Fill factor
sv: Fyllnadsfaktor

source: Deferrable?
sv: Uppskjutningsbar?

source: Deferred?
sv: Uppskjuten?

source: Constraint
sv: Begränsning

source: Columns/Expressions
sv: Kolumner/uttryck

source: Include columns
sv: Inkludera kolumner

source: Please specify columns for exclusion constraint.
sv: Ange kolumner för uteslutningsbegränsning.

source: Please specify covering index name.
sv: Ange namn på täckningsindex.

source: Could not find the foreign key.
sv: Kunde inte hitta den främmande nyckeln.

source: Foreign Keys
sv: Främmande nycklar

source: The specified foreign key could not be found.
sv: Den angivna främmande nyckeln kunde inte hittas.

source: Foreign key dropped.
sv: Främmande nyckel togs bort.

source: Foreign key updated.
sv: Främmande nyckel uppdaterad.

source: Could not find the foreign key constraint in the table.
sv: Det gick inte att hitta begränsningen för främmande nyckel i tabellen.

source: Foreign key
sv: Främmande nyckel

source: Foreign key...
sv: Främmande nyckel...

source: Validate foreign key
sv: Validera främmande nyckel

source: Local column
sv: Lokal spalt

source: References
sv: Referenser

source: Referencing
sv: Referenstagning

source: Local
sv: Lokal

source: Referenced
sv: Referenser

source: Referenced Table
sv: Refererad tabell

source: System foreign key?
sv: Systemets främmande nyckel?

source: Match type
sv: Typ av matchning

source: Validated?
sv: Validerad?

source: Covering index
sv: Omslagsindex

source: On update
sv: På uppdatering

source: On delete
sv: Vid borttagning

source: Please specify columns for Foreign key.
sv: Ange kolumner för Foreign key.

source: Index constraint
sv: Indexbegränsning

source: Primary Key
sv: Primärnyckel

source: Unique Constraint
sv: Unik begränsning

source: Could not find at least one required parameter ({}).
sv: Kunde inte hitta minst en obligatorisk parameter ({}).

source: The specified constraint could not be found.
sv: Den angivna begränsningen kunde inte hittas.

source: {0} dropped.
sv: {0} togs bort.

source: Could not find the {} in the table.
sv: Kunde inte hitta {} i tabellen.

source: primary key
sv: primär nyckel

source: unique key
sv: unik nyckel

source: Primary key
sv: Primär nyckel

source: Unique constraint
sv: Unik begränsning

source: Could not find the constraint in the table.
sv: Det gick inte att hitta begränsningen i tabellen.

source: System primary key?
sv: Systemets primära nyckel?

source: Name cannot be empty in edit mode.
sv: Namnet kan inte vara tomt i redigeringsläget.

source: Please specify columns for %s.
sv: Ange kolumner för %s.

source: NULLs not distinct?
sv: NULLs inte distinkta?

source: Indexes
sv: Index

source: You must provide one or more column to create index.
sv: Du måste ange en eller flera kolumner för att skapa index.

source: Index is dropped
sv: Index togs bort

source: Could not find the index in the table.
sv: Kunde inte hitta indexet i tabellen.

source: Size
sv: Storlek

source: Sort order
sv: Sorteringsordning

source: Gin pending list limit
sv: Gräns för Gin väntelista

source: This value is specified in kilobytes.
sv: Detta värde anges i kilobyte.

source: Pages per range
sv: Sidor per intervall

source: Number of table blocks that make up one block range for each entry of a BRIN index.
sv: Antal tabellblock som utgör ett blockintervall för varje post i ett BRIN-index.

source: Buffering
sv: Buffrar

source: On
sv: På

source: Off
sv: Av

source: Deduplicate items?
sv: Deduplicera objekt?

source: Fast update?
sv: Snabb uppdatering?

source: Select the column(s)
sv: Välj kolumn(er)

source: Access Method
sv: Åtkomstmetod

source: Warning
sv: Varning

source: Changing access method will clear columns collection. Do you want to continue?
sv: Byte av åtkomstmetod rensar kolumnsamlingen. Vill du fortsätta?

source: Unique?
sv: Unik?

source: Clustered?
sv: Klustrade?

source: Valid?
sv: Giltig?

source: Primary?
sv: Primär?

source: Concurrent build?
sv: Samtidig byggnation?

source: You must specify at least one column/expression.
sv: Du måste ange minst en kolumn/ett uttryck.

source: Partitions
sv: Skiljeväggar

source: Partition detached.
sv: Partitionen är fristående.

source: The specified partition could not be found.
sv: Den angivna partitionen kunde inte hittas.

source: Partition dropped
sv: Partitionen togs bort

source: Partition
sv: Område

source: Total Size
sv: Total storlek

source: Indexes size
sv: Indexets storlek

source: Table size
sv: Tabellstorlek

source: TOAST table size
sv: TOAST bordsstorlek

source: Tuple length
sv: Längd på tupel

source: Dead tuple length
sv: Längd på död tupel

source: Free space
sv: Ledigt utrymme

source: Truncate
sv: Korta av

source: Truncate Cascade
sv: Trunkerad kaskad

source: Reset Statistics
sv: Återställ statistik

source: Detach Partition
sv: Avlägsna partition

source: Detach
sv: Avskilj

source: Concurrently
sv: Samtidigt

source: Finalize
sv: Slutföra

source: Count Rows
sv: Räkna rader

source: Truncate Table
sv: Avkorta tabellen

source: Are you sure you want to truncate table <b>%s</b>?
sv: Är du säker på att du vill trunkera tabellen <b>%s</b>?

source: Reset statistics
sv: Återställ statistik

source: Are you sure you want to reset the statistics for table "%s"?
sv: Är du säker på att du vill återställa statistiken för tabell "%s"?

source: Detach Partition Concurrently
sv: Avlägsna partitionen samtidigt

source: Detach Partition Finalize
sv: Avlägsna partition Slutföra

source: Are you sure you want to detach the partition %s?
sv: Är du säker på att du vill ta bort partitionen %s?

source: Partitioned table?
sv: Partitionerad tabell?

source: System table?
sv: Systemtabell?

source: Inherited tables count
sv: Antal ärvda tabeller

source: Toast tuple target
sv: Toast tuple mål

source: Parallel workers
sv: Parallella arbetare

source: Has OIDs?
sv: Har OID:er?

source: Rows (estimated)
sv: Rader (uppskattade)

source: Rows (counted)
sv: Rader (räknade)

source: Is inherited?
sv: Är det ärftligt?

source: Partition Type
sv: Partitionstyp

source: Range
sv: Intervall

source: List
sv: Lista

source: Hash
sv: Hashvärde

source: Partition Keys
sv: Nycklar för partitionering

source: Partition Scheme
sv: Fördelningsschema

source: Partition table supports two types of keys:
sv: Partitionstabellen har stöd för två typer av nycklar:

source: Column:
sv: Kolumn:

source: User can select any column from the list of available columns.
sv: Användaren kan välja vilken kolumn som helst i listan över tillgängliga kolumner.

source: Expression:
sv: Uttryck:

source: User can specify expression to create partition key.
sv: Användaren kan ange ett uttryck för att skapa en partitionsnyckel.

source: Example:
sv: Exampel:

source: Let's say, we want to create a partition table based per year for the column 'saledate', having datatype 'date/timestamp', then we need to specify the expression as 'extract(YEAR from saledate)' as partition key.
sv: Låt oss säga att vi vill skapa en partitionstabell baserad per år för kolumnen "saledate", med datatyp "date/timestamp", då måste vi ange uttrycket som "extract(YEAR from saledate)" som partitionsnyckel.

source: Are you sure you wish to detach this partition?
sv: Är du säker på att du vill ta bort den här partitionen?

source: Create a table:
sv: Skapa en tabell:

source: User can create multiple partitions while creating new partitioned table. Operation switch is disabled in this scenario.
sv: Användaren kan skapa flera partitioner när han eller hon skapar en ny partitionerad tabell. Operation switch är inaktiverad i detta scenario.

source: Edit existing table:
sv: Redigera befintlig tabell:

source: User can create/attach/detach multiple partitions. In attach operation user can select table from the list of suitable tables to be attached.
sv: Användaren kan skapa/attachera/detachera flera partitioner. I attach-operationen kan användaren välja tabell från listan över lämpliga tabeller som ska bifogas.

source: Default:
sv: Standard:

source: The default partition can store rows that do not fall into any existing partition’s range or list.
sv: Standardpartitionen kan lagra rader som inte ingår i någon befintlig partitions intervall eller lista.

source: From/To/In input:
sv: Från/Till/In-ingång:

source: From/To/In input: Values for these fields must be quoted with single quote. For more than one partition key values must be comma(,) separated.
sv: Från/Till/In inmatning: Värdena för dessa fält måste anges med enkla citattecken. För mer än en partitionsnyckel måste värdena vara separerade med kommatecken(,).

source: Example: From/To:
sv: Exempel: Från/Till:

source: Enabled for range partition. Consider partitioned table with multiple keys of type Integer, then values should be specified like '100','200'.
sv: Aktiverad för intervallpartition. Tänk dig en partitionerad tabell med flera nycklar av typen Integer, då ska värden anges som "100", "200".

source: In:
sv: I:

source: Enabled for list partition. Values must be comma(,) separated and quoted with single quote.
sv: Aktiverad för listpartition. Värdena måste vara separerade med kommatecken(,) och citeras med enkla citattecken.

source: Enabled for hash partition.
sv: Aktiverad för hashpartition.

source: Storage settings
sv: Inställningar för lagring

source: Please specify at least one key for partitioned table.
sv: Ange minst en nyckel för partitionerad tabell.

source: RLS Policies
sv: RLS-policyer

source: policy dropped
sv: policy togs bort

source: Could not find the policy in the table.
sv: Kunde inte hitta policyn i tabellen.

source: Commands
sv: Kommandon

source: Using
sv: Använder

source: With check
sv: Med check

source: RLS policy expression
sv: Uttryck för RLS-policy

source: Using:
sv: Använder:

source: This expression will be added to queries that refer to the table if row level security is enabled. Rows for which the expression returns true will be visible. Any rows for which the expression returns false or null will not be visible to the user (in a SELECT), and will not be available for modification (in an UPDATE or DELETE). Such rows are silently suppressed; no error is reported.
sv: Detta uttryck läggs till i frågor som hänvisar till tabellen om säkerhet på radnivå är aktiverad. Rader för vilka uttrycket returnerar true kommer att vara synliga. Alla rader för vilka uttrycket returnerar false eller null kommer inte att vara synliga för användaren (i en SELECT) och kommer inte att vara tillgängliga för ändring (i en UPDATE eller DELETE). Sådana rader undertrycks i tysthet; inget fel rapporteras.

source: With check:
sv: Med check:

source: This expression will be used in INSERT and UPDATE queries against the table if row level security is enabled. Only rows for which the expression evaluates to true will be allowed. An error will be thrown if the expression evaluates to false or null for any of the records inserted or any of the records that result from the update.
sv: Detta uttryck kommer att användas i INSERT- och UPDATE-frågor mot tabellen om säkerhet på radnivå är aktiverad. Endast rader för vilka uttrycket utvärderas till true kommer att tillåtas. Ett fel kommer att uppstå om uttrycket utvärderas till false eller null för någon av de poster som infogas eller någon av de poster som blir resultatet av uppdateringen.

source: Rule dropped
sv: Regel togs bort

source: rule
sv: regel

source: Rule...
sv: Regel...

source: Rule enabled?
sv: Regel aktiverad?

source: Do instead?
sv: Gör istället?

source: Condition
sv: Villkor

source: System rule?
sv: Systemregel?

source: Key type
sv: Typ av nyckel

source: partition
sv: skiljevägg

source: Attach
sv: Bifoga

source: Create
sv: Skapa

source: From
sv: Från

source: To
sv: Till

source: In
sv: I

source: Remainder
sv: Resterande

source: For range partition From field cannot be empty.
sv: För intervallpartition får fältet From inte vara tomt.

source: For range partition To field cannot be empty.
sv: För intervallindelning kan fältet To inte vara tomt.

source: For list partition In field cannot be empty.
sv: För listpartition kan In-fältet inte vara tomt.

source: For hash partition Modulus field cannot be empty.
sv: För hashpartitioner kan Modulus-fältet inte vara tomt.

source: For hash partition Remainder field cannot be empty.
sv: För hashpartitioner får fältet Remainder inte vara tomt.

source: Table...
sv: Tabell...

source: Truncate Restart Identity
sv: Avkorta Starta om Identitet

source: ERD For Table
sv: ERD för tabell

source: Foreign Key
sv: Främmande nyckel

source: Unique
sv: Unik

source: Exclude
sv: Exkludera

source: With default values?
sv: Med standardvärden?

source: With constraints?
sv: Med begränsningar?

source: With indexes?
sv: Med index?

source: With storage?
sv: Med förvaring?

source: With comments?
sv: Med kommentarer?

source: With compression?
sv: Med kompression?

source: With generated?
sv: Med genererad?

source: With identity?
sv: Med identitet?

source: With statistics?
sv: Med statistik?

source: Select to inherit from...
sv: Välj att ärva från...

source: Check Policy?
sv: Kontrollera policy?

source: Please check if any policy exists. If no policy exists for the table, a default-deny policy is used, meaning that no rows are visible or can be modified by other users
sv: Kontrollera om det finns någon policy. Om det inte finns någon policy för tabellen används standardprincipen deny, vilket innebär att inga rader är synliga eller kan ändras av andra användare

source: Force RLS Policy?
sv: Tvinga fram RLS-policy?

source: Replica Identity
sv: Replik Identitet

source: Of type
sv: Av typ

source: Remove column definitions?
sv: Ta bort kolumndefinitioner?

source: Changing 'Of type' will remove column definitions.
sv: Om du ändrar "Av typ" kommer kolumndefinitionerna att tas bort.

source: Like
sv: Gilla

source: Null fraction
sv: Nollfraktion

source: Average width
sv: Genomsnittlig bredd

source: Distinct values
sv: Utmärkande värden

source: Most common values
sv: Vanligaste värdena

source: Most common frequencies
sv: Vanligaste frekvenserna

source: Histogram bounds
sv: Histogramgränser

source: Correlation
sv: Korrelation

source: Index scans
sv: Indexskanningar

source: Index tuples read
sv: Index-tupler läs

source: Index tuples fetched
sv: Index-tuplar hämtade

source: Index blocks read
sv: Indexblock lästa

source: Index blocks hit
sv: Indexblock träffas

source: Last index scan
sv: Senaste indexskanningen

source: Tree level
sv: Trädnivå

source: Root block no
sv: Rotblock nr

source: Internal pages
sv: Interna sidor

source: Leaf pages
sv: Bladsidor

source: Empty pages
sv: Tomma sidor

source: Deleted pages
sv: Raderade sidor

source: Average leaf density
sv: Genomsnittlig bladdensitet

source: Leaf fragmentation
sv: Fragmentering av blad

source: Index name
sv: Indexets namn

source: Table name
sv: Tabellens namn

source: Tuples inserted
sv: Tuples infogade

source: Tuples updated
sv: Tuples uppdaterade

source: Tuples deleted
sv: Tuples raderade

source: Tuples HOT updated
sv: Tuples HOT uppdaterad

source: Live tuples
sv: Levande tupler

source: Dead tuples
sv: Döda tupler

source: Last vacuum
sv: Sista vakuumet

source: Last autovacuum
sv: Sista autovacuum

source: Last analyze
sv: Senaste analysen

source: Last autoanalyze
sv: Senaste autoanalys

source: Last sequential scan
sv: Senaste sekventiella skanning

source: Vacuum counter
sv: Vakuumräknare

source: Autovacuum counter
sv: Autovakuum-räknare

source: Analyze counter
sv: Analysera räknare

source: Autoanalyze counter
sv: Autoanalysera räknaren

source: Sequential scans
sv: Sekventiella skanningar

source: Sequential tuples read
sv: Sekventiell läsning av tuples

source: Heap blocks read
sv: Heap-block läs

source: Heap blocks hit
sv: Stapel blockerar träff

source: Toast blocks read
sv: Toast block läs

source: Toast blocks hit
sv: Toast blockerar träff

source: Toast index blocks read
sv: Toast index block läs

source: Toast index blocks hit
sv: Toast index block block hit

source: Toast table size
sv: Toastbordets storlek

source: Tuple count
sv: Antal tuplar

source: Tuple percent
sv: Tuple procent

source: Dead tuple count
sv: Antal döda tupler

source: Dead tuple percent
sv: Död tuple procent

source: Free percent
sv: Ledigt procent

source: Triggers
sv: Utlösare

source: Could not find the specified trigger function
sv: Den angivna triggerfunktionen kunde inte hittas

source: Trigger is dropped
sv: Utlösaren togs bort

source: Could not find the trigger in the table.
sv: Det gick inte att hitta triggern i tabellen.

source: Trigger
sv: Utlösare

source: Trigger...
sv: Utlösare...

source: Constraint trigger?
sv: Utlösare för begränsning?

source: Fires
sv: Bränder

source: Old table
sv: Gammalt bord

source: Transition
sv: Övergång

source: New table
sv: Nytt bord

source: Trigger function cannot be empty.
sv: Utlösarfunktionen kan inte vara tom.

source: PostgreSQL Catalog
sv: PostgreSQL-katalog

source: pgAgent Job Scheduler
sv: pgAgent Schemaläggare för jobb

source: Types
sv: Typer

source: Could not find the type in the database.
sv: Typen kunde inte hittas i databasen.

source: Subtype must be defined for range types.
sv: Subtyp måste definieras för intervalltyper.

source: External types require both input and output conversion functions.
sv: Externa typer kräver både ingångs- och utgångskonverteringsfunktioner.

source: The specified type could not be found.
sv: Den angivna typen kunde inte hittas.

source: Type dropped
sv: Typ togs bort

source: Type...
sv: Typ...

source: Label
sv: Etikett

source: Subtype
sv: Subtyp

source: Range Type
sv: Intervalltyp

source: Subtype operator class
sv: Subtyp operatör klass

source: Canonical function
sv: Kanonisk funktion

source: Subtype diff function
sv: Subtyp diff-funktion

source: Subtype cannot be empty
sv: Subtyp kan inte vara tom

source: Required
sv: Obligatorisk

source: Input function
sv: Inmatningsfunktion

source: Output function
sv: Utgångsfunktion

source: Optional-1
sv: Valfritt-1

source: Receive function
sv: Mottagningsfunktion

source: Send function
sv: Skicka funktion

source: Typmod in function
sv: Typmod i funktion

source: Typmod out function
sv: Typmod ut funktion

source: Internal length
sv: Invändig längd

source: Variable?
sv: Variabel?

source: Default?
sv: Standard?

source: Analyze function
sv: Analysera funktion

source: Category type
sv: Kategori typ

source: Preferred?
sv: Företrädesvis?

source: Optional-2
sv: Valfritt-2

source: Element type
sv: Elementtyp

source: Delimiter
sv: Avgränsare

source: Alignment type
sv: Typ av uppriktning

source: Storage type
sv: Typ av förvaring
