Repository: pgadmin-org/pgadmin4
Catalog: web/pgadmin/translations/*/LC_MESSAGES/messages.po
Languages: sv

source: Unselect All
sv: Avmarkera alla

source: Retrieving data from the server...
sv: Hämtar data från servern...

source: Failed to retrieve data from the server.
sv: Misslyckades med att hämta data från servern.

source: The number of seconds between graph samples.
sv: Antal sekunder mellan grafprov.

source: Dashboards
sv: Instrumentpaneler

source: Session statistics refresh rate
sv: Uppdateringsfrekvens för sessionsstatistik

source: Transaction throughput refresh rate
sv: Transaktionsgenomströmning uppdateringsfrekvens

source: Tuples in refresh rate
sv: Tuples i uppdateringsfrekvens

source: Tuples out refresh rate
sv: Tuples ut uppdateringsfrekvens

source: Block I/O statistics refresh rate
sv: Uppdateringsfrekvens för block I/O-statistik

source: Handle & Process count statistics refresh rate
sv: Hantera & bearbeta statistik över antal uppdateringsfrekvens

source: Percentage of CPU time used by different process modes statistics refresh rate
sv: Procentuell andel av CPU-tiden som används av olika processlägen Uppdateringsfrekvens för statistik

source: Average load statistics refresh rate
sv: Uppdateringsfrekvens för genomsnittlig belastningsstatistik

source: CPU usage per process statistics refresh rate
sv: CPU-användning per process uppdateringsfrekvens för statistik

source: Memory usage statistics refresh rate
sv: Uppdateringsfrekvens för statistik över minnesanvändning

source: Swap memory usage statistics refresh rate
sv: Statistik över användning av swap-minne Uppdateringsfrekvens

source: Memory usage per process statistics refresh rate
sv: Minnesanvändning per process statistik uppdateringsfrekvens

source: I/O analysis statistics refresh rate
sv: Uppdateringsfrekvens för I/O-analysstatistik

source: Show activity?
sv: Visa aktivitet?

source: If set to True, activity will be displayed on dashboards.
sv: Om värdet True anges visas aktiviteten på instrumentpaneler.

source: Show state?
sv: Ska län/delstat visas?

source: If set to True, state tables will be displayed on dashboards.
sv: Om värdet True anges visas statstabeller på instrumentpaneler.

source: Long running query thresholds
sv: Tröskelvärden för långvariga frågor

source: Set the warning and alert threshold value to highlight the long-running queries on the dashboard.
sv: Ställ in tröskelvärdet för varning och larm för att markera långvariga frågor på instrumentpanelen.

source: Graphs
sv: Diagram

source: Show graph data points?
sv: Visa datapunkter i grafen?

source: If set to True, data points will be visible on graph lines.
sv: Om inställningen är True kommer datapunkterna att synas på diagramlinjerna.

source: Use different data point styles?
sv: Använda olika datapunktstilar?

source: If set to True, data points will be visible in a different style on each graph lines.
sv: Om inställningen är True visas datapunkterna i olika stil på varje graflinje.

source: Show mouse hover tooltip?
sv: Visa verktygstips för muspekare?

source: If set to True, tooltip will appear on mouse hover on the graph lines giving the data point details
sv: Om inställningen är True visas ett verktygstips när muspekaren rör sig över graflinjerna med information om datapunkterna

source: Chart line width
sv: Diagrammets linjebredd

source: Set the width of the lines on the line chart.
sv: Ställ in bredden på linjerna i linjediagrammet.

source: Server ID not specified.
sv: Server-ID inte angivet.

source: Failed
sv: Misslyckad

source: PGD replication lag refresh rate
sv: PGD replikering fördröjning uppdateringshastighet

source: Please connect to the selected {0} to view the table.
sv: Anslut till den valda {0} för att se tabellen.

source: Please connect to the selected {0} to view the graph.
sv: Anslut till den valda {0} för att visa diagrammet.

source: Backend type
sv: Typ av backend

source: Details
sv: Detaljer

source: Query started at
sv: Förfrågan startade på

source: Last state changed at
sv: Senast ändrat tillstånd vid

source: Terminate Session?
sv: Avsluta sessionen?

source: Are you sure you wish to terminate the session?
sv: Är du säker på att du vill avsluta sessionen?

source: Session terminated successfully.
sv: Sessionen avslutades framgångsrikt.

source: An error occurred whilst terminating the active query.
sv: Ett fel inträffade när den aktiva frågan avslutades.

source: Failed to perform the operation.
sv: Misslyckades med att utföra operationen.

source: Cancel Active Query?
sv: Avbryt aktiv fråga?

source: Are you sure you wish to cancel the active query?
sv: Är du säker på att du vill avbryta den aktiva förfrågan?

source: Active query cancelled successfully.
sv: Aktiv förfrågan avbröts framgångsrikt.

source: An error occurred whilst cancelling the active query.
sv: Ett fel inträffade när den aktiva förfrågan avbröts.

source: Cancel the active query
sv: Avbryt den aktiva frågan

source: Active sessions only
sv: Endast aktiva sessioner

source: Activity
sv: Aktivitet

source: Configuration
sv: Konfiguration

source: Logs
sv: Loggar

source: Summary
sv: Sammanfattning

source: Memory
sv: Minne

source: You cannot cancel background worker processes.
sv: Du kan inte avbryta bakgrundsarbetsprocesser.

source: You cannot terminate background worker processes.
sv: Du kan inte avsluta bakgrundsarbetsprocesser.

source: You are not allowed to cancel the main active session.
sv: Du får inte avbryta den aktiva huvudsessionen.

source: You are not allowed to terminate the main active session.
sv: Du får inte avbryta den aktiva huvudsessionen.

source: The session is already in idle state.
sv: Sessionen är redan i viloläge.

source: Category
sv: Kategori

source: Unit
sv: Enhet

source: Description
sv: Beskrivning

source: Failed to download the logs.
sv: Det gick inte att hämta ner loggarna.

source: View the log details
sv: Visa loggdetaljerna

source: Error Severity
sv: Felets allvarlighetsgrad

source: Log Prefix/Timestamp
sv: Loggens prefix/tidsstämpel

source: View the active session details
sv: Visa information om den aktiva sessionen

source: Transaction start
sv: Transaktionens start

source: Waiting
sv: Väntar

source: Wait event
sv: Vänta händelse

source: Blocking PIDs
sv: Blockering av PID:ar

source: Lock type
sv: Typ av lås

source: Target relation
sv: Målrelation

source: Page
sv: Sida

source: Tuple
sv: Tupel

source: vXID (target)
sv: vXID (mål)

source: XID (target)
sv: XID (mål)

source: Class
sv: Klass

source: Object ID
sv: Objekt-ID

source: vXID (owner)
sv: vXID (ägare)

source: Granted?
sv: Beviljas?

source: Prepared at
sv: Upprättad vid

source: Please connect to the selected server to view the dashboard.
sv: Anslut till den valda servern för att visa instrumentpanelen.

source: Loading dashboard...
sv: Läser in instrumentpanelen...

source: Loading logs...
sv: Läser in loggar...

source: Please enable the logging to view the server logs or check the log file is in place or not.
sv: Aktivera loggning för att visa serverloggar eller kontrollera om loggfilen finns på plats eller inte.

source: The system_stats extension is not installed. You can install the extension in a database using the "CREATE EXTENSION system_stats;" SQL command. Reload pgAdmin once it is installed.
sv: Tillägget system_stats är inte installerat. Du kan installera tillägget i en databas med hjälp av SQL-kommandot "CREATE EXTENSION system_stats;". Läs om pgAdmin när det har installerats.

source: Failed to verify the presence of system stats extension.
sv: Misslyckades med att verifiera förekomsten av systemstatistiktillägget.

source: Table based logs
sv: Tabellbaserade loggar

source: Log Format
sv: Loggformat

source: Tabular format?
sv: Tabulärformat?

source: Download logs
sv: Hämta ner loggar

source: Sessions
sv: Sessioner

source: Locks
sv: Lås

source: Prepared Transactions
sv: Förberedda transaktioner

source: Please connect to the selected server to view the graph.
sv: Anslut till den valda servern för att visa diagrammet.

source: An error occurred whilst rendering the graph.
sv: Ett fel inträffade vid rendering av grafen.

source: Not connected to the server or the connection to the server has been closed.
sv: Inte ansluten till servern eller anslutningen till servern har stängts.

source: Database sessions
sv: Databassessioner

source: Server sessions
sv: Server-sessioner

source: Transactions per second
sv: Transaktioner per sekund

source: Tuples in
sv: Tupler i

source: Tuples out
sv: Tuples ut

source: Error severity
sv: Felets allvarlighetsgrad

source: Log line prefix/timestamp
sv: Logglinjens prefix/tidsstämpel

source: Log
sv: Logg

source: Welcome
sv: Välkommen

source: Feature rich
sv: Funktionsrik

source: Maximises PostgreSQL
sv: Maximerar PostgreSQL

source: Open Source
sv: Öppen källkod

source: pgAdmin is an Open Source administration and management tool for the PostgreSQL database. It includes a graphical administration interface, an SQL query tool, a procedural code debugger and much more. The tool is designed to answer the needs of developers, DBAs and system administrators alike.
sv: pgAdmin är ett administrations- och hanteringsverktyg för PostgreSQL-databasen baserad på öppen källkod. Den innehåller ett grafiskt administrationsgränssnitt, ett SQL-frågeverktyg, en procedurkodfelsökare och mycket mer. Verktyget är utformat för att svara på behoven hos både utvecklare, DBA och systemadministratörer.

source: Quick Links
sv: Snabblänk

source: Add New Server
sv: Lägg till ny server

source: Configure pgAdmin
sv: Konfigurera pgAdmin

source: Getting Started
sv: Komma igång

source: PostgreSQL Documentation
sv: PostgreSQL-dokumentation

source: pgAdmin Website
sv: pgAdmin Webbplats

source: Community Support
sv: Gemenskapssupport

source: View details
sv: Visa detaljer

source: Client Addr
sv: Kundadress

source: Reply Time
sv: Svarstid

source: Active PID
sv: Aktiv PID

source: Replication Stats
sv: Replikeringsstatistik

source: Replication Slots
sv: Replikeringsplatser

source: Slot
sv: Tidslucka

source: Write lag
sv: Skriv fördröjning

source: Flush lag
sv: Spolning av fördröjning

source: Replay lag
sv: Uppspelningsfördröjning

source: Replay timestamp
sv: Tidsstämpel för uppspelning

source: Node
sv: Nod

source: Group
sv: Grupp

source: Peer state
sv: Motpartsstatus

source: Catchup state
sv: Upphämtningstillstånd

source: Leader type
sv: Typ av ledare

source: Leader
sv: Ledare

source: Voting?
sv: Röstning?

source: Voting for
sv: Röstar för

source: Replication lag (Time)
sv: Replikeringsfördröjning (tid)

source: Replication lag (Size)
sv: Replikeringsfördröjning (storlek)

source: Cluster nodes
sv: Klusternoder

source: Raft status
sv: Flottans status

source: Outgoing Replication
sv: Utgående replikering

source: Incoming Replication
sv: Inkommande replikering

source: Target
sv: Mål

source: Enabled
sv: Aktiverad

source: Receive LSN
sv: Ta emot LSN

source: Receive Commit LSN
sv: Mottagning Bekräftelse LSN

source: Last Replay LSN
sv: Sista reprisen LSN

source: Replay Timestamp
sv: Tidsstämpel för uppspelning

source: Target DB
sv: Mål DB

source: Usename
sv: Användarnamn

source: Restart LSN
sv: Starta om LSN

source: Confirmed Flush LSN
sv: Bekräftad Flush LSN

source: CPU usage
sv: CPU-användning

source: Load average
sv: Genomsnittlig belastning

source: Process CPU usage
sv: Process CPU-användning

source: Memory usage
sv: Använt minne

source: Memory bytes
sv: Byte minne

source: Swap memory
sv: Byt ut minne

source: Process memory usage
sv: Användning av processminne

source: File system
sv: Filsystem

source: File system type
sv: Typ av filsystem

source: Mount point
sv: Monteringspunkt

source: Drive letter
sv: Enhetsbokstav

source: Total space
sv: Totalt utrymme

source: Used space
sv: Använt utrymme

source: Total inodes
sv: Totalt antal inoder

source: Used inodes
sv: Använda inoder

source: Free inodes
sv: Lediga inoder

source: file_system
sv: fil_system

source: file_system_type
sv: fil_system_typ

source: mount_point
sv: monteringspunkt

source: Data transfer
sv: Dataöverföring

source: I/O operations count
sv: Antal I/O-operationer

source: Time spent in I/O operations
sv: Tidsåtgång för I/O-operationer

source: Host name
sv: Värdnamn

source: host_name
sv: värd_namn

source: Domain name
sv: Domännamn

source: Architecture
sv: Arkitektur

source: architecture
sv: arkitektur

source: Os up since seconds
sv: Os upp sedan sekunder

source: Vendor
sv: Säljare

source: vendor
sv: leverantör

source: description
sv: beskrivning

source: Model name
sv: Modellens namn

source: model_name
sv: modell_namn

source: No of cores
sv: Antal kärnor

source: Clock speed Hz
sv: Klockhastighet Hz

source: clock_speed_hz
sv: klocka_hastighet_hz

source: L1 dcache size
sv: L1 dcache-storlek

source: l1dcache_size
sv: l1dcache_storlek

source: L1 icache size
sv: L1 icache-storlek

source: l1icache_size
sv: l1icache_storlek

source: L2 cache size
sv: Storlek på L2-cache

source: l2cache_size
sv: l2cache_storlek

source: L3 cache size
sv: Storlek på L3-cache

source: l3cache_size
sv: l3cache_storlek

source: Process & handle count
sv: Processa och hantera antal

source: Total
sv: Totalt

source: Idle
sv: Sysslolös

source: Transactions
sv: Transaktioner

source: Commits
sv: Genomföranden

source: Inserts
sv: Inlägg

source: Updates
sv: Uppdateringar

source: Deletes
sv: Raderar

source: Returned
sv: Återlämnad

source: Reads
sv: Läsningar

source: Hits
sv: Träffar

source: Process
sv: Bearbeta

source: Online Help
sv: Hjälp online

source: PostgreSQL Website
sv: PostgreSQL webbplats

source: PostgreSQL Help Path
sv: PostgreSQL hjälpväg

source: Path to the PostgreSQL documentation. $VERSION$ will be replaced with the major.minor version number.
sv: Sökväg till PostgreSQL-dokumentationen. $VERSION$ kommer att ersättas med major.minor versionsnummer.

source: Miscellaneous
sv: Diverse

source: Theme
sv: Tema

source: Click the save button to apply the theme. Below is the preview of the theme.
sv: Klicka på spara-knappen för att använda temat. Nedan visas en förhandsgranskning av temat.

source: Classic
sv: Klassisk

source: Workspace
sv: Arbetsområde

source: Choose the layout that suits you best. pgAdmin offers two options: the Classic layout, a longstanding and familiar design, and the Workspace layout, which provides distraction free dedicated areas for the Query Tool, PSQL, and Schema Diff tools.
sv: Välj den layout som passar dig bäst. pgAdmin erbjuder två alternativ: Classic-layouten, som är en välbekant design sedan länge, och Workspace-layouten, som ger distraktionsfria områden för verktygen Query Tool, PSQL och Schema Diff.

source: Open the Query Tool/PSQL in their respective workspaces
sv: Öppna Query Tool/PSQL i deras respektive arbetsytor

source: This setting applies only when the layout is set to Workspace Layout. When set to True, all Query Tool/PSQL tabs will open in their respective workspaces. By default, this setting is False, meaning that Query Tool/PSQL tabs will open in the currently active workspace (either the default or the workspace selected at the time of opening)
sv: Denna inställning gäller endast när layouten är inställd på Workspace Layout. När inställningen är True öppnas alla flikar i Query Tool/PSQL i sina respektive arbetsytor. Som standard är denna inställning False, vilket innebär att flikarna i Query Tool/PSQL öppnas i den aktiva arbetsytan (antingen standard eller den arbetsyta som valts vid öppningstillfället)

source: Automatically open downloaded file?
sv: Öppna hämtad fil automatiskt?

source: This setting is applicable and visible only in desktop mode. When set to True, the downloaded file will automatically open in the system's default application associated with that file type.
sv: Denna inställning är endast tillämplig och synlig i skrivbordsläge. När den är inställd på True öppnas den hämtade filen öppnas automatiskt i systemets standardprogram applikation som är associerad med den filtypen.

source: Prompt for the download location?
sv: Fråga efter hämtningsplatsen?

source: This setting is applicable and visible only in desktop mode. When set to True, a prompt will appear after clicking the download button, allowing you to choose the download location
sv: Denna inställning är endast tillämplig och synlig i skrivbordsläget. När den är inställd på True visas en fråga efter att du klickat på hämtningsknappen, så att du kan välja hämtningsplats

source: Invalid binary path.
sv: Ogiltig binär sökväg.

source: Could not find a process with the specified ID.
sv: Kunde inte hitta en process med det angivna ID:t.

source: The process has already been started.
sv: Processen har redan påbörjats.

source: The process has already finished and cannot be restarted.
sv: Processen har redan avslutats och kan inte startas om.

source: Status for the background process '{0}' could not be loaded.
sv: Status för bakgrundsprocessen '{0}' kunde inte läsas in.

source: Unable to kill the background process '{0}'
sv: Det går inte att döda bakgrundsprocessen '{0}'

source: Cloud server deployment is pending
sv: Driftsättning av molnserver pågår

source: Failed Cloud Deployment.
sv: Misslyckad molndistribution.

source: Process started
sv: Processen påbörjad

source: Process completed
sv: Processen slutförd

source: Process terminated
sv: Processen avbruten

source: Process failed
sv: Processen misslyckades

source: Not started
sv: Ej påbörjad

source: Running...
sv: Kör...

source: Successfully completed.
sv: Framgångsrikt slutförd.

source: Failed (exit code: %s).
sv: Misslyckades (utgångskod: %s).

source: Terminated by user.
sv: Avslutad av användaren.

source: Terminating the process...
sv: Avslutar processen...

source: error
sv: fel

source: fatal
sv: dödlig

source: Running command
sv: Löpande kommando

source: Running query
sv: Löpande fråga

source: Storage Manager
sv: Lagringschef

source: Loading process logs...
sv: Läser in processloggar...

source: No logs available.
sv: Inga loggar tillgängliga.

source: Execution time
sv: Exekveringstid

source: seconds
sv: sekunder

source: Running
sv: Kör

source: Finished
sv: Avslutade

source: Terminated
sv: Avslutad

source: Terminating...
sv: Avslutar...

source: End Process
sv: Avsluta processen

source: Acknowledge and Remove
sv: Bekräfta och ta bort

source: Remove Processes
sv: Ta bort processer

source: Are you sure you want to remove the selected processes?
sv: Är du säker på att du vill ta bort de valda processerna?

source: Process Watcher - %s
sv: Processövervakare - %s

source: Time Taken (sec)
sv: Tidsåtgång (sek)

source: This URL cannot be called directly.
sv: Denna URL kan inte ringas direkt.

source: No cloud implementation.
sv: Ingen implementering i molnet.

source: forbidden
sv: förbjuden

source: Project not provided.
sv: Projektet har inte tillhandahållits.

source: Error retrieving providers.
sv: Fel vid hämtning av leverantörer.

source: Error retrieving regions.
sv: Regioner för felsökning.

source: Error retrieving projects.
sv: Fel vid hämtning av projekt.

source: Session has not created yet.
sv: Sessionen har inte skapats ännu.

source: Cloud Provider
sv: Molnleverantör

source: Credentials
sv: Inloggningsuppgifter

source: Cluster Type
sv: Typ av kluster

source: Instance Specification
sv: Specifikation av instans

source: Database Details
sv: Detaljer om databasen

source: Review
sv: Recension

source: Error while getting the host ip: ${error.response.data.errormsg}
sv: Fel vid hämtning av värd-IP: ${error.response.data.errormsg}

source: Error while saving cloud wizard data: ${error.response.data.errormsg}
sv: Fel vid lagring av data från molnguiden: ${error.response.data.errormsg}

source: Validating credentials...
sv: Validerar referenser...

source: Error while checking cloud credentials
sv: Fel vid kontroll av inloggningsuppgifter till molnet

source: Getting EDB BigAnimal verification URL...
sv: Få EDB BigAnimal-verifieringsadress ...

source: Checking cluster name availability...
sv: Kontrollerar klusternamnets tillgänglighet...

source: Specified cluster name is already used.
sv: Angivet klusternamn används redan.

source: EDB BigAnimal authentication process is in progress...
sv: EDB BigAnimal-autentiseringsprocessen pågår...

source: Loading...
sv: Läser in...

source: Authentication completed successfully. Click the Next button to proceed.
sv: Autentiseringen slutfördes framgångsrikt. Klicka på knappen Nästa för att fortsätta.

source: Verification failed. Access Denied...
sv: Verifieringen misslyckades. Åtkomst nekad...

source: Authentication completed successfully but you do not have permission to create the cluster.
sv: Autentiseringen slutfördes, men du har inte behörighet att skapa klustret.

source: Authentication is aborted.
sv: Autentiseringen har avbrutits.

source: Error while verifying EDB BigAnimal: ${error.response.data.errormsg}
sv: Fel vid verifiering av EDB BigAnimal: ${error.response.data.errormsg}

source: Deploy Cloud Instance
sv: Distribuera molninstans

source: Select a cloud provider for PostgreSQL database.
sv: Välj en molnleverantör för PostgreSQL-databasen.

source: The verification code to authenticate the pgAdmin to EDB BigAnimal is:
sv: Verifieringskoden för att autentisera pgAdmin till EDB BigAnimal är:

source: By clicking the below button, you will be redirected to the EDB BigAnimal authentication page in a new tab.
sv: Genom att klicka på knappen nedan kommer du att omdirigeras till EDB BigAnimal-autentiseringssidan i en ny flik.

source: Click here to authenticate yourself to EDB BigAnimal
sv: Klicka här för att autentisera dig till EDB BigAnimal

source: Please review the details before creating the cloud instance.
sv: Läs igenom detaljerna innan du skapar molninstansen.

source: Instance name
sv: Förekomstnamn

source: Public IP
sv: Offentlig IP

source: Instance type
sv: Typ av instans

source: Allocated storage
sv: Tilldelad lagring

source: Provisioned IOPS
sv: Tillhandahållna IOPS

source: Database name
sv: Databasnamn

source: High availability
sv: Hög tillgänglighet

source: Public IP range
sv: Offentligt IP-intervall

source: IP address range for allowed inbound traffic, for example: 127.0.0.1/32. Add multiple IP addresses/ranges separated with commas.
sv: IP-adressintervall för tillåten inkommande trafik, till exempel: 127.0.0.1/32. Lägg till flera IP-adresser/intervall åtskilda med kommatecken.

source: Version & Instance
sv: Version & instans

source: Availability
sv: Tillgänglighet

source: The cloud instance will be deployed in the selected region.
sv: Molninstansen kommer att distribueras i den valda regionen.

source: AWS access key
sv: AWS åtkomstnyckel

source: AWS secret access key
sv: AWS hemlig åtkomstnyckel

source: AWS session token
sv: Token för AWS-session

source: Temporary AWS session required session token.
sv: Tillfällig AWS-session som kräver sessionstoken.

source: Password must be 8 characters or more.
sv: Lösenordet måste innehålla 8 tecken eller mer.

source: Invalid password.
sv: Ogiltigt lösenord.

source: pgAdmin server group
sv: pgAdmin-servergrupp

source: At least 8 printable ASCII characters. Cannot contain any of the following: / (slash), '(single quote), "(double quote) and @ (at sign).
sv: Minst 8 skrivbara ASCII-tecken. Får inte innehålla något av följande: / (snedstreck), '(enkelt citattecken), "(dubbelt citattecken) och @ (at-tecken).

source: Confirm password
sv: Bekräfta lösenord

source: Database version
sv: Databasversion

source: Instance class
sv: Instans klass

source: Standard classes (includes m classes)
sv: Standardklasser (inkluderar m-klasser)

source: Memory optimized classes (includes r & x classes)
sv: Minnesoptimerade klasser (inkluderar r- och x-klasser)

source: Burstable classes (includes t classes)
sv: Sprängbara klasser (inkluderar t-klasser)
